{"title": "Baked cod loin with sizzling spinach, ginger and chilli", "tags": null, "planning": {"prep_time": "PT5M", "cook_time": "PT15M", "total_time": "PT20M", "serves": "2"}, "ingredients": [{"item": "2 x 130g pieces cod loin"}, {"item": "1½ tbsp shaoxing rice wine"}, {"item": "2 tbsp soy sauce"}, {"item": "2 garlic cloves, crushed"}, {"item": "300g baby spinach leaves"}, {"item": "3 salad onions"}, {"item": "10g fresh root ginger"}, {"item": "1 red chilli, deseeded"}, {"item": "1½ tbsp sunflower oil"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Place a large sheet of foil on a baking tray and sit the cod on top. Drizzle over the rice wine, ½ tbsp soy and the crushed garlic. Massage the dressing into the fi sh and tightly seal the foil parcel. Bake in the oven for 12 minutes, or until the fi sh is opaque and cooked through."}, {"step": "Meanwhile, place a large pan over a high heat. Add the spinach and toss it every now and again, until wilted. Drain in a sieve, squeezing out any excess liquid."}, {"step": "Cut the salad onion into 4cm lengths, then into very thin slivers. Do the same with the ginger and chilli, slicing it into very fi ne slivers. Dilute the remaining 1½ tbsp soy sauce with 1½ tbsp boiling water."}, {"step": "Arrange the spinach on a serving dish. Top with the cod and any cooking juices. Heat the sunfl ower oil in a pan set over a high heat. Pile up the salad onion, ginger and chilli, placing a heap on each piece of cod. When the oil is extremely hot, almost smoking, pour it over the onion, ginger, chilli and fi sh so that it sizzles. Pour over the diluted soy sauce and serve immediately."}], "nutrition": {"Energy": "1,079kJ 258kcals", "Fat": "12.7g", "Saturated Fat": "1.5g", "Carbohydrate": "6.4g", "Sugars": "5.1g", "Protein": "29.4g", "Salt": "2.5g", "Fibre": "3.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/baked-cod.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}