{"title": "Kale salad with anchovy dressing, artichokes and pecorino", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT15 minutes, plus soaking and maceratingM", "cook_time": "PT0M", "total_time": "PT15 minutes, plus soaking and maceratingM", "serves": "4-6"}, "ingredients": [{"item": "175g pack chargrilled artichoke hearts"}, {"item": "50ml whole milk"}, {"item": "3 anchovy fillets in extra virgin olive oil, drained"}, {"item": "½ garlic clove"}, {"item": "¾ tsp dijon mustard"}, {"item": "2 tbsp extra virgin olive oil"}, {"item": "2 tbsp lemon juice, or more to taste"}, {"item": "300g pentland brig kale, coarse stalks removed"}, {"item": "25g pack flat leaf parsley, stalks finely chopped, leaves roughly chopped"}, {"item": "60g toasted flaked almonds"}, {"item": "50g pecorino romano, finely grated"}], "instructions": [{"step": "Drain the artichokes, reserving the oil, then slice and set aside. Put the milk in a small bowl and add the anchovy fillets. Soak for 10 minutes to make them less salty, then drain and discard the milk."}, {"step": "Crush the anchovies and garlic to a paste in a pestle and mortar. Stir in the mustard, then gradually whisk in the extra virgin olive oil and reserved artichoke oil. Stir in 2 tbsp lemon juice with 2 tbsp water to make a dressing. Season with black pepper. Taste and add a little more lemon juice, if liked."}, {"step": "Roughly tear (or chop) the kale leaves, then toss in a bowl with 2 /3 of the dressing, being quite forceful to break and bruise the leaves slightly (this tenderises them). Set aside for a few minutes to soften further, then toss with the artichokes, parsley, almonds and pecorino. Drizzle with the remaining dressing before serving"}], "nutrition": {"Energy": "Per serving (6) 906kJ 219kcals", "Fat": "19.7g", "Saturated Fat": "3.9g", "Carbohydrate": "3g", "Sugars": "2g", "Protein": "7.4g", "Salt": "1g", "Fibre": "3.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/k/Kale-salad-with-anchovies_1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}