{"title": "Ombre cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT2M", "cook_time": "PT40-50 minutes +cooling and chillingM", "total_time": "PT2 hours 40-50 minutes + chillingM", "serves": "16"}, "ingredients": [{"item": "2 x 250g Country Life Unsalted Butter, softened, plus extra for greasing"}, {"item": "400g Waitrose Golden Caster Sugar"}, {"item": "8 large free-range eggs"}, {"item": "100ml buttermilk"}, {"item": "2 tsp vanilla extract"}, {"item": "500g self-raising flour"}, {"item": "2 tsp baking powder"}, {"item": "4 tsp cocoa powder"}, {"item": "100g Waitrose Dark Brown Muscovado Sugar"}, {"item": "175g 70% cocoa solids dark chocolate, melted"}, {"item": "2 tbsp strong coffee"}, {"item": "300g Country Life Unsalted Butter"}, {"item": "2 tsp vanilla extract"}, {"item": "600g icing sugar"}, {"item": "3 tbsp whole milk"}, {"item": "170ml tub double cream"}, {"item": "180g dark chocolate, chopped"}, {"item": "Waitrose Cooks’ Homebaking Gold Stardust to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line 3 x 18cm round cake tins. Using an electric whisk, cream 250g butter and 250g golden caster sugar until light and fluffy. Add 4 eggs, one at a time, whisking well in between each addition. Stir through the buttermilk and half the vanilla extract, then fold through 250g flour and 1 tsp baking powder."}, {"step": "Divide the mixture into three bowls – making sure you have roughly the same amount in each bowl. (It might be good to weigh the batter, then divide it into three that way.) Leave one bowl plain, and stir 1 tsp cocoa powder into another bowl. With the third, stir in the remaining 3 tsp cocoa powder. Pour each bowl into separate tins, levelling the tops with a spoon. Bake for 20-25 minutes or until a skewer inserted into the cakes comes out clean. Remove, cool for a few minutes, then turn out onto cooling racks. Wash, grease and line the tins for the next batch."}, {"step": "For the next batch of cakes, cream together 250g butter with the remaining 150g caster sugar and the muscovado sugar until light and fluffy. Add the remaining 4 eggs, one by one, mixing well each time. Stir in the remaining 1 tsp vanilla extract, flour and baking powder. Divide the mixture equally among three bowls. Stir 25g melted chocolate into one bowl and set aside. Stir 50g melted chocolate into another bowl and set aside. Stir the remaining 100g chocolate into the final sponge mix along with the coffee. Each bowl should be a different shade of brown. Pour into the tins and bake for 20-25 minutes until a skewer inserted into the cakes comes out clean. Cool in the tins for 10 minutes then set aside to cool on wire racks. You now have six cakes ranging in colour from light to dark brown."}, {"step": "For the icing, beat the butter and vanilla until soft, then slowly add the icing sugar until smooth and fluffy. Gradually add the milk to loosen slightly (you may not need it all)."}, {"step": "To assemble, put a small blob of icing on a large plate and stick the darkest sponge on top. Spoon a heaped tablespoon of icing on the cake and smooth over the top with a palette knife. Top with the next darkest sponge and more icing. Repeat for the other layers until you have an ombre cake going from light to dark. Move the sponges until the tops and sides are level. Spoon on a good amount of icing and use to cover the top and sides of the cake in a thin layer. Smooth with a palette knife. (This is called a crumb coat and doesn’t have to look perfect.) Put the cake in the fridge."}, {"step": "To make the ganache, put the chocolate in a heatproof bowl. Heat the cream in a pan until just boiling, then pour over the chocolate. Leave to melt, without stirring, for 5-10 minutes, then gently stir until smooth and glossy. Set aside for 10-15 minutes – the ganache needs to be pourable but not too runny."}, {"step": "Cover the tops and sides of the cake with a final layer of icing. Pour the ganache over the top of the chilled cake, encouraging it over the edges with a spoon. Sprinkle with the gold dust to finish."}], "nutrition": {"Energy": "3,443kJ 825kcals", "Fat": "49.9g", "Saturated Fat": "28.9g", "Carbohydrate": "86g", "Sugars": "63.1g", "Protein": "7.9g", "Salt": "1.3g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/default_waitrose_recipe.jpg"}