{"title": "Roast shoulder of lamb with mushrooms, balsamic vinegar and potatoes dauphinoise", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT20M", "cook_time": "PT5M", "total_time": "PT5 hours 20 minutesM", "serves": "6"}, "ingredients": [{"item": "2kg lamb shoulder"}, {"item": "1 tbsp vegetable oil"}, {"item": "400g mixed exotic mushrooms"}, {"item": "50g unsalted butter, melted"}, {"item": "400ml fresh chicken stock"}, {"item": "20ml aged balsamic vinegar"}, {"item": "500ml whipping cream"}, {"item": "1 garlic clove, crushed"}, {"item": "1 thyme sprig"}, {"item": "1 tsp salt"}, {"item": "1.2kg large potatoes, such as maris pipe"}], "instructions": [{"step": "Preheat the oven to 140°C, gas mark 1. Place the lamb in a large roasting tin, rub with the oil and season all over including the underside. Cover the whole roasting tin with foil and roast for 3 hours 30 minutes."}, {"step": "For the potatoes dauphinoise, bring the whipping cream, garlic, thyme and salt to just before boiling. Take off the heat and allow to infuse while you peel and thinly slice the potatoes."}, {"step": "Strain the cream into a large bowl, then tip in the sliced potatoes. Layer up in an ovenproof dish (about 1.8 litres in volume), evenly distributing the cream and potatoes and seasoning in between. Carry on doing this until you have reached the top of the dish, then press down to fl atten a little. Set aside until ready to cook."}, {"step": "After the lamb has cooked for 3 hours 30 minutes, remove the foil and cook, uncovered, on the top shelf for another 45 minutes. Put the potatoes dauphinoise on the bottom shelf."}, {"step": "Take out the lamb and allow it to rest, loosely covered with foil. Turn the oven up to 180°C, gas mark 4, move the potatoes to the top shelf and cook them for an extra 30-35 minutes, until golden on top."}, {"step": "When the lamb and dauphinoise are out of the oven, turn the grill to medium-high. Tear up the mushrooms and put on a small baking tray; season and pour over the melted butter. Grill until just cooked, about 3-5 minutes."}, {"step": "Put the lamb on a large serving dish. Pour off and discard any excess fat from the roasting tin, then set over a high heat on the hob and pour in the chicken stock, allowing it to bubble and reduce a little, scraping up any sticky bits from the tin; season. Shred the lamb with 2 forks, then drizzle over the balsamic vinegar and sprinkle with salt. Scatter the mushrooms over the lamb and serve with the roasting juices, the potatoes dauphinoise and some wilted spinach or spring greens, if liked."}], "nutrition": {"Energy": "Per serving (lamb) 2385kJ 574kcals", "Fat": "44.2g", "Saturated Fat": "20.7g", "Carbohydrate": "1.2g", "Sugars": "0.9g", "Protein": "42.9g", "Salt": "0.4g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/MPW-lamb-mushroom.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}