{"title": "Slow-cooked pork with polenta & garlicky greens", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT2 hours 30 minutes to 3 hoursM", "total_time": "PT2 hours 50 minutes to 3 hours 20 minutesM", "serves": "4 - 6"}, "ingredients": [{"item": "2 tsp fennel seeds"}, {"item": "1 tsp black peppercorns"}, {"item": "2 large cloves garlic, crushed"}, {"item": "A good pinch chilli flakes"}, {"item": "Finely grated zest of ½ lemon"}, {"item": "1 tsp sea salt flakes"}, {"item": "1.5kg pork shoulder joint, skin scored"}, {"item": "2 fennel bulbs, trimmed"}, {"item": "1 red onion, peeled"}, {"item": "2 tbsp olive oil"}, {"item": "300ml white wine"}, {"item": "1.75 litres chicken or veg stock"}, {"item": "3 tbsp Marsala"}, {"item": "300g Polenta Valsugana"}, {"item": "3 tbsp finely grated Parmigiano Reggiano"}, {"item": "2 tbsp mascarpone"}, {"item": "25g unsalted butter"}, {"item": "1 large clove garlic, sliced"}, {"item": "200g spring greens, washed and cut into ribbons"}, {"item": "250g Tenderstem broccoli, trimmed"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Lightly crush the fennel seeds and black peppercorns using a pestle and mortar. Add 1 clove garlic, chilli flakes, lemon zest and sea salt flakes, and mix to combine. Rub this mixture into the skin of the pork shoulder, getting the flavourings right into the scored skin."}, {"step": "Cut the fennel and onion into thick slices, and arrange in a large roasting tin. Place the pork on top, rub the skin with 1 tbsp olive oil and roast in the hot oven for 20 minutes."}, {"step": "Reduce the oven temperature to 170°C, gas mark 3. Pour the wine into the roasting tin and continue to cook for a further 1½ hours, checking every 30 minutes and adding 300ml of the stock to the pan as the wine evaporates."}, {"step": "Remove the pork from the tin, cover with foil and leave to rest while you prepare the gravy and polenta. Spoon off any excess fat from the roasting tin and place the tin on the hob over a low-medium heat. Add a further 250ml stock, bring to the boil, reduce to a simmer and continue to cook for a few minutes. Add the Marsala and simmer again until reduced slightly, season to taste and keep warm."}, {"step": "Pour the remaining stock into a large pan and bring to the boil. Add a generous pinch of salt and the polenta, stirring constantly. Continue to cook over a medium heat for about 7 minutes until the polenta is thick and creamy. Add the Parmigiano Reggiano and mascarpone, season with black pepper and mix to combine. Keep warm while you prepare the greens."}, {"step": "Melt the butter in a large sauté pan. Add the garlic and cook for 30 seconds. Add the greens and Tenderstem broccoli, season, cover with a lid and cook for about 2-3 minutes, stirring occasionally until tender. Serve the pork in slices with the polenta, garlicky greens and gravy."}], "nutrition": {"Energy": "3,311kJ 791kcals", "Fat": "41.6g", "Saturated Fat": "15.9g", "Carbohydrate": "49.4g", "Sugars": "7.7g", "Protein": "54.8g", "Salt": "2.1g", "Fibre": "7.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Waitrose-Weekend_WK352_WKEnd_Sunday-Lunch_Pork-Shoulder-Polenta-Garlicky-Greens.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}