{"title": "Steak with blackened salad onions, refried beans and chimichurri", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT15M", "cook_time": "PT20M", "total_time": "PT35M", "serves": "4"}, "ingredients": [{"item": "1 small garlic clove, finely chopped"}, {"item": "½ Waitrose Cooks’ Ingredients Red Chilli, deseeded and finely chopped"}, {"item": "small bunch parsley, leaves and stalks chopped"}, {"item": "very small bunch coriander, leaves and stalks chopped"}, {"item": "very small bunch mint leaves, chopped"}, {"item": "¾ tsp smoked paprika"}, {"item": "1 tsp dried oregano"}, {"item": "2 tbsp red wine vinegar"}, {"item": "100ml extra virgin olive oil, plus 2 tbsp extra for grilling"}, {"item": "435g can Old El Paso Refried Beans"}, {"item": "4 rump, ribeye or sirloin steaks (about 180g each)"}, {"item": "16 salad onions, trimmed"}, {"item": "selected stores"}], "instructions": [{"step": "For the chimichurri, stir the garlic, chilli, herbs, paprika, oregano, vinegar and 100ml oil in a bowl (or whizz the unchopped ingredients in a food processor to save time). Stir in 1 tbsp cold water to loosen, then season. Warm the refried beans in a saucepan."}, {"step": "Take the steaks out of the fridge 30 minutes before cooking. Rub each with a little oil; season. Put a griddle pan over a medium-high heat. When the pan is smoking hot, add the steaks (you may need to do this in batches) and cook for 2-3 minutes on each side (for medium-rare). Wrap in foil and set aside on a warm plate to rest."}, {"step": "Rub the salad onions with a little oil before griddling for 5-6 minutes, turning often, until charred and tender in the middle. Transfer to a bowl and season."}, {"step": "Divide the refried beans between warm plates, then slice the steak and place on top of the beans. Drape the salad onions over and drizzle everything with the chimichurri."}], "nutrition": {"Energy": "2,620kJ 629kcals", "Fat": "40g", "Saturated Fat": "7.8g", "Carbohydrate": "16.7g", "Sugars": "2.2g", "Protein": "47g", "Salt": "1.5g", "Fibre": "6.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/STEAK WITH BLACKENED SALAD ONIONS, REFRIED BEANS AND CHIMICHURRI.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}