{"title": "Veal meatballs in cannellini and tomato sauce with couscous", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT35M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "2 tbsp essential Waitrose olive oil"}, {"item": "2 onions, grated"}, {"item": "2 garlic cloves, crushed"}, {"item": "400g chopped tomatoes"}, {"item": "400g can cannellini beans, drained and rinsed"}, {"item": "½ tsp caster sugar"}, {"item": "½ x 15g pack oregano, leaves picked"}, {"item": "400g pack Waitrose 1 British veal mince"}, {"item": "½ lemon, zest"}, {"item": "6 sage leaves, finely chopped"}, {"item": "150ml fresh chicken stock (or water)"}, {"item": "200g couscous"}, {"item": "450g essential Waitrose spinach"}], "instructions": [{"step": "In a large pan, heat 1 tbsp oil and soften 1 onion and 1 garlic clove for 1-2 minutes. Add the tomatoes, beans, sugar and oregano. Stir in 200ml water; season. Simmer for 20 minutes, stirring occasionally."}, {"step": "Meanwhile, in a bowl, mix the veal, remaining onion and garlic, lemon zest and sage; season. With damp hands, roll the mixture into 12-14 balls. Heat the remaining 1 tbsp oil in a frying pan over a medium-high heat. Cook the meatballs (in batches if needed), turning, for 5-10 minutes, until browned."}, {"step": "Bring the stock (or water) to a boil. Put the couscous in a heatproof bowl and season. Pour over the hot stock, cover with cling film and set aside for 10 minutes. Put the spinach in a large colander and pour over a kettle of just-boiled water to wilt. Refresh under cold water, squeeze out the liquid and set aside on kitchen paper."}, {"step": "When the sauce is ready, add the meatballs, cover and simmer for a further 5-10 minutes, until cooked through. Fluff up the couscous with a fork, then roughly chop the spinach and stir it through; season. Divide between 4 warm bowls and top with the meatballs and sauce."}], "nutrition": {"Energy": "2,012kJ 479kcals", "Fat": "15.6g", "Saturated Fat": "4.1g", "Carbohydrate": "46g", "Sugars": "10.8g", "Protein": "32.7g", "Salt": "0.8g", "Fibre": "10.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Veal-meatballs.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}