{"title": "A cottage pie for entertaining", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT70M", "total_time": "PT90M", "serves": "4"}, "ingredients": [{"item": "1 tbsp Olive oil"}, {"item": "1 Onion, finely chopped"}, {"item": "500g Aberdeen Angus Lean Minced Beef (10% fat), from service counter"}, {"item": "300ml Red wine"}, {"item": "2 Sprigs thyme, leaves only"}, {"item": "2 tbsp Bay leaves, torn"}, {"item": "2 tbsp Tomato purée"}, {"item": "500g Waxy potatoes, such as Desirée or Charlotte"}, {"item": "2 Small leeks, washed and sliced"}, {"item": "200ml Waitrose Half-Fat Crème Fraîche"}, {"item": "50g Butter, melted"}], "instructions": [{"step": "Heat the oil in a large frying pan and fry the onion for 3-4 minutes, until soft. Add the beef and cook for a further 10 minutes, until evenly browned. Pour in the wine and add the herbs. Season and stir in the tomato purée, then reduce the heat and leave to simmer gently for about 20 minutes, stirring occasionally, until the liquid has evaporated.  Meanwhile, preheat the oven to 190°C, gas mark 5. Place the potatoes, whole and unpeeled, in a pan of cold water. Bring to the boil and cook for 4-5 minutes. Drain and plunge into cold water. Simmer the sliced leeks in a pan with enough boiling water to cover, until just tender. Drain and spoon into the base of 4 individual dishes (about 250-300ml). Top the leeks with crème fraîche.  Using a sharp knife, peel the cooled potatoes, then grate coarsely into a large bowl. Pour over the melted butter and toss to coat.  Discard the bay leaves and spoon the beef over the leeks. Top each dish with grated potatoes. Bake for 35 minutes until crisp and golden."}], "nutrition": {"Energy": "2527.136kJ 604.0kcal", "Fat": "34.8g", "Saturated Fat": "17.8g", "Sugars": "7.6g", "Salt": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/posh_cottage_pie_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}