{"title": "Almond and Pistachio Baklava", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT60M", "cook_time": "PT45M", "total_time": "PT105M", "serves": "about 24 pieces"}, "ingredients": [{"item": "2 cinnamon sticks"}, {"item": "6 whole cloves"}, {"item": "40g sesame seeds"}, {"item": "6 whole black peppercorns"}, {"item": "250g almonds (with skins on), chopped"}, {"item": "150g shelled pistachios, chopped"}, {"item": "1 lemon, finely grated zest"}, {"item": "6 tbsp granulated sugar"}, {"item": "16 sheets Filo Pastry"}, {"item": "75g unsalted butter, melted"}, {"item": "Syrup"}, {"item": "450g granulated sugar"}, {"item": "Pinch of sea salt flakes"}, {"item": "1 lemon, juice and 3 strips zest, 6cm each"}, {"item": "1 cinnamon stick, broken"}, {"item": "1 tsp Star Kay White Rose Water"}], "instructions": [{"step": "Preheat oven to 200°C, gas mark 6. Put the spices, sesame seeds and peppercorns in a dry pan and roast over a high heat for 2 minutes until you start to smell the aromas. Allow to cool then place in a spice grinder, or mortar and pestle, and finely grind. Put the nuts in a bowl and add the ground spice mixture with the lemon zest and 6 tbsp granulated sugar. Set aside.  Open out the filo pastry, and cover with a damp tea-towel to prevent it from drying out. Brush a rectangular baking tray, about 18 x 32cm and 3-4cm deep, with vegetable oil. Brush a sheet of filo with butter and place in the baking tray. Repeat to make 8 layers. Trim to a snug fit.  Add the nut mixture and spread evenly. Brush remaining pastry with butter and layer until all the pastry is used. Trim the top to a snug fit. Press down gently with the palm of your hand. Lightly score the pastry top but do not cut all the way through into the nuts. Criss-cross in 5cm diagonal lines to give a diamond pattern. Brush top with butter and bake for 25-30 minutes.  Meanwhile, make the syrup. Put the sugar in a pan with 300ml water, a pinch of sea salt flakes, the lemon juice and strips of zest and the cinnamon. Heat gently until sugar dissolves. Bring to the boil and boil for 5-8 minutes until the syrup is light and slightly thickened. Add the rose water to taste. Cool quickly by placing the pan in a bowl of ice.  Remove baklava from oven. Cut the pastry all the way through to make at least 24 pieces. Discarding the cinnamon and lemon zest, gently spoon the syrup over the baklava. (Adding cold syrup to hot pastry keeps the pastry crisp.) Cool completely. Serve decorated with pistachios."}], "nutrition": {"Energy": "987.424kJ 236.0kcal", "Fat": "12.3g", "Saturated Fat": "2.8g", "Sugars": "26.5g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/0308sps10-r06.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}