{"title": "Lemon and Elderflower Roulade", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25M", "cook_time": "PT15-18M", "total_time": "PT40-43 minutesM", "serves": "6-8"}, "ingredients": [{"item": "25g butter, cubed"}, {"item": "75g caster sugar"}, {"item": "1 tbsp elderflower cordial"}, {"item": "Grated zest and juice of 1 lemon"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg, beaten"}, {"item": "4 medium Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "100g caster sugar"}, {"item": "100g ground almonds"}, {"item": "200ml whipping cream, lightly whipped"}, {"item": "Icing sugar for dusting"}], "instructions": [{"step": "First prepare the curd. Place the butter, sugar, elderflower cordial, lemon zest and juice in a medium bowl, stir and microwave on medium power in 15 second bursts until the butter has melted and the sugar dissolved, whisking after each burst. Stir in the beaten eggs and continue microwaving for 15 second sessions, stirring after each time and reducing the setting to medium as the mixture thickens, until the curd is thick enough to coat the back of a wooden spoon. This should take about 3 minutes depending on your oven. Strain the curd into a bowl and leave to cool. Cover and store in the fridge for up to a week."}, {"step": "Preheat the oven to 180°C, gas mark 4. Line a 34 x 24cm swiss roll tin with baking parchment. Whisk the egg yolks and sugar together with an electric mixer until the mixture is pale and thick enough to hold a trail across the surface when you lift out the beaters. Fold in the almonds quickly and lightly. Whisk the egg whites until the soft peak stage then fold in. Spoon into the prepared tin and spread evenly with a spatula. Bake for 12 minutes until light, golden and just firm to the touch. Turn the roulade out onto a sugared sheet of baking parchment. Peel off the lining paper and leave to cool completely."}, {"step": "To assemble, trim the edges of the roulade. Spread with the lemon curd, leaving a 2cm border around the edge. Spoon over the whipped cream. Roll up from a short end and transfer to a serving dish. Dust with icing sugar and chill until ready to serve."}], "nutrition": {"Energy": "1,459kj/350kcals", "Fat": "23.4g", "Saturated Fat": "9.4g", "Carbohydrate": "27.1g", "Sugars": "26.8g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/Almond_roulade.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}