{"title": "Angela Hartnett's meatballs in tomato sauce", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "6 tbsp olive oil, plus extra for drizzling"}, {"item": "2 onions, finely chopped"}, {"item": "2 x 400g cans plum tomatoes"}, {"item": "1 garlic clove, finely chopped"}, {"item": "2 tsp tomato purée"}, {"item": "pinch caster sugar"}, {"item": "1 sprig fresh rosemary"}, {"item": "6 tbsp milk"}, {"item": "1 thick slice day-old white bread, crusts removed, roughly torn"}, {"item": "400g beef mince (10% fat)"}, {"item": "25g parmigiano reggiano, grated"}, {"item": "3/4 x 25g pack flat leaf parsley, chopped"}, {"item": "1 egg, beate"}, {"item": "plain flour, for dusting"}, {"item": "cooked soft polenta, to serve"}], "instructions": [{"step": "Heat 2 tbsp oil in a large pan over a medium heat. Add ½ the finely chopped onion and cook for 5 minutes, or until soft and translucent. Add the tomatoes to the pan (crushing them with a fork to break them up), along with the garlic, tomato purée, sugar and rosemary. Lower the heat and simmer for 25-30 minutes, or until the sauce has a thick, jam-like consistency. Remove the rosemary sprig and set the sauce aside."}, {"step": "Meanwhile, put the milk in a bowl with the bread for a minute or so; mash with a fork. In another bowl, mix the mince, cheese, remaining onion and 2/3 of the parsley; season. Add the bread mixture, then mix in the beaten egg. To check the seasoning, fry a teaspoonful of the mixture until cooked through and taste; adjust the seasoning as necessary."}, {"step": "With floured hands, divide the mixture into 12 and roll into balls; set aside. In a wide, shallow pan big enough to hold the meatballs in one layer, heat the remaining 4 tbsp oil over a medium heat. Add the meatballs; cook until browned all over (about 8 minutes), turning very gently to prevent them breaking up. Remove from the pan; drain off the excess oil."}, {"step": "Return the meatballs to the pan; pour in the tomato sauce. Cover with parchment, foil or a tight-fitting lid; cook gently over a low heat for 25 minutes. Remove the meatballs from the heat, sprinkle with the remaining parsley and serve immediately with the polenta. The cooked meatballs can be frozen for up to 3 months (and defrosted in the fridge) or chilled for up to 2 days. Reheat until piping hot before serving."}], "nutrition": {"Energy": "2,945kJ 703kcals", "Fat": "34g", "Saturated Fat": "9.2g", "Carbohydrate": "62g", "Sugars": "16g", "Protein": "33g", "Salt": "0.6g", "Fibre": "6.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/AHW_Meatballs-.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}