{"title": "Apple and blackberry pie", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus chilling and coolingM", "cook_time": "PT1 hour 30 minutes M", "total_time": "PT1 hour 50 minutes, plus chilling and coolingM", "serves": "8-10"}, "ingredients": [{"item": "750g sweet shortcrust pastry"}, {"item": "2 bramley apples, peeled and chopped"}, {"item": "3 estivale apples, peeled and each cut into 12 wedges"}, {"item": "150g golden caster sugar, plus extra for sprinkling"}, {"item": "1 tsp ground cinnamon"}, {"item": "½ tsp ground ginger"}, {"item": "50g unsalted butter"}, {"item": "170g blackberries"}, {"item": "¼ orange, zest"}, {"item": "1 egg, beaten"}], "instructions": [{"step": "Roll ½ the pastry to the thickness of a £1 coin and use to line the base of a 4cm-deep, 23cm loose-bottomed tart tin, with a little pastry overhanging. Prick the base, line with baking parchment and fill with baking beans. Chill for 1 hour."}, {"step": "Meanwhile, put the apples, sugar, spices, butter and a pinch of salt in a pan. On a low heat, stir until the sugar has dissolved. Raise the heat and, stirring now and then, simmer for 10 minutes, until the bramleys have collapsed and the estivales are soft. Take off the heat, stir in the blackberries and orange zest; set aside to cool."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Put the tart tin on a baking sheet and bake for 15 minutes, then remove the baking parchment and beans and bake for 10 minutes more. Brush the inside of the case with a little beaten egg and return to the oven for 2 minutes. Cool briefly, then carefully trim off the overhanging pastry with a serrated knife."}, {"step": "Drain any excess liquid from the fruit, then spoon into the case; brush the rim with more beaten egg. Roll out the remaining pastry to the thickness of a £1 coin and cut into ten strips, about 2cm wide. Use to make a lattice topping, trimming the edges level with the pie case. Brush generously with beaten egg, then sprinkle with more sugar and bake for 45 minutes. Remove, sprinkle with more sugar and cool for at least 15 minutes. Remove from the tin and serve with cream, if liked. LH Per serving"}], "nutrition": {"Energy": "2,232kJ 533kcals", "Fat": "27.6g", "Saturated Fat": "12.4g", "Carbohydrate": "64.9g", "Sugars": "31.6g", "Protein": "6.3g", "Salt": "0.6g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/Apple-Pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}