{"title": "Apple pancakes with blackberry butter", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT20M", "total_time": "PT35M", "serves": "18"}, "ingredients": [{"item": "For the butter"}, {"item": "200g blackberries, plus extra to serve"}, {"item": "25g golden caster sugar"}, {"item": "1 tbsp lemon juice"}, {"item": "75g unsalted butter"}, {"item": "284ml pot buttermilk"}, {"item": "3 large Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "Finely grated zest and juice 2 unwaxed lemons"}, {"item": "1 tsp vanilla bean paste"}, {"item": "3 Cox apples (plus 2 extra sliced apples, optional)"}, {"item": "25g unsalted butter, melted and cooled slightly, plus extra for cooking"}, {"item": "25g golden caster sugar"}, {"item": "175g self-raising flour"}], "instructions": [{"step": "First make the blackberry butter. Place the blackberries, sugar and lemon juice in a small pan over a high heat and bring to the boil. Reduce the heat slightly and simmer for 5 minutes, until syrupy. Remove from the heat and leave to cool slightly before beating in the butter until thoroughly mixed. Spoon into a small serving dish and chill until needed."}, {"step": "For the pancakes, place the buttermilk, egg yolks, lemon zest and juice in a bowl with the vanilla and stir to combine. Peel, core and coarsely grate one of the apples. Add it together with the melted butter, sugar and a pinch of salt to the bowl, then sift over the flour and mix well."}, {"step": "In a clean bowl, whisk the egg whites until soft peaks form. Gently fold into the apple mixture using a metal spoon."}, {"step": "Slice the remaining apples horizontally into 18 slices. Remove any pips. Melt a little knob of butter in a non-stick frying pan over a medium heat. Add about 2 dessertspoons of batter, top with a slice of apple if using and cook for 2 minutes on each side or until golden. Keep warm while you make a further 17 pancakes, cooking several at once if your pan is big enough and adding more butter if needed. Serve the hot pancakes with the blackberry butter to spoon over and extra blackberries on top."}], "nutrition": {"Energy": "1,637kj 391kcals", "Fat": "19.9g", "Saturated Fat": "11.4g", "Carbohydrate": "44.2g", "Sugars": "22.5g", "Protein": "8.8g", "Salt": "0.7g", "Fibre": "3.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/ApplePancakes_blackberry-butter2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}