{"title": "Martha's apple fritters with honey & sesame", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT10M", "cook_time": "PT10M", "total_time": "PT20M", "serves": "25 small fritters"}, "ingredients": [{"item": "140g plain flour"}, {"item": "25g caster sugar"}, {"item": "1 tsp baking powder"}, {"item": "½ tsp salt"}, {"item": "75ml whole milk"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "25g butter, melted"}, {"item": "1 tsp vanilla extract"}, {"item": "2 Pink Lady Apples, peeled and cored"}, {"item": "Vegetable oil, for deep frying"}, {"item": "4 tbsp clear honey"}, {"item": "15g sesame seeds, toasted"}], "instructions": [{"step": "In a large bowl, combine the flour, sugar, baking powder and salt."}, {"step": "Whisk together the milk, egg, butter and vanilla extract in a measuring jug, then pour the wet ingredients into the dry ingredients and stir until a thick batter forms."}, {"step": "Slice the peeled and cored apples into small chunks and then add to the batter. You can refrigerate the batter at this point if you want to cook the fritters later."}, {"step": "Half fill a medium-sized saucepan with vegetable oil and place over a medium heat. Lay a few sheets of kitchen towel on a wire rack, ready to absorb excess oil."}, {"step": "Test that the oil is hot enough by dropping a very small amount of batter into the pan. If it sizzles, it is ready to use. Use a teaspoon or small ice-cream scoop to drop balls of the batter into the oil. Cook for 3-4 minutes, turning once, until the fritters are puffed and golden brown all over. Repeat with the rest of the batter."}, {"step": "Remove the fritters from the oil using a slotted spoon and place on the wire rack. Pile up the cooked fritters, drizzle with honey and sprinkle with sesame seeds just before serving. These fritters are best eaten immediately."}], "nutrition": {"Energy": "368kJ 88kcals", "Fat": "4.7g", "Saturated Fat": "1.1g", "Carbohydrate": "10.3g", "Sugars": "6g", "Protein": "1.1g", "Salt": "0.2g", "Fibre": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/AppleFrittersWHoneySesame_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}