{"title": "Apple and blackberry loaf with clotted cream icing", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT35 minutes, plus coolingM", "cook_time": "PT1 hourM", "total_time": "PT1 hour 35 minutes, plus coolingM", "serves": "10-12"}, "ingredients": [{"item": "150g unsalted butter, plus extra for greasing"}, {"item": "150g light brown soft sugar"}, {"item": "3 eggs"}, {"item": "185g self-raising flour, sifted"}, {"item": "1 tsp vanilla extract"}, {"item": "½ tsp baking powder"}, {"item": "150g blanched hazelnuts, toasted and roughly chopped"}, {"item": "320g Waitrose Bramley Cooking Apples (about 2), peeled and chopped into 1cm cubes"}, {"item": "180g Waitrose 1 Speciality Blackberries"}, {"item": "227g Rodda’s Classic Cornish Clotted Cream"}, {"item": "450g icing sugar, sifted"}, {"item": "1-2 tsp whole milk (optional)"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line a 900g loaf tin. Using electric beaters or a freestanding mixer, beat together the butter and sugar. Beat in the eggs, one at a time, alternating with a few spoonfuls of the flour, then the vanilla extract, until combined. Stir through the remaining flour, plus the baking powder and 100g chopped hazelnuts, then fold in the cubed apple until just combined."}, {"step": "Spoon 1/3 of the mixture into the tin, then dot with ½ the blackberries. Add another 1/3 of mixture, followed by the remaining blackberries, then finish with the rest of the mixture. Bake for about 1 hour, or until a skewer inserted in the loaf comes out clean; cover with foil after about 45 minutes if it’s browning too quickly on top."}, {"step": "To make the icing, whisk the clotted cream with electric beaters until smooth. Gradually sift in the icing sugar until you have a thick icing. Loosen with 1-2 tsp milk for a spreadable consistency, if required; keep chilled until needed if baking on a warm day."}, {"step": "When the loaf is cooked, leave to cool in its tin for 10 minutes before carefully removing and allowing to cool completely on a wire rack. When cool, top with the clotted cream icing, before scattering with the remaining 50g chopped hazelnuts. Serve with extra fresh blackberries alongside, if liked."}], "nutrition": {"Energy": "Per serving (12) 2414kJ 578kcals", "Fat": "32g", "Saturated Fat": "15g", "Carbohydrate": "65g", "Sugars": "53g", "Protein": "6g", "Salt": "0.3g", "Fibre": "3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/Apple-and-blackberry-loaf-with-clotted-cream.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}