{"title": "Apple and cinnamon crumble cake", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT1M", "total_time": "PT75M", "serves": "12 pieces"}, "ingredients": [{"item": "125g plain flour"}, {"item": "1 tsp ground cinnamon"}, {"item": "50g slightly salted butter, cold, cubed"}, {"item": "125g demerara sugar"}, {"item": "50g roasted chopped hazelnuts"}, {"item": "250g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "125g slightly salted butter, softened"}, {"item": "150g golden caster sugar"}, {"item": "1 tsp vanilla bean paste"}, {"item": "150ml milk"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "6 Cox apples"}, {"item": "Juice 1 lemon"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line a 28 x 22cm rectangular cake tin with baking parchment. For the crumble topping, place the flour, cinnamon and cold butter into a large bowl and rub together with your fingertips until the mixture resembles breadcrumbs. Stir in the sugar and nuts then transfer to the fridge."}, {"step": "For the cake, sift the flour and baking powder into a bowl and set aside. Using a mixer or electric handheld whisk, cream the butter, sugar and vanilla until pale and fluffy. In a separate bowl, whisk together the milk and eggs. Gradually beat a little flour into the butter mixture, followed by a little of the milk and eggs, alternating until they're all mixed in. Spoon the cake mixture into the prepared tin and level with the back of a spoon."}, {"step": "Peel, core and halve the apples, then slice thinly and toss in the lemon juice. Arrange on top of the cake mixture then sprinkle the chilled crumble over the top."}, {"step": "Bake for 1 hour or until a skewer inserted into the centre of the cake comes out clean. Transfer to a wire rack to cool then cut into 12 pieces. Great with a spoonful of Waitrose Caramel Sauce, or whipped cream."}], "nutrition": {"Energy": "169kj 403kcals", "Fat": "16.7g fat", "Saturated Fat": "8.5g", "Carbohydrate": "57.2g", "Sugars": "32.8g", "Protein": "5.9g", "Salt": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/TV/AppleCrumble_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}