{"title": "Apple and blackberry crumble pie", "tags": null, "planning": {"prep_time": "PT15 minutes + chillingM", "cook_time": "PT70M", "total_time": "PT85 minutes + chillingM", "serves": "8"}, "ingredients": [{"item": "500g pack Jus-Rol Shortcrust pastry"}, {"item": "Finely grated zest and juice of 1 lemon"}, {"item": "2-3 medium Bramley apples"}, {"item": "2 eating apples, such as Cox"}, {"item": "75g golden caster sugar"}, {"item": "1½ tbsp plain flour"}, {"item": "150g pack fresh blackberries"}, {"item": "75g spelt or wholemeal plain flour"}, {"item": "75g butter, chilled and cut into cubes"}, {"item": "75g Waitrose lOVE life Mixed Nuts, toasted"}, {"item": "50g porridge oats"}, {"item": "50g light brown muscovado sugar"}], "instructions": [{"step": "Preheat the oven to 200ºC, gas mark 6. On a lightly floured work surface, roll out the pastry to the thickness of a £1 coin. Line a 20cm (6-8cm deep) loose-bottomed or spring-form tin, allowing the edges of the pastry to overhang slightly. Scrunch a square of baking parchment and use to line the pastry case then fill with baking beans. Blind bake for"}, {"step": "minutes, remove the paper and baking beans and bake for a further 4-5 minutes. Remove from the oven and set aside to cool slightly."}, {"step": "Meanwhile, place the lemon zest and juice in a large bowl. Peel, core and thinly slice the apples and add to the bowl, turning them through the lemon juice to prevent them from turning brown. Drain and discard any liquid that collects at the bottom of the bowl. Sprinkle the sugar and flour over the top of the apples and gently toss to distribute evenly."}, {"step": "Layer half the apple slices into the baked pastry case. Scatter over the blackberries then top with the remaining apple slices."}, {"step": "To make the topping, place the flour in a bowl with the butter. Rub in the butter using the tips of your fingers until it resembles coarse breadcrumbs. Coarsely chop the toasted nuts and stir into the mixture with the oats and sugar. Sprinkle over the top of the apples, then bake for 45-50 minutes until golden and the apples are tender. Serve warm with the blackberry and apple juices from the pie, and cream or custard."}], "nutrition": {"Energy": "2451.824kJ 586kcal", "Fat": "31.9g", "Saturated Fat": "11.4g", "Carbohydrate": "66.6g", "Sugars": "24.3g", "Protein": "8g", "Salt": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/Inspiration/Autumn/Waitrose_Crumble_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}