{"title": "Apple and honey tart", "tags": null, "planning": {"prep_time": "PT50 minutes, plus chilling and coolingM", "cook_time": "PT1 hour 10 minutesM", "total_time": null, "serves": "8 - 10"}, "ingredients": [{"item": "2 cox or spartan apples, halved and cored"}, {"item": "½ lemon, juice"}, {"item": "1 tbsp Scottish heather honey, to glaze"}, {"item": "1 tbsp apricot jam, to glaze"}, {"item": "1 cardamom pod"}, {"item": "150g plain flour, plus extra for dusting"}, {"item": "50g spelt flour"}, {"item": "3 tbsp icing sugar"}, {"item": "100g unsalted butter, cubed and chilled"}, {"item": "1 egg yolk"}, {"item": "100g unsalted butter, softened"}, {"item": "75g caster sugar"}, {"item": "50g Scottish heather honey"}, {"item": "2 eggs"}, {"item": "100g ground almonds"}, {"item": "2 tbsp plain flour"}], "instructions": [{"step": "For the pastry, open the cardamom pod and crush the seeds in a pestle and mortar; discard the pod. Mix into the flours with a good pinch of salt and the icing sugar, then whizz with the butter in a food processor until the consistency of breadcrumbs. Mix the egg yolk with 2 tbsp ice-cold water, add to the processor and whizz until it comes together. Remove, knead briefly and gently until smooth, then shape into a puck, wrap in cling film and chill for 30 minutes."}, {"step": "Preheat the oven to 200˚C, gas mark 6. On"}, {"step": "a lightly floured surface, roll out the pastry to 0.3cm thick; use to line a 23cm fluted tart case. Trim the edges and prick the base, then line with baking parchment and fill with baking beans; chill for 30 minutes (or freeze for 15 minutes)."}, {"step": "Blind bake the tart case for 20 minutes, then remove the parchment and beans and cook for a further 5 minutes. Set aside to cool."}, {"step": "For the frangipane, using electric beaters, cream the butter and sugar until pale and fluffy. Beat in the honey, then the eggs, one by one. Beat in the almonds, flour and a pinch of salt until just combined. Spread evenly over the case."}, {"step": "To decorate the tart, either slice the apples into 0.5cm wedges, toss in the lemon juice, then arrange in circles, pushing lightly into the frangipane, or use a mandolin to slice the apples thinly, toss in the lemon juice, then twirl and curl to create flower shapes, pushing them into the frangipane as deeply as possible."}, {"step": "Reduce the oven to 180˚C, gas mark 4. Bake the tart for 40-45 minutes, until the frangipane is golden. Heat the 1 tbsp honey and apricot jam in a small pan until warm, then brush over the tart. Allow to cool, then serve."}], "nutrition": {"Energy": "1,743Kj 418kcals", "Fat": "24.4g", "Saturated Fat": "11.8g", "Carbohydrate": "42.8g", "Sugars": "24.7g", "Protein": "6.6g", "Salt": "0.1g", "Fibre": "2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Apple and honey tart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}