{"title": "Aromatic Asian Steak with Sweet and Sour Cucumber Salad", "tags": null, "planning": {"prep_time": "PT10 mins, plus 2 hours marinatingM", "cook_time": "PT18M", "total_time": "PT2 hours 20 minutes  - 2 hours 28 minutes, including marinatingM", "serves": null}, "ingredients": [{"item": "300-400g piece Aberdeen Angus sirloin steak, hand cut to a thickness of 2cm-3cm"}, {"item": "1 tsp groundnut oil"}, {"item": "For the cucumber salad"}, {"item": "½ cucumber"}, {"item": "½ x 150g pack radishes, thinly sliced"}, {"item": "1 tsp sugar"}, {"item": "3 tbsp rice vinegar"}, {"item": "½ red chilli, deseeded and finely chopped"}, {"item": "For the marinade"}, {"item": "1cm piece ginger, peeled and finely chopped"}, {"item": "1 tbsp lime juice"}, {"item": "1 tbsp clear honey"}, {"item": "2 tbsp light soy sauce"}, {"item": "2 tsp Bart Chinese Five Spice Paste"}, {"item": "1 tbsp rice vinegar"}], "instructions": [{"step": "Score a crisscross pattern onto the surface of the steak  on both sides. Place in a food bag with all the marinade ingredients then seal and refrigerate for at least 2 hours.  To make the salad, remove the cucumber skin using a  Y-shaped peeler. Discard. Peel the cucumber into ribbons, discarding the seeded core. Place the cucumber in a dish with the radish. Mix together the sugar, vinegar and chilli, and drizzle over the salad. Season, cover and chill until needed.  Preheat the oven to 180C, gas mark 4. Add the oil to a non-stick griddle pan or frying pan and heat to smoking point. Add the steak and cook for 1-2 minutes on each side until just chargrilled. Transfer the steak to a small ovenproof dish, pouring over any remaining marinade, and cook in the oven for 8 minutes for rare, 12 minutes for medium rare and 15 minutes for well done.  Cut the steak into slices and divide between two plates. Serve with the cucumber salad and Thai rice with coriander."}], "nutrition": {"Energy": "1606.656kJ 384.0kcal", "Fat": "15.2g", "Saturated Fat": "6.0g", "Sugars": "16.9g", "Salt": "2.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/0707r07.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}