{"title": "Artichoke & olive rösti", "tags": [{"tag": "Vegan"}, {"tag": "Gluten Free"}, {"tag": "Christmas"}], "planning": {"prep_time": "PT30M", "cook_time": "PT35M", "total_time": null, "serves": "20"}, "ingredients": [{"item": "500g Charlotte potatoes, scrubbed"}, {"item": "1 tsp fennel seeds"}, {"item": "2 shallots, finely chopped"}, {"item": "280g jar Waitrose Artichoke Hearts"}, {"item": "3 tbsp Waitrose Green Olive, Lemon & Coriander Tapenade"}, {"item": "60g Violife Vegan Mozzarella Flavour Block, finely grated"}, {"item": "Coriander sprigs, to garnish"}], "instructions": [{"step": "Bring a saucepan of water to the boil, add the potatoes and boil for 5 minutes (no need to peel them first). Rinse in cold water to cool the potatoes. Coarsely grate into a large bowl and stir in the fennel seeds, shallots and seasoning. This can be prepared a day ahead."}, {"step": "Drain the artichokes, reserving 3 tbsp of the oil. Stir 1 tbsp oil into the potatoes. Heat another 1 tbsp of oil in a large frying pan. Place a 5cm round cookie cutter in the pan and put a heaped dessertspoon of the potato mixture inside the cutter. Pack down firmly with the back of the spoon. Carefully lift away the cutter and make more rösti circles with about half the remaining mixture, spacing them slightly apart. Fry for 5 minutes on each side until golden. Transfer to a baking parchment-lined baking sheet and fry the remaining mixture in the same way using the remainder of the oil."}, {"step": "Spread a scant ½ tsp of the tapenade onto each rosti and top with a piece of artichoke. Sprinkle with the mozzarella, cover loosely and chill until needed."}, {"step": "To serve, preheat the oven to 180°C, gas mark 4. Bake the rösti for 10 minutes until heated through. Garnish with coriander sprigs."}], "nutrition": {"Energy": "272kJ 65kcals", "Fat": "4.4g", "Saturated Fat": "1g", "Carbohydrate": "5.3g", "Sugars": "0.9g", "Protein": "0.7g", "Salt": "0.3g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/WRWK30112017_Artichoke-&-Olive-Rosti.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}