{"title": "Asian steak & peanut  stir-fry", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT10M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "340g pack essential Waitrose Frying Steak"}, {"item": "2 tbsp reduced salt soy sauce"}, {"item": "½ tsp Chinese five-spice"}, {"item": "1 January King Cabbage, quartered, cored and finely shredded"}, {"item": "25g Love Life Natural Roasted Peanuts, chopped"}, {"item": "Spray olive oil (x 6 sprays)"}, {"item": "1 tbsp each Cooks’ Ingredients Frozen Ginger, Chilli, Garlic and Shallots"}, {"item": "1 tbsp fish sauce"}, {"item": "1 lime, plus wedges to serve"}, {"item": "25g pack fresh coriander"}], "instructions": [{"step": "Put the steak in a shallow dish and pour over the soy sauce and five-spice. Place the cabbage in a colander in the sink. Pour over a kettleful of freshly boiled water, then drain."}, {"step": "Warm a wok or large frying pan and toast the peanuts for 1 minute, or until starting to colour. Set aside. Spray the pan with oil and return to a high heat. Reserving the soy mixture, add the steak to the pan. Sear for 1 minute each side. Remove, set aside on a plate and keep it warm."}, {"step": "Return the pan to the heat; spray with more oil. Add the ginger, chilli, garlic and shallots. Stir-fry for 30-60 seconds. Mix in half the peanuts. Add the cabbage and stir-fry for 4-5 minutes until wilted. Stir in the soy marinade, fish sauce, lime juice and three-quarters of the coriander, chopped. Reserve a handful of leaves for garnish."}, {"step": "Cut the steak into thin strips; add to the stir-fry with any juices. Top with the coriander leaves, remaining peanuts and lime wedges."}], "nutrition": {"Energy": "1,160kJ 278kcals", "Fat": "17.2g", "Saturated Fat": "5.92g", "Carbohydrate": "8.4g", "Sugars": "6.3g", "Protein": "22.4g", "Salt": "1.6g", "Fibre": "4.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/WRWK050117_Asian_steak_&_peanut_stir-fry.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}