{"title": "Asparagus, tarragon and egg pie", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6"}, "ingredients": [{"item": "300g ready-made shortcrust pastry"}, {"item": "12 quails' eggs"}, {"item": "450g bunch asparagus"}, {"item": "1 tsp olive oil"}, {"item": "25g butter"}, {"item": "25g plain flour"}, {"item": "250ml milk, plus a little for glazing"}, {"item": "20g pack fresh tarragon, leaves finely chopped"}], "instructions": [{"step": "Remove the pastry from the fridge 30 minutes before starting. Add the eggs to a pan of gently boiling water, boil for 1 minute, then leave in the hot water for 30 seconds. Run the eggs under cold water, crack the shells then peel. Set to one side."}, {"step": "Preheat the oven to 200°C, gas mark 6. Snap the ends off the asparagus and cut the spears into 2.5cm pieces. Place on a baking sheet, season and drizzle with the oil. Roast in the oven for 10 minutes while it is preheating, then leave until required."}, {"step": "Melt the butter in a pan and stir in the flour. Cook over a low heat until it bubbles. Gradually stir in half the milk off the heat, beating well after each addition, then stir in the remaining milk. Bring to the boil, stirring, and cook for 1 minute more. Add the tarragon and season. Gently fold in the asparagus and the eggs. Pour into a 23cm pie dish."}, {"step": "Roll out the pastry and cut a 23cm circle. Dampen the edges of the pie dish and place strips of the leftover pastry around the edge. Brush with water then top with the pastry circle and crimp the edges with your fingers to seal. Trim the crusts with a sharp knife, then pinch them together pressing the first finger of your right hand between the thumb and first finger of your left."}, {"step": "Make a slit in the top and brush with a little milk. Roll out any trimmings and use to decorate. Bake for 25-30 minutes. Serve hot or cold."}], "nutrition": {"Energy": "1,464kj/351kcals", "Fat": "21.1g", "Saturated Fat": "11.7g", "Carbohydrate": "28.4g", "Sugars": "3.9g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/Asparagus_pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}