{"title": "Asparagus tart", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 35 minutesM", "serves": "4-6"}, "ingredients": [{"item": "A little flour for dusting"}, {"item": "500g Jus-Rol Shortcrust Pastry Block"}, {"item": "Knob of butter"}, {"item": "4 rashers smoked streaky bacon, sliced into 1cm pieces"}, {"item": "1 onion, peeled and finely sliced"}, {"item": "450g Waitrose Asparagus, trimmed of woody stem"}, {"item": "5 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "200ml double cream"}, {"item": "Watercress salad to serve"}], "instructions": [{"step": "Preheat your oven to 190°C, gas mark 5. Lightly dust a clean surface with flour then roll out the pastry to the thickness of a £1 coin and large enough to line a 23cm loose-bottomed, fluted tart case. Lay the pastry into the tart case with the excess pastry overlapping the sides, line with crumpled baking parchment, fill with baking beans and bake for 30 minutes."}, {"step": "Remove the baking beans and cook the pastry for a further 5 minutes to ensure the base is cooked. Remove from the oven, trim the edges and leave to cool."}, {"step": "Melt the butter in a medium frying pan over a medium-high heat. When bubbling, add the bacon and onion. Fry the ingredients, stirring regularly for 10 minutes, by which time the onions will have softened and caramelised. Tip the mix onto a plate and reserve."}, {"step": "Reduce the oven temperature to 180°C, gas mark 4. Bring a pan of water to the boil. When bubbling vigorously, drop in the asparagus and cook for 2½ minutes before draining and"}, {"step": "cooling quickly under cold water."}, {"step": "Cut each spear to fit into the tart case from the middle pointing out. Slice up the trimmings and reserve."}, {"step": "Scatter the cooked onion and bacon mixture in the base of the tart, arrange the spears in the case following the pattern of a clock, and scatter the sliced trimmings evenly into the base too."}, {"step": "Beat together the eggs and double cream, and slowly pour the mix into the tart, trying not to disturb the asparagus."}, {"step": "Slide the filled case into the oven and bake for 30-35 minutes, or until it’s just set with the merest hint of wobble on the tart surface."}, {"step": "Remove the tart from the oven and leave to cool a little before slicing into wedges and serving with watercress."}], "nutrition": {"Energy": "2,754kJ 662kcals", "Fat": "47g", "Saturated Fat": "26.6g", "Carbohydrate": "41.2g", "Sugars": "4.5g", "Protein": "18.5g", "Salt": "3.3g", "Fibre": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/Asparagus-tart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}