{"title": "Asparagus and artichoke risotto", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT20M", "cook_time": "PT30M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "1.2 litres fresh vegetable or chicken stock"}, {"item": "630g asparagus, trimmed and chopped into 3cm pieces"}, {"item": "30g unsalted butter"}, {"item": "280g jar sliced artichoke hearts in oil, drained, plus 1 tbsp oil from the jar"}, {"item": "2 shallots, finely diced"}, {"item": "320g carnaroli risotto rice"}, {"item": "100ml white wine"}, {"item": "50g pecorino cheese, finely grated, plus extra shavings to serve"}], "instructions": [{"step": "Simmer the stock in a pan. Add the asparagus, simmer for 3 minutes until tender, then remove with a slotted spoon. Transfer ½ the asparagus to a blender with 100ml of the stock and whizz until smooth. Set aside the purée and remaining cooked asparagus and keep the remaining stock simmering."}, {"step": "In a separate saucepan, melt 15g butter and add 1 tbsp oil from the artichoke jar. Add the shallot and fry over a low heat for 5 minutes, until soft but not coloured. Raise the heat slightly, add the rice and cook, stirring, for 3-4 minutes. Add the wine and simmer for 2 minutes."}, {"step": "Add a large ladleful of simmering stock and stir gently until the liquid has almost disappeared. Repeat this process over the next 15 minutes, adding the drained artichokes and last ladleful of stock when the rice is just cooked. Do not allow this last ladleful to fully evaporate."}, {"step": "Stir in the asparagus purée, remove from the heat and add the remaining 15g butter and the pecorino. Cover and set aside for 5 minutes. Stir well, season, and stir through the reserved asparagus. Serve in shallow bowls with extra pecorino scattered over."}], "nutrition": {"Energy": "2,254kJ 536kcals", "Fat": "20.8g", "Saturated Fat": "8.4g", "Carbohydrate": "72.1g", "Sugars": "5.5g", "Protein": "15.2g", "Salt": "0.9g", "Fibre": "5.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/AsparagusRisotto_AsparagusRisotto_043LR.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}