{"title": "Aubergine fritters with lemon and coriander yoghurt", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8 as a starter"}, "ingredients": [{"item": "3 medium aubergines"}, {"item": "500ml vegetable oil, for frying"}, {"item": "½ tsp hot chilli powder (or to taste)"}, {"item": "Large pinch saffron"}, {"item": "2 medium eggs, beaten with a fork"}, {"item": "100g plain flour"}, {"item": "50g cornflour"}, {"item": "150ml sparkling water"}, {"item": "For the yoghurt dressing"}, {"item": "300ml Greek yogurt"}, {"item": "Juice of 1½ lemons"}, {"item": "2 salad onions, finely sliced"}, {"item": "Small handful coriander leaves roughly chopped"}], "instructions": [{"step": "Cut the aubergines into thin slices and spread out over a large clean surface. Sprinkle over a little salt and leave for 15 minutes, by which time dew drops will have formed on the surface of the aubergine — dab them dry with kitchen paper. Flip the slices over and repeat on the other side."}, {"step": "While the aubergines are ‘sweating’, make the dressing by combining the yogurt with the lemon juice and a little salt. Top with salad onions and coriander and chill until needed."}, {"step": "Pour enough vegetable oil into a large frying pan to a depth of roughly 1cm. Heat the oil over a medium-high heat."}, {"step": "Mix the chilli and saffron with the beaten egg and slowly whisk in the two flours. Finally, whisk in the sparkling water."}, {"step": "Dip the aubergine slices into the batter and fry for 1-2 minutes in the oil, turning over when the first side is golden. Don't overcrowd the pan, and lay the cooked slices on kitchen paper to remove any excess oil. You can either serve the fritters immediately, or make them in advance and reheat for 5 minutes in a hot oven. Serve with the yogurt dressing."}], "nutrition": {"Energy": "1079.472kJ 258kcals", "Fat": "17.2g", "Saturated Fat": "4.3g", "Carbohydrate": "20.2g", "Sugars": "4.7g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/aubergine Fritters.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}