{"title": "Autumn chelsea buns", "tags": null, "planning": {"prep_time": "PT40 minutes, plus risingM", "cook_time": "PT30M", "total_time": "PT1 hour and 10 minutes, plus rising timeM", "serves": "12"}, "ingredients": [{"item": "450g strong bread flour, plus extra for dusting"}, {"item": "7g sachet quick yeast"}, {"item": "50g light brown soft sugar"}, {"item": "1 tbsp mixed spice"}, {"item": "200ml whole milk"}, {"item": "50g unsalted butter, melted"}, {"item": "1 egg yolk"}, {"item": "3 tbsp syrup from a jar of stem ginger"}, {"item": "60g unsalted butter (30g melted, 30g softened), plus extra for greasing"}, {"item": "2 small eating apples (worcester, royal gala or spartan, or use jazz or estivale later in the year), peeled, cored and diced"}, {"item": "3 balls stem ginger, finely chopped"}, {"item": "150g pitted dates, diced"}, {"item": "1 tsp mixed spice"}, {"item": "50g light brown soft sugar"}, {"item": "1 egg white"}, {"item": "2 tbsp golden icing sugar, for icing"}], "instructions": [{"step": "Mix the flour, yeast, sugar and mixed spice in a big bowl. Warm the milk gently in a pan or in the microwave, then whisk with the butter, egg yolk and ginger syrup. Stir into the dry ingredients to make a soft dough. Knead for 10 minutes, until smooth and elastic; return to the bowl, cover with lightly oiled cling film and leave in a warm place until doubled in size, about 1 hour."}, {"step": "Grease a 23cm x 33cm high-sided baking tray with butter. For the filling, stir together the melted butter, apples, stem ginger, dates, mixed spice and brown sugar."}, {"step": "When the dough has risen, tip onto a lightly floured surface and roll to a 40cm x 30cm rectangle. Spread the softened butter over the dough, then sprinkle over the filling evenly. Starting with one of the longer sides, roll the dough up tightly like a swiss roll. Lightly flour a knife, then cut the roll into 12 rounds; arrange in the baking tin, cut-side up. Cover with lightly oiled cling film and leave to rise again for 30 minutes."}, {"step": "Preheat the oven to 180˚C, gas mark 4. When ready to bake, whisk the egg white and brush over the tops of the buns. Bake for 20-25 minutes, until golden and risen."}, {"step": "Leave to cool, then make the icing. Mix the golden icing sugar with a little water (and a splash of ginger syrup, if liked), then drizzle over the buns before serving."}], "nutrition": {"Energy": "1,313kJ 312kcals", "Fat": "9.3g", "Saturated Fat": "5.6g", "Carbohydrate": "51.1g", "Sugars": "22.9g", "Protein": "5.9g", "Salt": "0.1g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/WKApples_Chelseav2_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}