{"title": "Avocado and roasted pepper sushi rolls", "tags": [{"tag": "Vegan"}], "planning": {"prep_time": "PT1 hourM", "cook_time": "PT20M", "total_time": "PT80M", "serves": "4"}, "ingredients": [{"item": "250g sushi rice"}, {"item": "3 sweet peppers (orange, red or yellow)"}, {"item": "1 tbsp vegetable oil"}, {"item": "60ml Japanese rice vinegar"}, {"item": "25g caster sugar"}, {"item": "½ tsp fine salt"}, {"item": "4 sheets nori seaweed"}, {"item": "2 small, ripe avocados, flesh sliced into strips"}, {"item": "light soy sauce or tamari, pickled ginger and wasabi paste, to serve (optional)"}], "instructions": [{"step": "Preheat the oven to 220˚C, gas mark 7. Put the rice in a bowl and cover with cold water; set aside to soak for 15 minutes. Meanwhile, slice each pepper into four ‘cheeks’; discard the stalks and cores. Arrange on a baking tray, skin-side up; drizzle with the oil. Roast for 25 minutes, until soft and blackened in places. Tip into a bowl and cover with a plate; set aside until cool enough to handle. Remove the skins and slice into strips."}, {"step": "Meanwhile, tip the soaked rice into a sieve, rinse under cold water until it runs clear, then drain thoroughly. Transfer to a large saucepan with 300ml water. Bring to the boil, then reduce the heat to low, cover and simmer gently for about 12 minutes, until the rice is just tender and no visible water remains. Set aside, covered, for 10 minutes. Meanwhile, combine the rice vinegar, sugar and salt in a small pan over a low heat, swirling until the liquid is clear, then remove from the heat. Pour the vinegar mixture over the rice and stir in. Quickly spread the rice out on a large plate to cool."}, {"step": "To roll the sushi, place a nori sheet shiny-side down on a sushi rolling mat with any score marks running vertically (or use a square of baking parchment slightly larger than the nori). With wet hands, spread ¼ of the rice over the nori, leaving a 3cm border along the furthest edge. Arrange ¼ of the pepper and ¼ of the avocado in the centre. Roll up firmly from the nearest edge, using the rolling mat (or baking parchment) to create a tight cylinder. Repeat with the remaining ingredients to make 4 long rolls."}, {"step": "Wet a sharp knife, then use to trim the ends of each roll neatly. Slice each roll into 6 pieces to make 24 in total, wiping and wetting the knife as needed. Serve the sushi with light soy sauce or tamari, pickled ginger and wasabi if liked."}], "nutrition": {"Energy": "1,892kJ 451kcals", "Fat": "18g", "Saturated Fat": "3.3g", "Carbohydrate": "61g", "Sugars": "13g", "Protein": "7.9g", "Salt": "0.9g", "Fibre": "6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/201029_003A_AvoTamarindRelish_AvoSushiRolls.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}