{"title": "Baked vanilla & raspberry swirl cheesecake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT1M", "total_time": "PT1 hour 20 minutesM", "serves": "6 - 8"}, "ingredients": [{"item": "125g unsalted butter, plus extra for greasing"}, {"item": "150g raspberries"}, {"item": "3 tbsp icing sugar"}, {"item": "1 Edler’s Continental Medium Flan Case"}, {"item": "50ml limoncello"}, {"item": "85g caster sugar"}, {"item": "1 tsp Ndali vanilla powder"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "Zest and juice of 1 lemon"}, {"item": "2 x 280g full-fat soft cheese"}, {"item": "4 tbsp double cream"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3. Grease the sides of an 20cm cake tin with soft butter."}, {"step": "Place the raspberries in a bowl, sprinkle with the icing sugar, squish with a fork and leave to macerate for 5 minutes before sieving over a bowl to remove the pips."}, {"step": "Use the base of the tin to trim the size of the sponge flan case to a snug fit with the bottom of the tin. Then push the sponge into the tin base and drizzle with limoncello. Cream the butter and sugar together with an electric whisk until pale. Add the vanilla powder, followed by the egg yolks and the lemon juice and zest. Add the soft cheese and double cream, and mix briefly to incorporate. Don’t overbeat."}, {"step": "Whisk the egg whites in a separate clean bowl, until just stiff. Gently fold into the mixture with a metal spoon until incorporated. Pour into the prepared tin, then top with the raspberry purée and marble slightly with a skewer."}, {"step": "Place in the oven for 1 hour, until golden around the edges but still with a slight wobble in the middle."}, {"step": "When cooked, switch off the oven and leave the cheesecake in the oven with the door ajar to cool (prevents cracking). Once cool, remove, and refrigerate before serving with seasonal berries."}], "nutrition": {"Energy": "2,022kJ 487kcals", "Fat": "38.3g", "Saturated Fat": "23.2g", "Carbohydrate": "28.4g", "Sugars": "25.3g", "Protein": "7.2g", "Salt": "0.9g", "Fibre": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Baked-Vanilla-&-Raspberry-Cheesecake_155422.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}