{"title": "Baked Chocolate Cheesecake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes, plus chilling overnight or for a minimum of 6 hoursM", "cook_time": "PT60M", "total_time": "PT1 hour 15 minutes, plus chilling overnightM", "serves": "8"}, "ingredients": [{"item": "200g pack Waitrose Stem Ginger Cookies"}, {"item": "50g butter, melted"}, {"item": "150g bar Green & Black's Organic Cooking 72% Chocolate"}, {"item": "750g mascarpone"}, {"item": "125g light brown muscovado sugar"}, {"item": "2 tbsp cornflour"}, {"item": "3 large eggs, beaten"}, {"item": "Cocoa powder, to dust"}, {"item": "Waitrose Mini Eggs, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line the base of a 23cm non-stick, spring-form cake tin. Place the cookies in a strong plastic bag and crush them with a rolling pin. Tip the crumbs into a large bowl and stir in the melted butter until evenly mixed.  Place the crumb mixture in the prepared cake tin and press down firmly with the back of a spoon and chill for 5-10 minutes.  Meanwhile, gently melt the chocolate in a small heatproof bowl over a pan of barely simmering water. Stir until smooth, then set aside until cooled but still liquid.  Place the mascarpone, sugar and cornflour in a large bowl and beat with an electric whisk until smooth. Whisk in the cooled chocolate and eggs, then spoon into the tin. Level the surface, place on a baking sheet and cook for 55-60 minutes - the cheesecake will still feel wobbly, but it will set further as it cools.  Turn off the oven, open the door and leave the cheesecake until completely cool. Chill until ready to serve. Dust with cocoa powder and decorate with mini eggs. Slice and serve with single cream."}], "nutrition": {"Energy": "3564.768kJ 852.0kcal", "Fat": "67.7g", "Saturated Fat": "42.2g", "Sugars": "32.9g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/0603ss29-r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}