{"title": "Baked Strawberry Cheescake Recipe | Waitrose", "tags": null, "planning": {"prep_time": "PT45 minutes, plus cooling and chilling M", "cook_time": "PT1 hour 35 minutesM", "total_time": null, "serves": "10"}, "ingredients": [{"item": "60g unsalted butter, melted, plus"}, {"item": "extra for greasing"}, {"item": "200g oat biscuits (we used Hobnobs)"}, {"item": "20g toasted flaked almonds"}, {"item": "1 egg white, lightly beaten (from one of the separated eggs from the filling)"}, {"item": "840g full-fat soft cheese, at room temperature"}, {"item": "200g caster sugar"}, {"item": "1 tsp vanilla bean paste (or the seeds from 1 vanilla pod)"}, {"item": "2 tbsp plain flour"}, {"item": "50ml double cream"}, {"item": "150ml soured cream"}, {"item": "6 eggs, 2 separated"}, {"item": "2 tbsp lemon juice"}, {"item": "600g strawberries, hulled"}, {"item": "3 tbsp caster sugar"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4. Grease a deep 23cm springform cake tin; line the base with baking parchment, then the side so that it sits 3cm above the rim. For the base, put the biscuits and nuts in a plastic food bag and bash to crumbs with a rolling pin. Pour into a bowl and mix in the melted butter. Tip into the tin and even out with the back of a spoon. Bake for 5 minutes, then brush with a little egg white and bake for 2 minutes. Cool while you make the filling."}, {"step": "Lower the oven to 140 ̊C, gas mark 1; put a roasting tin half-filled with water on the bottom shelf. Put the soft cheese, sugar, vanilla and flour in a large bowl and slowly beat to a thick, smooth mixture using electric beaters. Mix in the double and soured creams until incorporated. Slowly beat in the 4 whole eggs, one at a time, ensuring each is fully incorporated before adding the next. Finally, beat in the 2 egg yolks, lemon juice and a pinch of salt."}, {"step": "Pour the mixture over the cool base. Bake on the middle shelf of the oven for 1 hour20 minutes, until set but still with a gentle wobble in the middle. Turn the oven off, but leave the cheesecake inside for at least 45 minutes. Remove from the oven and cool to room temperature, then chill for at least 4 hours, or overnight. If the top has cracked, use a palette knife dipped in hot water to gently push the cracks together and smooth."}, {"step": "For the topping, put the strawberries, sugar and 3 tbsp water in a pan over a medium heat; simmer for 5–8 minutes, until the sugar has melted and the strawberries have softened slightly but still hold their shape. Pick the berries out of the pan and set aside, then turn up the heat and bubble the sauce down for a minute to a thick syrup. Arrange the strawberries over the top of the cheesecake then glaze with the syrup."}], "nutrition": {"Energy": "2,533kj 608kcals", "Fat": "40.3g", "Saturated Fat": "22.8g", "Carbohydrate": "48.9g", "Sugars": "37.7g", "Protein": "12.4g", "Salt": "1g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Strawberry cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}