{"title": "Baked buckwheat galettes", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45 minutesM", "serves": "6"}, "ingredients": [{"item": "100g buckwheat flour"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "280ml Alpro Oat Unsweetened"}, {"item": "25g butter, melted, plus extra for frying"}, {"item": "260g spinach, wilted and any excess moisture squeezed out"}, {"item": "1 tbsp Dijon mustard"}, {"item": "4 tbsp crème fraîche"}, {"item": "150g Comte cheese, grated"}, {"item": "6 slices (about 240g) French torchon ham (or any other thick-sliced ham)"}], "instructions": [{"step": "Beat the flour, a pinch of salt and the eggs together in a large bowl. Gradually whisk in the oat drink, then finally beat in the melted butter."}, {"step": "Preheat the oven to 180°C, gas mark 4. Melt a little butter in a large 25cm frying pan. Once the butter is bubbling, ladle some batter (about 80ml) into the hot pan and tip it to make sure the batter reaches the edges. Cook for about 45 seconds to 1 minute per side. Transfer the cooked galette to a plate and repeat with the remaining batter, to make 6."}, {"step": "Lightly grease 2 large baking trays. In a bowl combine the spinach, mustard, crème fraîche and half the cheese, then season. Place 1 slice of ham onto the centre of each pancake, spread each with one-sixth of the spinach mixture. Fold in the edges of the pancake so you cover most of the filling and form a square."}, {"step": "Put onto the prepared trays, sprinkle over the remaining cheese and bake for 10-15 minutes until golden and the cheese is bubbling. Delicious served with a crisp green salad."}], "nutrition": {"Energy": "1,372kJ 329kcals", "Fat": "20g", "Saturated Fat": "11g", "Carbohydrate": "15g", "Sugars": "1g", "Protein": "22g", "Salt": "1.3g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Bakedbuckwheatgalettes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}