{"title": "Baked Rhubarb and Ginger Cheesecake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT55M", "total_time": "PT75M", "serves": "8"}, "ingredients": [{"item": "500g rhubarb"}, {"item": "1 piece Waitrose Chinese Stem Ginger in syrup, finely chopped, plus 2 tbsp syrup from the jar"}, {"item": "175g caster sugar"}, {"item": "175g pack Waitrose Stem Ginger Shortbread Biscuits"}, {"item": "50g butter, melted"}, {"item": "2 x 250g tubs mascarpone cheese"}, {"item": "2 tbsp cornflour"}, {"item": "3 large eggs"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line the base of a 23cm round springform cake tin with baking parchment. Roughly chop the rhubarb into 2cm pieces and place in a saucepan with the stem ginger, syrup, 100g of the caster sugar and 4 tablespoons cold water. Poach for 10 minutes until the rhubarb is tender.  Tip the cooked rhubarb into a sieve over a bowl and strain, reserving the syrupy juices.  Crush the biscuits in a large plastic food bag with a rolling pin, or blend in a food processor, until they are coarsely chopped. Tip into a bowl and stir in the melted butter.  Place the crumb mixture in the cake tin, pressing down firmly with the back of a spoon. Place in the fridge to chill while you finish the topping.  Using an electric whisk, beat together the mascarpone, cornflour, eggs and remaining sugar for 1-2 minutes until smooth. Spoon the strained rhubarb into the mascarpone mixture, using a metal spoon to swirl gently and taking care not to over-mix. Pour into the cake tin and bake for 45 minutes, or until golden and firm. Leave to cool completely before removing from the tin.  Cut into wedges and serve drizzled with the reserved rhubarb syrup. Dust with icing sugar and decorate with mint leaves, if desired."}], "nutrition": {"Energy": "2485.296kJ 594.0kcal", "Fat": "41.5g", "Saturated Fat": "27.2g", "Salt": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/0503ss04-r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}