{"title": "Baklava rolls with honey syrup", "tags": null, "planning": {"prep_time": "PT30 minutes, plus soakingM", "cook_time": "PT55M", "total_time": "PT1 hour 25 minutes plus soaking  M", "serves": "24"}, "ingredients": [{"item": "125g blanched whole almonds"}, {"item": "150g shelled, unsalted pistachios"}, {"item": "100g soft dried figs, tough stalks cut off and discarded, roughly chopped"}, {"item": "1 tsp ground cinnamon"}, {"item": "2 tbsp clear honey"}, {"item": "1 egg, lightly beaten"}, {"item": "½ orange, zest"}, {"item": "1-2 tsp rosewater (optional)"}, {"item": "100g unsalted butter, softened"}, {"item": "270g pack Jus-Rol filo pastry (6 sheets)"}, {"item": "100g clear honey"}, {"item": "100g caster sugar"}, {"item": "1 cinnamon stick"}, {"item": "2 strips pared orange zest"}, {"item": "1 tsp rosewater"}, {"item": "1 tbsp lemon juice"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Make the filling first. Tip the almonds onto a baking tray and gently toast in the oven for 5-10 minutes, until lightly golden. Leave to cool slightly."}, {"step": "Put the almonds in a food processor with 100g pistachios and the figs, cinnamon, honey, egg, orange zest, rosewater (if using) and 25g butter. Pulse until the nuts are evenly chopped and everything is well mixed. Spoon the mixture into a bowl and set aside."}, {"step": "Melt the remaining 75g butter. Unwrap the filo and stack all the sheets together with one of the long sides closest to you. Using a long knife, halve the filo sheets vertically to make 12 squares."}, {"step": "Lay one square on the work surface and brush with melted butter. Put another square on top. (Keep the remaining filo covered with a slightly damp tea towel to prevent it drying out). Cut into even, neat quarters. Brush with melted butter. Spoon a level tablespoon of the filling across the bottom of each small square, leaving a 1 cm border at both sides. Fold the sides of each small square over the filling, brush with a little more butter and roll up into a cigar shape neatly encasing the filling; repeat with the remaining pastry and filling. Arrange the pastries, seam-side down, in a 20cm x 30cm parchment-lined baking tin."}, {"step": "Brush the tops of the packed pastries with melted butter and bake on the middle shelf of the oven for 40-45 minutes, until crisp and golden brown."}, {"step": "Meanwhile, prepare the honey syrup. Put the honey, caster sugar, cinnamon stick, orange zest, and 100ml water in a pan. Bring to the boil over a low heat to dissolve the sugar, then simmer very gently for about 10 minutes, until thickened and reduced by about a third. Take off the heat, strain into a bowl, add the rosewater and lemon juice and cool."}, {"step": "Remove the baklava from the oven and slowly pour over ½ the honey syrup. Cool for at least 2 hours in the tin to allow the syrup to soak into the pastries. Finely chop the remaining 50g pistachios and scatter over the top of the pastries, along with a few dried rose petals, if liked. Serve with extra syrup on the side."}], "nutrition": {"Energy": "768kJ 184kcals", "Fat": "10.6g fat", "Saturated Fat": "3.1g", "Carbohydrate": "18.4g", "Sugars": "12.4g", "Protein": "3.7g", "Salt": "0.1g", "Fibre": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Baklava_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}