{"title": "Balsamic pot-roast beef brisket with horseradish mash", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT3 hours 50 minutesM", "total_time": "PT4 hours 20 minutesM", "serves": "6-8"}, "ingredients": [{"item": "100ml essential Waitrose balsamic vinegar"}, {"item": "1.5kg piece Waitrose Aberdeen Angus rolled beef brisket (limited availability)"}, {"item": "2 tbsp essential Waitrose olive oil"}, {"item": "400g shallots, peeled"}, {"item": "2 essential Waitrose celery stalks, roughly chopped"}, {"item": "500g essential Waitrose carrots, roughly chopped"}, {"item": "500g essential Waitrose parsnips, roughly chopped"}, {"item": "2 garlic cloves, crushed"}, {"item": "3 thyme sprigs"}, {"item": "1 litre beef stock"}, {"item": "1.5kg maris piper potatoes, peeled and chopped into 4cm chunks"}, {"item": "30g unsalted butter"}, {"item": "75ml whole milk"}, {"item": "3½ tbsp essential Waitrose hot horseradish sauce"}, {"item": "½ x 25g pack flat leaf parsley, chopped"}], "instructions": [{"step": "Preheat the oven to 140°C, gas mark 1. Pour the balsamic vinegar into a shallow bowl and roll the beef in it; season well. Heat half the oil in a deep ovenproof casserole over a medium-high heat and add the beef. Cook for 1-2 minutes on each side until browned all over; take care as the balsamic can burn easily. Remove from the pan, return to the vinegar bowl and set aside."}, {"step": "Heat the remaining oil in the pan over a medium heat and add the shallots, celery, carrots and parsnips. Sauté over a medium-high heat for 5 minutes until beginning to brown. Return the beef to the pan with the vinegar, garlic, thyme and stock. Season, then bring to the boil and cover with a tightly fitting lid. Transfer to the oven and cook for about 3 hours 30 minutes, or until meltingly tender, turning the beef and stirring the vegetables regularly."}, {"step": "Meanwhile, make the horseradish mash. Boil the potatoes in salted water for 10-12 minutes until tender, then drain. Return to the pan and allow to dry for 2 minutes, then mash with the butter, milk and horseradish. Season and add the parsley."}, {"step": "Remove the beef from the pan and wrap in foil to rest. Place the pan over a high heat and bring the gravy to the boil. Simmer briskly for 20-25 minutes until reduced by half; season. Slice or shred the beef and serve with the vegetables, gravy and horseradish mash."}], "nutrition": {"Energy": "2,216kJ 527kcals", "Fat": "19.7g", "Saturated Fat": "7.2g", "Carbohydrate": "52.4g", "Sugars": "15.6g", "Protein": "35.1g", "Salt": "0.6g", "Fibre": "8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/waitrose-16th-15862.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}