{"title": "Banana and toffee sticky cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "9"}, "ingredients": [{"item": "3 medium free-range eggs"}, {"item": "160g light muscovado sugar"}, {"item": "250g peeled and finely grated butternut squash"}, {"item": "1 tbsp vanilla extract"}, {"item": "50g white rice flour"}, {"item": "100g ground almonds"}, {"item": "2 tsp baking powder"}, {"item": "¼ tsp salt"}, {"item": "80g Brazil nuts, roughly chopped (or use pecans or macadamias)"}, {"item": "150g banana, peeled and finely sliced"}, {"item": "50g unsalted butter"}, {"item": "100g golden syrup"}, {"item": "3 tbsp boiling water"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line the base of a 22cm square x 5cm deep tin with baking parchment. Grease the parchment and sides of the tin with a little butter."}, {"step": "In a large mixing bowl, whisk the eggs and sugar until pale and cappuccino-coloured (roughly 5 minutes on full blast). Beat in the grated butternut squash and vanilla extract with the whisk until well combined."}, {"step": "Whisk in the flour, ground almonds, baking powder and salt until smooth. Finally, with the help of a spatula, mix in the Brazil nuts and banana (reserve a small handful of banana slices for the top)."}, {"step": "Tip the mixture into the prepared tin. Dot the reserved banana slices over the top of the cake (flat, so they look like circles) before placing the cake in the oven for 35 minutes."}, {"step": "Once cooked, remove the cake from the oven and let it stand to cool in its tin while you make the toffee syrup."}, {"step": "In a medium-sized saucepan, melt the butter and golden syrup with the water on a low heat until the butter has become liquid. Turn up the heat and, once boiling point has been reached (when the surface is covered in smallish bubbles), continue to boil hard for 3 minutes exactly."}, {"step": "Once the 3 minutes are up, take the pan off the heat immediately and beat the bubbles out of mixture, which should take no longer than 30 seconds."}, {"step": "Drizzle the hot liquid over the cake quickly and tilt the cake in its tin left, right, back and forth whilst the toffee is still hot and runny."}, {"step": "Once the toffee has drenched the top of the cake, let it stand to sink in for 10 minutes before serving. This is delicious with vanilla or toffee ice cream."}], "nutrition": {"Energy": "1518.792kJ 363kcals", "Fat": "19.4g", "Saturated Fat": "5.7g", "Carbohydrate": "39.8g", "Sugars": "33.1g", "Protein": "7.2g", "Salt": "0.6g", "Fibre": "2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Delicious-Cakes_Banana_Toffee-Stick-Cake_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}