{"title": "Banana muesli morning loaf", "tags": null, "planning": {"prep_time": "PT15 minutes, plus coolingM", "cook_time": "PT1 hourM", "total_time": "PT1 hour 15 minutes, plus coolingM", "serves": "10"}, "ingredients": [{"item": "175g Benecol Olive Oil spread, melted, plus extra for greasing, brushing and to serve (optional)"}, {"item": "3 ripe large (or 4 small) bananas"}, {"item": "100ml clear honey, plus extra to drizzle and serve"}, {"item": "½ tsp vanilla bean paste"}, {"item": "3 medium British Blacktail Free Range Eggs"}, {"item": "150g essential Waitrose Fruit Muesli, plus extra for scattering"}, {"item": "100g walnut pieces"}, {"item": "175g self-raising flour"}, {"item": "Pinch salt"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and line a 900g loaf tin. In a large bowl, mash 2 or 3 of the bananas (to make about 225g). Pour in the melted spread, honey, vanilla bean paste and eggs; beat well with a wooden spoon. Stir in the muesli and 85g of the walnuts, then let the mix sit and thicken for 5 minutes."}, {"step": "Sift in the flour and salt; fold in with a spatula or large spoon, then tip the batter into the prepared tin. Slice the remaining banana in half lengthways, then put the pieces lengthways on top of the cake. Brush with some more melted spread. Scatter a little muesli and the remaining 15g walnuts over the exposed batter. Bake for 1 hour, until risen and golden and a skewer comes out clean."}, {"step": "Cool for 30 minutes in the tin, then remove and cool on a rack. Before the cake is completely cold, drizzle it with more honey. Serve sliced, as it is, or toasted, with more spread, if liked, and honey."}], "nutrition": {"Energy": "1,524kJ 371kcals", "Fat": "19g", "Saturated Fat": "3.2g", "Carbohydrate": "41.1g", "Sugars": "21.2g", "Protein": "7.3g", "Salt": "0.48g", "Fibre": "3.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Banana-muesli-loaf.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}