{"title": "Barbecued sea bass with confit shallots and tahini", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT40M", "cook_time": "PT1 hour 40 minutesM", "total_time": "PT2 hours 20 minutesM", "serves": "6"}, "ingredients": [{"item": "6 sea bass (400–600g each), scaled and gutted"}, {"item": "6 lemons, 3 sliced into ½cm rounds, 3 halved for the barbecue"}, {"item": "½ x 20g pack lemon thyme"}, {"item": "olive oil, for drizzling"}, {"item": "2 bay leaves"}, {"item": "2-3 lemon thyme sprigs"}, {"item": "12 echalion shallots"}, {"item": "400-500ml extra virgin olive oil"}, {"item": "100g tahini"}, {"item": "30ml lemon juice"}, {"item": "1 garlic clove, crushed"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. For the confit shallots, put the herbs and shallots in a loaf tin or deep baking dish and pour over enough oil to cover. Tightly cover with foil and roast for 1 hour–1 hour 30 minutes, until the shallots are soft (but not dried out); set aside."}, {"step": "Put the tahini into a bowl and add the lemon juice and garlic. Gradually whisk in 75–100ml iced water. It will thicken to a coarse paste, but then loosen to a sauce about the consistency of clear honey. Season with salt and set aside."}, {"step": "Score the sea bass a few times on both sides with a sharp knife. Season all over and inside, then stuff the slits with the lemon slices and the cavity with the lemon thyme; drizzle all over with oil."}, {"step": "Set up a barbecue to ensure that you will be cooking over burning hot embers. Place the sea bass in a fish barbecue basket (or cook directly on the grate, but make sure the fish is well-oiled on the outside) and grill for 3–5 minutes on each side, until just cooked through. The flesh should be just opaque, slightly firm and flake when pressure is gently applied. Cook the lemon halves briefly at the same time. Serve the fish, lemon halves, shallots and tahini with the jewelled saffron rice."}], "nutrition": {"Energy": "1,949kJ 466kcals", "Fat": "24g", "Saturated Fat": "4g", "Carbohydrate": "5.1g", "Sugars": "4.6g", "Protein": "53g", "Salt": "0.5g", "Fibre": "4.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Barbecued-sea-bass.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}