{"title": "Bea Vo’s flourless chocolate cake with tahini mascarpone and sesame brittle", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT35M", "total_time": "PT1 hour 5 minutes, plus coolingM", "serves": "10-12"}, "ingredients": [{"item": "250g unsalted butter, plus extra for greasing"}, {"item": "250g dark chocolate, chopped"}, {"item": "30g cocoa powder"}, {"item": "5 whole eggs"}, {"item": "2 egg yolks"}, {"item": "100g caster sugar"}, {"item": "30g cornflour"}, {"item": "115g caster sugar"}, {"item": "1 tbsp honey"}, {"item": "15g sesame seeds, toasted"}, {"item": "250g mascarpone, chilled"}, {"item": "90g soft cheese, chilled"}, {"item": "½ tbsp honey"}, {"item": "35g tahini, chilled"}, {"item": "85ml double cream, chilled"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and line the base of a 23cm springform cake tin with parchment. Put the chocolate in a heatproof bowl. Heat the butter in a small pan until bubbling, then pour it over the chocolate and stir until melted. Stir in the cocoa."}, {"step": "Using electric beaters, beat the whole eggs, egg yolks and sugar on high speed until thick and fluffy. Mix ¼ of the egg mixture into the chocolate to lighten it, then gently fold the chocolate mixture into the eggs. Sift in the cornflour and fold in to combine. Pour into the prepared cake tin."}, {"step": "Bake for 20-25 minutes. The cake might be a little wobbly inside, but should have a brownie-like crust on top. Cool to room temperature (don’t worry if it looks collapsed)."}, {"step": "For the brittle, line a baking tray with baking parchment. Put a frying pan over a low heat and add the sugar, swirling gently until it is melted and the caramel is an amber colour. Stir in the honey, then add the toasted sesame seeds and pour onto the parchment. Swirl to make the caramel as thin as possible, then leave to cool. When set, break into shards and set aside."}, {"step": "When ready to serve, make the tahini mascarpone. Using electric beaters or a wooden spoon, beat all the ingredients apart from the double cream until soft. Switch to a whisk attachment or balloon whisk; add the cream, whipping to a soft consistency. Remove the cake from the tin, top with the mascarpone and finish with the brittle shards before serving."}], "nutrition": {"Energy": "Per serving (12) 2424kJ 584kcals", "Fat": "46g", "Saturated Fat": "27.2g", "Carbohydrate": "33g", "Sugars": "26.6g", "Protein": "8.3g", "Salt": "0.4g", "Fibre": "2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Bea-Vo's-flourless-chocolate-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}