{"title": "Beef pithivier with pickled red cabbage", "tags": null, "planning": {"prep_time": "PT30 minutes, plus cooling, chilling and standingM", "cook_time": "PT5 hoursM", "total_time": "PT5 hours 30 minutes, plus cooling, chilling and standingM", "serves": "6"}, "ingredients": [{"item": "50g unsalted butter"}, {"item": "2 onions, finely chopped"}, {"item": "1kg beef short ribs"}, {"item": "1 tbsp olive oil"}, {"item": "250ml port"}, {"item": "250ml dark beer"}, {"item": "400ml fresh chicken stock"}, {"item": "250ml red wine vinegar, plus 2 tbsp"}, {"item": "500g puff pastry"}, {"item": "1 egg"}, {"item": "1 tbsp milk"}, {"item": "½ red cabbage, tough core discarded, shredded"}, {"item": "100g demerara sugar"}], "instructions": [{"step": "Ideally, cook the meat the day before serving as the pithivier needs to be assembled from cold. Put the butter in a large pan over a low heat and sweat the onions with a large pinch of salt for 15 minutes, until soft and translucent but not coloured. Preheat the oven to 160˚C, gas mark 3."}, {"step": "Meanwhile, season the ribs with salt. Heat the oil in a flameproof casserole dish over a medium heat and fry the ribs, in batches, for 10-15 minutes. You want the meat to colour and become brown all over. Turn the heat down a little if the ribs start to smoke and burn. Once all the meat has browned, transfer to a plate, then add the cooked onions to the casserole dish along with the port and beer. Bring to the boil and simmer for 5 minutes, then add the browned meat and chicken stock. Bring back to a simmer, season, then cover and cook in the oven for around 3 hours. Check it every hour. It needs to cook until the meat comes away easily from the bone."}, {"step": "Strain the stew through a colander set over a large pan, reserving the liquid. Put the liquid on the hob and bring to a simmer. Reduce until you have about 100ml (20-30 minutes). Meanwhile, pick the meat from the bones and tear into small chunks. Discard the bones. Once the stock is slightly thicker and more intense in flavour, season with a good pinch of salt and the 2 tbsp red wine vinegar. Pour back over the meat and onions; they should sit together in a ‘jammy’ way, with the liquid coating the meat. If the mixture is too sloppy, put it back on the hob to thicken slightly. Allow to cool then chill, ideally overnight."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Divide the pastry in 2 and roll each piece into a roughly 25-30cm square about the thickness of a £1 coin. Put one square on a parchment-lined baking tray and spoon the cold meat (you should have about 650g) into the centre, mounding it with your hands so it looks like an upturned bowl. Beat the egg and milk together, then brush a 2cm border onto the pastry, around the meat. Carefully place the other square of pastry on top and press the 2 layers together, making sure there are no air bubbles. Use a sharp knife to trim around the filling in a circle (allowing a 2-3cm border), then crimp the edges and poke a hole in the top with a sharp knife. Score the border with the back of a small, sharp knife, then mark lines in a spiral pattern from the centre outwards. Brush the egg wash all over the pastry, then cook in the oven for 50-55 minutes or until dark golden brown. Allow to rest for a few minutes before serving."}, {"step": "Meanwhile, put the cabbage in a bowl and sprinkle over a pinch of salt; set aside for 30 minutes. Put the remaining 250ml red wine vinegar in a small pan and bring to a simmer. Take off the heat and stir in the sugar until dissolved; stand for 5 minutes. Rinse the salt from the cabbage, squeeze out the liquid, then cover with the warm pickling liquid. Serve the pithivier with the red cabbage."}], "nutrition": {"Energy": "3,153kJ 756kcals", "Fat": "42g", "Saturated Fat": "20g", "Carbohydrate": "52g", "Sugars": "29g", "Protein": "24g", "Salt": "1.4g", "Fibre": "5.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Beef-pithivier.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}