{"title": "Beef Meatball and Guiness Stew", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": null, "total_time": "PT1 hour 20 minutesM", "serves": "6 - 8"}, "ingredients": [{"item": "½ tbsp. unsalted butter"}, {"item": "2 x 300g pack of beef meatballs"}, {"item": "6 garlic gloves, crushed"}, {"item": "2 large onions, diced"}, {"item": "1 tbsp tomato puree"}, {"item": "750ml Guiness"}, {"item": "50g flat leaf parsley, leaves roughly chopped and stalks kept whole"}, {"item": "3 thyme sprigs"}, {"item": "3 bay leaves"}, {"item": "1 tsp sea salt"}, {"item": "4 large carrots (around 400g), cut into large chunks"}, {"item": "500ml beef bone broth or vegetable stock"}], "instructions": [{"step": "Heat the butter in a large casserole dish over a medium high heat. Brown the meatballs, turning frequently (it maybe easier to do this in batches). Browning helps the meatballs to stay in one piece during cooking and adds a depth of flavour. When browned, remove from the pan and set aside."}, {"step": "Spoon out all but 2 tbsp of fat from the pan. Gently fry the garlic and onions for 10–15 minutes, stirring regularly, until softened but not browned. Stir in the tomato puree and cook for a couple of minutes. Pour in the Guiness, then make a bouquet garni by tying together the parsley stalks, thyme sprigs and bay before adding to the pan."}, {"step": "Bring to the boil, giving the pan a good scrape with a wooden spoon to release the caramelised juices from the bottom of the pan – this is where the flavour is. Add the salt and plenty of black pepper and simmer until reduced by ½, about 15 minutes."}, {"step": "Once the Guiness has reduced, add the carrots and meatballs and pour over the broth or stock. Return to the boil, then simmer fro 30 minutes or until the sauce is reduced, syrupy and coats the meatballs nicely. Top with the roughly chopped parsley leaves and serve, with cauliflower mash and cavolo nero."}], "nutrition": {"Energy": "1,077 258", "Fat": "16.2g", "Saturated Fat": "7.5g", "Carbohydrate": "11.4g", "Sugars": "7.8g", "Protein": "16.7g", "Salt": "1.2g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/plated-dinner-2-meatballs_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}