{"title": "Beef & chorizo empanadas", "tags": null, "planning": {"prep_time": "PT25 + 30 minutes chilling timeM", "cook_time": "PT50 minutes + cooling timeM", "total_time": "PT1 hour 45 minutes + cooling timeM", "serves": "About 24"}, "ingredients": [{"item": "1 tsp olive oil"}, {"item": "2 x 60g pack Cooks’ Ingredients Iberico De Bellota Diced Chorizo"}, {"item": "1 red pepper, deseeded and finely chopped"}, {"item": "1 small onion, finely chopped"}, {"item": "1 tsp hot chilli powder"}, {"item": "400g pack beef mince"}, {"item": "1 tbsp tomato purée"}, {"item": "200ml red wine"}, {"item": "Plain flour for dusting"}, {"item": "1½ x 500g packs Jus-Rol Shortcrust Pastry Block"}, {"item": "Sunflower oil for deep frying"}], "instructions": [{"step": "Heat the olive oil in a large frying pan over a medium heat and fry the chorizo for 3-4 minutes, stirring occasionally. Add the pepper, onion and chilli powder, and continue frying for 3 minutes until soft. Increase the heat, add the minced beef and fry for 2 minutes until browned. Stir in the tomato purée, fry for a minute, then pour over the wine. Reduce to a simmer and cook uncovered for 20 minutes. Set aside to cool completely."}, {"step": "Dust your work surface with flour and roll out the pastry as thinly as possible. Using a 10cm cutter, stamp out 24 rounds of pastry. Then add a spoonful of the cooled filling to the centre of each pastry round. Be careful not to overfill the rounds because they will split during cooking. Wet the edge of each round and fold over the filling to make a neat parcel. Pinch the edges together to seal, then transfer to a tray lined with greaseproof paper. Cover and chill in the fridge for half an hour."}, {"step": "Preheat the oven to 140°C, gas mark 1. Heat the sunflower oil to 160°C in a deep fryer and fry the empanadas in batches for 4-5 minutes until golden brown, turning occasionally during cooking. Drain each batch of empanadas on kitchen paper and keep warm in the oven while you fry the remainder."}], "nutrition": {"Energy": "907kJ 218kcals", "Fat": "14.5g", "Saturated Fat": "4.2g", "Carbohydrate": "14.9g", "Sugars": "1.1g", "Protein": "6.9g", "Salt": "0.5g", "Fibre": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Waitrose-Weekend_264_Philip's-Wine_Beef-&-chorizo-Empanadas.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}