{"title": "Beetroot chocolate cupcake nests", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes + coolingM", "cook_time": "PT20M", "total_time": "PT50 minutes + coolingM", "serves": "12"}, "ingredients": [{"item": "200g self-raising flour"}, {"item": "50g cocoa powder"}, {"item": "1 tsp baking powder"}, {"item": "175g dark brown muscovado sugar"}, {"item": "250g pack cooked natural beetroot (from the chiller cabinet)"}, {"item": "3 tbsp semi-skimmed milk"}, {"item": "175g unsalted butter, melted"}, {"item": "3 large Waitrose British Blacktail Free Range Eggs, beaten"}, {"item": "100ml double cream"}, {"item": "100g Waitrose Continental Dark Chocolate, finely chopped"}, {"item": "½ tsp vanilla extract"}, {"item": "150g unsalted butter, softened"}, {"item": "200g icing sugar, sifted"}, {"item": "4 tbsp shredded or desiccated coconut, toasted"}, {"item": "36 red grapes"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5 and line a 12-hole muffin tin with paper cases. Sift the flour, cocoa and baking powder into a large bowl with a pinch of salt, then add the sugar and run your fingers through the mix to find and squash any lumps. Make a well in the middle."}, {"step": "Put the beetroot into a blender or food processor with the milk. Blend until smooth and thick. Pour the beetroot, melted butter and beaten eggs into the dry ingredients then beat together with a spatula to make an even, fairly thin batter."}, {"step": "Divide the batter between the cases then bake for 20 minutes or until risen and shiny, and a skewer inserted into the central cake comes out clean. Cool for 5 minutes then transfer to a wire rack to cool completely."}, {"step": "For the frosting, bring the cream to a simmer. Put the chocolate into a small heatproof bowl then pour the hot cream over the chocolate and allow to melt. Stir until smooth, add the vanilla, then cool completely. In a large bowl, beat together the butter and icing sugar until pale, then beat in the chocolate cream."}, {"step": "Spoon or pipe frosting nests onto each cake, scatter with coconut then fill the middles with grapes. Any leftovers can be kept in the fridge for up to 2 days – take out of the fridge 30 minutes before serving so the cakes can return to room temperature."}], "nutrition": {"Energy": "2,362kJ 566kcals", "Fat": "36.9g", "Saturated Fat": "24.1g", "Carbohydrate": "52.8g", "Sugars": "38.6g", "Protein": "5.8g", "Salt": "0.5g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Beetroot chocolate cupcake nests.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}