{"title": "Beetroot and chocolate velvet bundt with yogurt icing", "tags": null, "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT1 hour 5 minutesM", "total_time": "PT1 hour 30 minutes, plus coolingM", "serves": "16-18"}, "ingredients": [{"item": "500g bunch fresh beetroot, trimmed and quartered"}, {"item": "225g unsalted butter, plus extra for greasing"}, {"item": "250g Billington’s Light Brown Soft Sugar, plus 2 tbsp for dusting"}, {"item": "100g dark chocolate (70% cocoa solids), chopped"}, {"item": "275g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "60g cocoa powder"}, {"item": "¼ tsp fine salt"}, {"item": "4 British Blacktail Free Range Eggs, beaten"}, {"item": "250g FAGE Total 5% Natural Greek Recipe Strained Yogurt"}, {"item": "125g dark chocolate (70% cocoa solids), chopped"}, {"item": "50g FAGE Total 5% Natural Greek Recipe Strained Yogurt"}, {"item": "2 tbsp icing sugar"}, {"item": "3-4 tbsp milk"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Put the beetroot in a microwave-safe dish. Add 3 tbsp water, cover and cook for 10 minutes on full power until tender, stirring halfway. Or you can wrap the beets in foil, add the water and bake for 45 minutes, until tender. Drain in a sieve over a bowl; set aside until warm. Meanwhile, generously grease a 25cm bundt tin. Dust inside with 2 tbsp sugar; tap out the excess."}, {"step": "Whizz 300g of the beetroot in a blender (or a food processor) with 5-6 tbsp water until thick and smooth. (Use any remaining beetroot for salads or soups.) In a pan, melt the butter, then remove from the heat and add the chocolate; leave to melt, then stir until smooth."}, {"step": "Sift the flour, baking powder and cocoa powder into a large bowl, then add the salt and sugar. Make a well in the middle and add the beetroot purée, the melted chocolate mixture, eggs and yogurt. Beat briefly with a wooden spoon until smooth. Pour into the bundt tin, level out, then bake for 30 minutes. Turn down the oven to 160˚C, gas mark 3, and bake for 15 minutes more until the cake has risen and a skewer inserted in the middle comes out clean."}, {"step": "Leave to cool in the tin for 30 minutes, then turn out onto a wire rack to cool completely. For the topping, melt 100g chocolate in a microwave or in a bowl over a pan of simmering water. Stir until smooth, leave to cool a little, then mix in the yogurt and icing sugar. Add the milk until it reaches a spoonable consistency. Lift the cake onto a serving plate, spoon over the icing, then scatter with the remaining chopped dark chocolate."}], "nutrition": {"Energy": "Per serving (18) 1384kJ 338kcals", "Fat": "16.8g", "Saturated Fat": "10.1g", "Carbohydrate": "38.9g", "Sugars": "26.6g", "Protein": "6.7g", "Salt": "0.38g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Beetroot-bundt.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}