{"title": "Beetroot brownies", "tags": null, "planning": {"prep_time": "PT25 minutes plus coolingM", "cook_time": "PT1 hour 45 minutesM", "total_time": null, "serves": "12"}, "ingredients": [{"item": "75g unsalted butter, at room temperature, plus extra for greasing"}, {"item": "350g raw beetroot, trimmed and cut into large wedges"}, {"item": "300g dark chocolate (70% cocoa solids), chopped into small chunks"}, {"item": "2 eggs"}, {"item": "200g granulated sugar"}, {"item": "2 tsp vanilla bean paste (or extract)"}, {"item": "1 tsp salt"}, {"item": "4 tbsp plain flour"}, {"item": "4 tbsp cocoa powder"}, {"item": "75g icing sugar, sifted"}], "instructions": [{"step": "Heat the oven to 180 ̊C, gas mark 4. Grease and line a 20cm x 30cm baking tin with baking parchment. Boil the beetroot in a pan of water until very soft and tender – about 1 hour. Drain well and, once cool enough to handle, rub off the skin. Whizz in a food processor, scraping down the sides as needed, until you have a coarse purée. Reserve 1 tbsp purée for the icing."}, {"step": "Melt 200g chocolate with the butter in a large heatproof bowl set over a pan of barely simmering water; remove from the heat and set aside. Whisk the eggs, granulated sugar, vanilla and salt in another bowl, then beat into the chocolate mixture and stir in the beetroot purée. Sift in the flour and cocoa, add the remaining 100g chocolate chunks and fold everything in until just combined."}, {"step": "Pour into the tin and bake for 35-40 minutes, until a crust has formed; cool completely in the tin. Before serving, beat the reserved beetroot purée with the icing sugar (loosen with a few drops of water, if needed) to drizzle over the top."}], "nutrition": {"Energy": "1,427kJ 341kcals", "Fat": "17.7g", "Saturated Fat": "10.4g", "Carbohydrate": "40.1g", "Sugars": "32.6g", "Protein": "5.3g", "Salt": "0.6g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/beetroot Brownie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}