{"title": "Bengali fish with chilli greens", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT10M", "total_time": "PT25M", "serves": "4"}, "ingredients": [{"item": "1 tbsp mild curry powder"}, {"item": "3 tbsp fat free Greek yogurt"}, {"item": "1 tsp grated ginger"}, {"item": "1 tbsp wholegrain mustard"}, {"item": "4 x 150g skin-on firm white fish fillets (such as pollack, cod or haddock)"}, {"item": "2 red chillies, sliced"}, {"item": "200g pack baby leaf greens, roughly chopped"}, {"item": "200g pack Waitrose Thick Cut Cavolo Nero or kale"}, {"item": "2 tsp groundnut oil"}, {"item": "2 cloves garlic, sliced"}, {"item": "Lemon wedges, mango chutney and fresh coriander, to serve"}], "instructions": [{"step": "Preheat the grill to high and line a baking tray with non-stick foil. In a small bowl mix together the curry powder, yogurt, ginger and mustard. Place the fish fillets in the prepared tray and cover with the yogurt mixture. Sprinkle a few chilli slices over. Place the fish under the grill for 8-10 minutes, or until the edges are crisp and the fish is thoroughly cooked."}, {"step": "Bring a large pan of water to the boil over a high heat. Add the greens and cavolo nero, bring back to the boil and cook for 1 minute. Drain, rinse in cold water and squeeze out any excess water."}, {"step": "Warm the oil in a frying pan over a medium heat. Add the garlic and remaining chilli, and sauté for 1-2 minutes. Add the greens and stir-fry until hot. Season, then serve with the fish, a wedge of lemon, mango chutney and some coriander sprinkled over. Delicious with warm flatbreads or poppadoms."}], "nutrition": {"Energy": "1,027kJ 243kcals", "Fat": "5.7g", "Saturated Fat": "0.9g", "Carbohydrate": "17.1g", "Sugars": "14.7g", "Protein": "30.9g", "Salt": "1.1g", "Fibre": "4.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Bengali-Fish-Chilli-Greans_166391.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}