{"title": "Berry breakfast muffins", "tags": null, "planning": {"prep_time": "PT15-20M", "cook_time": "PT20M", "total_time": "PT35-40M", "serves": "12 muffins"}, "ingredients": [{"item": "175ml of essential Waitrose Long Life Unsweetened Soya Milk, plus 3 tbsp"}, {"item": "tsp juice of an essential Waitrose Lemon"}, {"item": "100g essential Waitrose Raspberries, washed"}, {"item": "150g essential Waitrose Blueberries, washed"}, {"item": "3 tablespoons of the essential Waitrose Canned Chickpea liquid"}, {"item": "140ml essential Waitrose Olive Oil + extra for greasing the muffin tins"}, {"item": "300g essential Waitrose Self Raising Flour"}, {"item": "1 teaspoon Waitrose Cooks' Baking Powder"}, {"item": "100g Waitrose Golden Caster Sugar"}, {"item": "100g Cooks' Ingredients 70% Dark Chocolate (grated), or 100g essential Waitrose Porridge Oats"}, {"item": "To decorate (optional)"}, {"item": "2 tsp juice of an essential Waitrose lemon"}, {"item": "2 tbsp of icing sugar"}, {"item": "Tiny bit of the juice of 2 squashed raspberries for colour"}], "instructions": [{"step": "Preheat the oven to 200C. Take a 12-cup muffin tin and grease with oil or line with muffin cases. Set aside."}, {"step": "In a little bowl mix together 175ml milk and the lemon juice. Set aside for at least 5 minutes. In a larger bowl mix together the rest of the wet ingredients: the oil, 3 tablespoons of milk and the berries. Combine and set aside."}, {"step": "Next, in another larger bowl mix together the dry ingredients: the flour, baking powder, sugar and chocolate or oats. Then add the wet ingredients, including the milk/lemon mixture and mix until just combined. Evenly distribute into the prepared muffin tin."}, {"step": "Bake for about 20 minutes until the tops are golden. Allow the muffins to cool on a wire rack."}, {"step": "While they are cooling, prepare the glaze (if using) by combining the lemon juice and icing sugar. To add colour, use the juice of 2 mashed raspberries. Drizzle over the muffins and enjoy!"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Berry-breakfast-muffins-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}