{"title": "Blackberry-glazed brown butter madeleines", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT35 minutes, plus resting and chillingM", "cook_time": "PT35M", "total_time": "PT1 hour 10 minutes, plus resting and chillingM", "serves": "about 20"}, "ingredients": [{"item": "170g unsalted butter"}, {"item": "150g plain flour, plus a little extra for dusting"}, {"item": "3 eggs"}, {"item": "125g caster sugar"}, {"item": "1 tbsp clear honey"}, {"item": "1 tsp vanilla extract"}, {"item": "½ lemon, zest"}, {"item": "1 tsp baking powder"}, {"item": "150g blackberries"}, {"item": "2 tsp caster sugar"}, {"item": "½ lemon, juice"}, {"item": "125-150g icing sugar"}], "instructions": [{"step": "Melt 20g butter and use to grease 2 madeleine tins, getting into every groove and corner. Dust with a little flour and tap to knock out any excess, then chill the tins while you prepare the batter. Melt the remaining 150g butter in a pan over a medium-low heat, then cook for 4-6 minutes, until it starts to smell nutty and the milk solids turn golden. Pour into a bowl and cool."}, {"step": "Meanwhile, in the bowl of a freestanding mixer (or using electric beaters) whisk the eggs, sugar, honey and a pinch of salt for 3-4 minutes, until thick, pale and doubled in volume. Mix in the vanilla and lemon zest. Sift over the flour and baking powder, then fold into the mixture using a large metal spoon. Fold in the brown butter until combined. Cover and chill for at least 4 hours, or up to 24 hours."}, {"step": "For the glaze, soften the blackberries, caster sugar and lemon juice in a small pan over a medium-low heat. Once they’re juicy (but not burst into a purée), scoop into a sieve set over a bowl. Allow the juice to drip through (without pressing the fruit), then leave to cool. Add the icing sugar to the juice (save the fruit for breakfast or to serve with ice cream) and whisk to a smooth glaze. Add a drop more lemon juice to sharpen and a little more icing sugar to thicken, if needed, to make a drizzly glaze."}, {"step": "Preheat the oven to 190°C, gas mark 5. Scoop a rounded dessertspoon of chilled batter into each madeleine indent and bake for 10-14 minutes, in batches if needed, until well risen and golden. Turn the madeleines onto a wire rack, cool for 10 minutes, then brush with a little of the glaze. These are best eaten on the day of making."}], "nutrition": {"Energy": "Per madeleine 678kJ 162kcals", "Fat": "7.9g", "Saturated Fat": "4.7g", "Carbohydrate": "20g", "Sugars": "14g", "Protein": "2g", "Salt": "0.1g", "Fibre": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Blackberry-glazed-madeleines.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}