{"title": "Black Forest & coconut cream trifle", "tags": [{"tag": "Vegetarian"}, {"tag": "Vegan"}], "planning": {"prep_time": "PT30M", "cook_time": "PT20M", "total_time": "PT50M", "serves": "10 - 12"}, "ingredients": [{"item": "For the chocolate cherry brownie"}, {"item": "200g plain flour"}, {"item": "1 tbsp baking powder"}, {"item": "60g cacao powder"}, {"item": "180g coconut sugar or brown sugar"}, {"item": "200g coconut oil"}, {"item": "425g can cherries in syrup"}, {"item": "2 tbsp kirsch (optional)"}, {"item": "For the cherry compote"}, {"item": "2 x 425g cans cherries in syrup"}, {"item": "Finely grated zest and juice of unwaxed 1 lime"}, {"item": "2 tbsp kirsch (optional)"}, {"item": "150ml maple syrup"}, {"item": "4 tsp cornflour"}, {"item": "For the chocolate cream"}, {"item": "200g dark chocolate (ideally 60%+ cocoa solids)"}, {"item": "200g Koko Dairy Free Soft Cream Cheese"}, {"item": "For the coconut cream"}, {"item": "2 x 400g cans coconut milk, kept in the fridge overnight"}, {"item": "1 tsp vanilla extract"}, {"item": "2 tbsp maple syrup"}, {"item": "40g vegan-friendly dark chocolate, to serve"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and line a brownie tin (about 32.5x26.5x6.5cm) with baking parchment. To make the brownie, sieve the flour, baking powder, cacao powder and sugar into a bowl and mix well. Melt the coconut oil in a saucepan, then add the cherries in syrup, being careful as it may spit. Then add the kirsch."}, {"step": "Make a well in the centre of the dry ingredients, and pour in the coconut oil and cherries, mix well until smooth. Pour into the prepared tin and bake for 20 minutes until just firm. Remove, leave to cool, then cut into squares."}, {"step": "Meanwhile, make the cherry jam. Place 1 of the cans of cherries into a small pan and purée it with a stick blender. Remove 6-8 cherries from the remaining can and pour the rest into the pan with the lime zest and juice, and kirsch, if using, with the maple syrup. Bring to the boil, then reduce to a simmer for 10 minutes, stirring occasionally until reduced. Blend the cornflour with 1 tbsp cold water and stir into the pan, bring back to the boil, stirring until thickened. Remove from the heat and allow to cool."}, {"step": "For the chocolate cream, melt the chocolate in a heatproof bowl over a pan of just simmering water, until melted. Remove from the heat and beat in the dairy free soft cream cheese until smooth. Set aside to cool."}, {"step": "For the coconut cream, remove the cans from the fridge, open them without shaking and scoop off the cream (the hard fat) from the top of each can ensuring not to include any of the water (you can use the water in another recipe). Put into a bowl with the vanilla and maple syrup. Mash with a fork until smooth and evenly mixed."}, {"step": "To assemble the trifle, start on the base of your dish or dishes with a full layer of cherry brownies, next a generous layer of cherry jam, then a layer of chocolate cream and top off with a layer of coconut cream. Repeat this again, to give 2 layers of everything. Finish with plenty of grated chocolate and the reserved cherries on top."}], "nutrition": {"Energy": "2,893kJ 693kcals", "Fat": "41g", "Saturated Fat": "34g", "Carbohydrate": "71g", "Sugars": "50g", "Protein": "5.9g", "Salt": "0.7g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Waitrose-Weekend_Wk435_The-Happy-Pear-Christmas-Lunch_Black-Forest-Coconut-Cream-Trifle.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}