{"title": "Blackberry and bramley layer cake", "tags": null, "planning": {"prep_time": "PT1 hour 10 minutes, plus coolingM", "cook_time": "PT30M", "total_time": "PT1 hour 40 minutes, plus coolingM", "serves": "18-20"}, "ingredients": [{"item": "340g unsalted butter, softened, plus extra for greasing"}, {"item": "340g caster sugar"}, {"item": "8 British Blacktail Free Range Eggs, at room temperature"}, {"item": "300g self-raising flour"}, {"item": "1½ tsp baking powder"}, {"item": "150g ground almonds"}, {"item": "1 tsp ground cinnamon"}, {"item": "1 tsp vanilla paste"}, {"item": "¼ tsp fine sea salt"}, {"item": "6 tbsp milk, plus extra if needed"}, {"item": "225g Waitrose & Partners Blackberries"}, {"item": "4 tbsp caster sugar"}, {"item": "4 tsp lemon juice"}, {"item": "200g peeled bramley apples (about 2 small)"}, {"item": "3 British Blacktail Free Range Egg whites"}, {"item": "200g icing sugar, sifted"}, {"item": "225g unsalted butter, softened"}, {"item": "pinch ground cinnamon"}, {"item": "handful Waitrose & Partners Blackberries"}, {"item": "½ lemon, zest strands"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and line the bases of 3 x 20cm round sandwich tins. Put all the sponge ingredients into a large bowl and use electric beaters to mix until smooth. Add more milk if needed to reach a soft dropping consistency. Spoon into the tins, spread evenly then bake for 28-30 minutes, until risen and golden. Cool in the tins for 10 minutes, then turn out, top-sides down, to cool completely on a wire rack (this will help keep the cakes flat)."}, {"step": "Meanwhile, make the filling. Put the blackberries into a medium pan with 2 tbsp sugar and 2 tsp lemon juice. Bring to a simmer; cover and cook over a low-medium heat for about 5 minutes, until the fruit has collapsed into its juices. Mash well, then set aside."}, {"step": "Chop the apple and put in another pan with the remaining 2 tbsp sugar and 2 tsp lemon juice, plus 1 tbsp water. Cover and cook over a medium heat for 5-7 minutes until soft. Mash into a purée, then stir in the blackberry coulis; set aside to cool."}, {"step": "For the frosting, put the egg whites, icing sugar and a pinch of salt in a large bowl over a pan of simmering water, ensuring the water does not touch the base. Use electric beaters to whisk until thick and stiff (5-7 minutes). Spoon into a cold bowl and continue to whisk until the mixture is cool (about 5 minutes). Whisk in the butter, 1 tbsp at a time, until all incorporated and silky. Beat in the cinnamon, then chill for 30 minutes."}, {"step": "Put 1 sponge onto a serving plate or cake stand and spread with ¹/ ³ of the buttercream, then spread over ½ the apple and blackberry mixture; repeat. Top with the final sponge and spread ¾ of the remaining buttercream on top. Use the final ¼ of buttercream to thinly coat the sides, allowing the berry filling to catch in it, creating a ripple effect. Top with the remaining blackberries and the lemon zest strands."}], "nutrition": {"Energy": "Per serving (20) 1966kJ 478kcals", "Fat": "30g", "Saturated Fat": "15.8g", "Carbohydrate": "43.8g", "Sugars": "32.1g", "Protein": "7.5g", "Salt": "0.45g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Blackberry-layer-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}