{"title": "Blackberry soufflé", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "unsalted butter, for greasing"}, {"item": "3 tbsp golden caster sugar, plus extra to dust"}, {"item": "150g blackberries"}, {"item": "few drops vanilla extract"}, {"item": "few drops lemon juice"}, {"item": "½ tbsp cornflour"}, {"item": "2 egg whites"}, {"item": "icing sugar, to dust"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4, and put a baking sheet on the top shelf of the oven. Grease 2 large ramekins (200ml in volume) and dust with sugar."}, {"step": "Put the berries and 1 tbsp sugar in a small pan and simmer for 5-6 minutes until the fruit has broken up (help it by crushing with a wooden spoon). Whizz in a blender, then sieve into a mixing bowl; discard the pips. Cool slightly, then stir in the vanilla extract and lemon juice. Put 1 tbsp purée into each ramekin. Mix the cornflour with ½ tbsp water, then stir into the remaining purée; set aside."}, {"step": "Put the egg whites in a clean bowl and whisk with electric beaters on a slow, then medium, speed. When the whites reach soft peaks, scatter over the remaining 2 tbsp sugar; whisk until dense and silky."}, {"step": "Fold 1 / 3 of the egg white into the purée, then gently fold in the remainder until combined; take care not to overmix. Divide the mixture between the ramekins, filling to the top. Smooth the surface with a knife and clean the edges with your thumb wrapped in a piece of kitchen paper, making a slight indent around the edges. Cook on the baking sheet for 10 minutes, until well risen. Dust with icing sugar and serve at once, with crème fraîche, if liked."}], "nutrition": {"Energy": "1,368Kj 326Kcal", "Fat": "13.9g", "Saturated Fat": "9.6g", "Carbohydrate": "46g", "Sugars": "41.3g", "Protein": "4.2g", "Salt": "0.2g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Souffle-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}