{"title": "Black bean, tortilla and avocado salad with roasted tomato salsa", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT25M", "total_time": "PT35M", "serves": "4"}, "ingredients": [{"item": "4 ripe medium tomatoes"}, {"item": "1 jalapeno chilli"}, {"item": "3 garlic cloves, unpeeled"}, {"item": "½ lime, juice"}, {"item": "3 corn tortillas"}, {"item": "2 tbsp sunflower oil"}, {"item": "1 dried ancho chilli"}, {"item": "1 onion, finely chopped"}, {"item": "½ x 28g pack coriander, stalks finely chopped, leaves roughly chopped"}, {"item": "400g can black beans, drained and rinsed"}, {"item": "about 60g salad leaves"}, {"item": "1 avocado, finely sliced"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. To make the salsa, put the tomatoes, jalapeno chilli and garlic in a frying pan over a high heat. Dry-fry for 10 minutes, turning every so often, until blackened all over. Carefully transfer to a plate then, when cool enough to handle, peel the garlic and destalk the chilli. Put the garlic and chilli in a food processor and whizz until smooth. Add the tomatoes and pulse until finely chopped. Stir in the lime juice and season with salt; set aside."}, {"step": "Use 1 tbsp oil to brush both sides of the tortillas, then cut into triangles with scissors. Arrange in a single layer on a baking sheet (or 2), season with salt and bake for 8-10 minutes. Put the ancho chilli in a bowl, cover with boiling water and soak for 10 minutes."}, {"step": "Meanwhile, heat the remaining 1 tbsp oil in a large pan over a low heat. Add the onion with a pinch of salt and soften gently for about 7 minutes, until translucent. Drain the chilli and, when cool enough to handle, discard the stalk and seeds. Finely chop the flesh then add to the onion with the coriander stalks; cook for about 2 minutes, until fragrant. Add the drained beans and cook over a medium heat for a few minutes until heated through; season. Arrange most of the salad leaves on a platter with the avocado slices and tortilla chips. Scatter over the beans, followed by the tomato salsa. Finally, scatter over the coriander leaves and remaining salad leaves, plus a little feta, if liked."}], "nutrition": {"Energy": "1,374kJ 329kcals", "Fat": "16g", "Saturated Fat": "2.9g", "Carbohydrate": "30g", "Sugars": "10g", "Protein": "9.6g", "Salt": "0.9g", "Fibre": "10g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/black-bean-and-avocado-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}