{"title": "Black bean burgers with celeriac chips", "tags": [{"tag": "Low Fat"}, {"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT40M", "total_time": "PT55M", "serves": "2"}, "ingredients": [{"item": "1 small celeriac (about 500g-600g)"}, {"item": "4 tbsp olive oil"}, {"item": "1 red onion, chopped"}, {"item": "400g can black beans, drained and rinsed"}, {"item": "1 slice rye bread with sunflower seeds"}, {"item": "1 tsp caraway seeds"}, {"item": "¼ x 25g pack fresh parsley, finely chopped"}, {"item": "Pea shoots or watercress and vine ripened tomato salsa, to serve"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Cut away the skin from the celeriac and quarter the flesh. Cut each piece into 1cm thick slices, then across into small chips. Put 2 tablespoons of the oil in a roasting tin and put it in the oven to heat up for a few minutes. Once the oil is hot, carefully tip in the celeriac chips, turning them to coat. Season and bake in the oven for 30-35 minutes until pale golden, turning once or twice with a fish slice."}, {"step": "Meanwhile, heat 1 tablespoon of the remaining oil in a frying pan and gently fry the onion for 5 minutes. Tip the beans into a bowl and mash well with a fork. Crumble in the rye and sunflower seed bread. Add the onion, caraway seeds and parsley. Season and mix together well. Shape into 4 even-sized burgers."}, {"step": "Heat the remaining oil in the frying pan and gently fry the burgers for about 2 minutes on each side until hot and slightly crisped. Transfer to serving plates with the celeriac chips and serve with pea shoots or watercress and the tomato salsa."}], "nutrition": {"Energy": "1,061kJ 254kcals", "Fat": "15.5g", "Saturated Fat": "2.3g", "Carbohydrate": "20g", "Sugars": "4.9g", "Protein": "8.7g", "Salt": "0.5g", "Fibre": "11.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Waitrose-Weekend_WK341_WkEnd-Menu_Weekend-Bake_Friday-Night_Black-Bean-Burgers-Celeriac-Chips.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}