{"title": "Blackberry cake with marshmallow frosting", "tags": null, "planning": {"prep_time": "PT40M", "cook_time": "PT30M", "total_time": "PT1 hour 10 minutesM", "serves": "10-12"}, "ingredients": [{"item": "300g Président Unsalted Butter, softened, plus extra for greasing"}, {"item": "225g essential Waitrose Self-Raising Flour, plus extra for dusting"}, {"item": "5 large eggs"}, {"item": "300g Billington’s Golden Caster Sugar"}, {"item": "75g ground almonds"}, {"item": "½ orange, zest and juice"}, {"item": "150g Président Unsalted Butter, softened"}, {"item": "250g icing sugar, sifted"}, {"item": "½ x 213g jar marshmallow fluff"}, {"item": "425g Waitrose 1 Blackberries"}, {"item": "4 tbsp Tiptree Blackberry Jelly"}, {"item": "Selected stores"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and line the bases of 3 x 18cm sandwich tins, then lightly fl our the sides. Put all the cake ingredients in a large bowl and whisk together using electric beaters, until thoroughly combined and smooth (don’t worry if it looks slightly curdled). Divide the mixture equally between the tins and level the tops with the back of a spoon."}, {"step": "Bake for 25-30 minutes, until golden, risen and it springs back when touched. Remove from the oven, turn the tins over onto a board lined with a clean tea towel and leave for 5 minutes to flatten the tops. Turn the tins back the right way, remove the cakes from their tins and transfer to a wire rack; leave to cool completely."}, {"step": "For the frosting, use electric beaters to beat the butter and 125g icing sugar in a large bowl until combined. Gradually add the remaining 125g icing sugar and marshmallow fluff until light and airy. Transfer ⅔ of the marshmallow buttercream into another bowl and stir through 75g blackberries, squishing them to marble the frosting."}, {"step": "Remove the parchment from the cakes. Put 1 cake on a plate and spread with 2 tbsp blackberry jelly and ½ the marbled frosting. Scatter with 100g of the remaining blackberries. Top with another sponge and repeat the layers of jelly, frosting and blackberries. Finish with the final cake. Spread the unmarbled buttercream on top and scatter with the remaining 150g blackberries."}], "nutrition": {"Energy": "Per serving (12) 2818kJ 674kcals", "Fat": "37.8g", "Saturated Fat": "21.4g", "Carbohydrate": "76.5g", "Sugars": "59.3g", "Protein": "7g", "Salt": "0.3g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Blackberry-cake-with-marshmallow-frosting.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}