{"title": "Blueberry & hazelnut torte", "tags": null, "planning": {"prep_time": "PT30 minutes + cooling  and chillingM", "cook_time": "PT35M", "total_time": "PT1 hour 5 minutes, plus cooling and chillingM", "serves": "8 - 10"}, "ingredients": [{"item": "85g Waitrose Blanched Hazelnuts"}, {"item": "100g golden caster sugar"}, {"item": "175g unsalted butter, softened"}, {"item": "1 large Waitrose British Blacktail Free Range Egg yolk"}, {"item": "½ tsp vanilla extract"}, {"item": "225g plain flour, plus a little extra for dusting"}, {"item": "½ tsp ground cinnamon"}, {"item": "Zest 1 small orange and 1 tsp juice"}, {"item": "5 tbsp essential Waitrose Blackcurrant Jam"}, {"item": "300g fresh blueberries"}, {"item": "1 tsp cornflour"}, {"item": "Icing sugar and crème fraîche, to serve"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Spread the nuts out on a baking sheet and roast for 8–10 minutes until golden brown. Leave to cool completely."}, {"step": "Put the nuts into a food processor with 1 tbsp of the sugar, then pulse until finely ground. Tip out and set aside. Whizz the remaining sugar, butter, egg yolk and vanilla until creamy. Add the nuts, flour, cinnamon and orange zest and pulse to make a ball of dough. Split the dough into one-third and two-thirds, press each into a disc, then wrap in clingfilm and chill for 30 minutes or until just firm."}, {"step": "Roll each pastry disc between 2 sheets of clingfilm. Use the larger one to line a 23cm fluted tart tin, making a lip of about 2.5cm up the sides. Spread the jam across the pastry. Mix the blueberries, orange juice and cornflour then tip them on top in an even layer. Stamp out 5cm rounds from the smaller disc using a fluted cutter, then use a very small cutter to remove the centre from each. Arrange the pastry rings over the fruit, overlapping them slightly, then bake for 35 minutes, until the pastry is golden and the berries saucy."}, {"step": "Cool in the tin for 5 minutes, then remove to a wire rack and leave to cool completely. Dust with icing sugar and serve in slices with crème fraîche."}], "nutrition": {"Energy": "1,962kJ 471kcals", "Fat": "32.5g", "Saturated Fat": "18.3g", "Carbohydrate": "40.1g", "Sugars": "21g", "Protein": "4.6g", "Salt": "0.1g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/BlueberryTart_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}