{"title": "Blueberry pain perdu with vanilla ice cream", "tags": null, "planning": {"prep_time": "PT10 minutes, plus standingM", "cook_time": "PT30M", "total_time": "PT40 minutes, plus standingM", "serves": "4"}, "ingredients": [{"item": "3 eggs"}, {"item": "1 egg yolk"}, {"item": "200ml single cream"}, {"item": "2 tbsp caster sugar"}, {"item": "2 tbsp whisky (optional)"}, {"item": "30g salted butter, plus extra for frying"}, {"item": "16 sprigs lemon thyme, leaves picked"}, {"item": "2 tbsp clear honey"}, {"item": "200g blueberries"}, {"item": "8 x 2cm-thick slices brioche"}, {"item": "4 scoops vanilla ice cream"}], "instructions": [{"step": "In a bowl, whisk together the eggs, yolk, cream, sugar and whisky, if using. Put the butter in a large pan over a medium-high heat. Add the lemon thyme and honey; when everything starts to sizzle, add the blueberries and cook over a high heat for 1 minute, until the berries are coated; transfer to a bowl. Sit 2 slices of the brioche in a snug-fitting, high-sided casserole dish or container and pour over the egg mixture; set aside for 4-5 minutes."}, {"step": "When ready to cook, return the pan to a medium heat and add 1 tsp butter. Use a fish slice to lift the soaked brioche, letting any excess liquid drain off, and transfer to the pan. Immediately put 2 more brioche slices in the egg mixture. Fry the brioche in the pan for 2-3 minutes on each side, until deep golden, watching closely to avoid burning. Transfer to a baking tray and keep warm in a low oven while you cook the remaining brioche slices. Serve 2 slices of brioche per person with the blueberries and a scoop of vanilla ice cream on top."}], "nutrition": {"Energy": "2,902kJ 694kcals", "Fat": "35g", "Saturated Fat": "19g", "Carbohydrate": "76g", "Sugars": "48g", "Protein": "16g", "Salt": "1.1g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Blueberry-pain-perdu.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}