{"title": "Blueberry & lemon drizzle cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes + coolingM", "cook_time": "PT40M", "total_time": "PT50-60 minutes + coolingM", "serves": "8 - 10"}, "ingredients": [{"item": "175g unsalted butter, softened, plus extra for greasing"}, {"item": "175g caster sugar"}, {"item": "Finely grated zest of 2 lemons, and juice of 1"}, {"item": "3 British Blacktail Medium Free Range Eggs"}, {"item": "175g plain flour"}, {"item": "1 tsp baking powder"}, {"item": "150g blueberries"}, {"item": "3 tbsp granulated sugar"}], "instructions": [{"step": "Preheat the oven to 180ºC, gas mark 4. Grease a 20cm round cake tin and line with baking parchment. Beat the butter and caster sugar with an electric whisk for 4-5 minutes until light and fluffy, then beat in the zest of 1 lemon. Beat the eggs together in a jug with a fork, then slowly mix into the batter, adding a spoonful of flour if the mixture starts to curdle."}, {"step": "Fold in the flour and baking powder until just smooth, then spoon a thin layer (about 1cm deep) of the mixture into the tin. Set aside a handful of the blueberries, then fold the rest into the remaining cake mixture and spoon into the tin. Scatter the reserved berries on top."}, {"step": "Bake for 30-40 minutes or until a skewer inserted into the centre of the cake comes out clean. Cover it loosely with foil if it starts to brown too much on top."}, {"step": "As soon as the cake is removed from the oven, pierce the top all over with a skewer. Mix the lemon juice and remaining zest with the granulated sugar and spoon all over the top. Cool completely in the tin before serving."}], "nutrition": {"Energy": "1,324kJ 316kcal", "Fat": "16g", "Saturated Fat": "9.6g", "Carbohydrate": "38g", "Sugars": "25g", "Protein": "4.2g", "Salt": "0.2g", "Fibre": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Blueberry & lemon drizzle cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}