{"title": "Blush orange iced buns", "tags": null, "planning": {"prep_time": "PT30 minutes, plus cooling and rising M", "cook_time": "PT1 hourM", "total_time": "PT1 hour 30 minutes, plus cooling and rising M", "serves": "9"}, "ingredients": [{"item": "20 cardamom pods, seeds removed and lightly crushed"}, {"item": "375ml whole milk"}, {"item": "50g unsalted butter, plus extra for greasing"}, {"item": "500g strong white bread flour, plus extra to knead"}, {"item": "75g golden caster sugar"}, {"item": "7g sachet easy bake yeast"}, {"item": "½ tsp salt"}, {"item": "1 blush orange, zest and juice"}, {"item": "1 large egg, beaten"}, {"item": "100g icing sugar"}], "instructions": [{"step": "Put the crushed cardamom seeds, milk and butter in a small pan and heat together gently, then set aside to infuse and cool slightly. Meanwhile, mix the flour, caster sugar, yeast, salt and orange zest in a large bowl. Make a well in the centre, then strain in 2 / 3 of the milk mixture and add the beaten egg. Bring together to make a soft, slightly sticky dough, adding more of the milk mixture if needed. Knead for a few minutes on a lightly floured surface. Return to the bowl, then cover and set aside for an hour until the dough has doubled in size."}, {"step": "Butter and line the base of a deep 23cm loose-bottomed cake tin. Roll the dough into 9 even-sized balls and place in the tin. Leave to rise for 30 minutes."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Bake for 30-35 minutes, until the buns are well risen and cooked through. Lift out of the tin and leave to cool on a wire rack. For the icing, mix together the icing sugar and 1-2 tbsp orange juice. Spoon over the buns and leave to set. SF"}], "nutrition": {"Energy": "1,536kJ 364kcals", "Fat": "7.8g", "Saturated Fat": "4.4g", "Carbohydrate": "64.4g", "Sugars": "23.2g", "Protein": "9g", "Salt": "0.4g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Waitrose_Harvest_February_3562_RT.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}