{"title": "Bo's Kitchen's cherry pomegranate pavlova", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT2hr 45 minM", "total_time": null, "serves": "6 - 8"}, "ingredients": [{"item": "1 can chickpeas in water"}, {"item": "120g icing sugar"}, {"item": "1 tsp cream of tartar"}, {"item": "1 tsp vanilla powder"}, {"item": "3 tbsp Waitrose morello cherry conserve"}, {"item": "3 tbsp maple syrup"}, {"item": "1/2 cup cranberries"}, {"item": "1/2 cup pomegranate arils"}, {"item": "Fresh cranberries, raspberries, red grapes and cherries"}, {"item": "Waitrose Cooks’ glacé cherries"}, {"item": "2 sprigs of rosemary"}], "instructions": [{"step": "Preheat oven to 120•c and line a baking tray with greaseproof paper. Get a large mixing bowl ready. Make sure it is spotlessly clean, by wiping bowl with a little vinegar to remove any residue."}, {"step": "Prepare cherry drizzle swirl by gently heating cherry conserve and maple syrup in a small pan until runny. Take off the heat and allow to cool. Pour cherry drizzle into a small cup and save the pan for cranberry syrup."}, {"step": "To the same pan, add 1/2 cup cranberries and 1/2 cup pomegranate arils. Simmer gently for 10 minutes, or until the cranberries start to burst. Taste and add a little maple syrup if needed. Use a potato masher to squash everything together, then strain into a small jug."}, {"step": "Add drained water from the can of chickpeas to the clean mixing bowl. Pop chickpeas in the fridge to use for another dish. Beat chickpea water on a slow speed with an electric whisk until bubbly. Increase the speed and whip for about 5 minutes, until soft peaks form."}, {"step": "Add in icing sugar a tablespoon at a time. Once incorporated, add cream of tartar. Keep beating for about another 4/5 minutes, until the meringue is glossy with stiff peaks."}, {"step": "Use a side plate to draw a circle with pencil on your greaseproof paper. Spoon 3/4 of the meringue in heaping tbsp dollops of meringue around the circle to form a wreath. Save your leftover meringue mix in the fridge for the vanilla cream."}, {"step": "Spoon over some of the cherry drizzle and swirl around with a toothpick to incorporate. Save the rest in the pan for making the cranberry pomegranate sauce."}, {"step": "Turn the oven down to 100•c and bake in preheated oven for 2 hours 45 minutes. Switch off the oven and leave overnight to dry out. Try to avoid opening the oven door."}, {"step": "To assemble, re whip your leftover meringue mix with a tsp vanilla powder to make vanilla cream. Top wreath with dollops of cream, berries and grapes followed by cranberry syrup. Decorate with a few rosemary sprigs. Serve immediately."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Bo's Kitchen pavlova .jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}