{"title": "Boston-style beans on toast", "tags": null, "planning": {"prep_time": "PT10 minutes, plus overnight soaking M", "cook_time": "PT5 hoursM", "total_time": "PT5 hours 10 minutes, plus overnight soaking M", "serves": "4"}, "ingredients": [{"item": "225g dried haricot beans"}, {"item": "½ tbsp sea salt"}, {"item": "2 onions, 1 halved, 1 chopped"}, {"item": "1 carrot, halved"}, {"item": "4 garlic cloves"}, {"item": "2 sprigs rosemary"}, {"item": "2 fresh bay leaves"}, {"item": "30g molasses sugar"}, {"item": "1½ tbsp Dijon mustard"}, {"item": "1 tbsp sunflower oil"}, {"item": "1 tbsp cider vinegar"}, {"item": "4 slices wheat and rye sourdough"}, {"item": "handful chives, finely chopped, to serve"}], "instructions": [{"step": "Put the beans in a bowl, cover with cold water and stir in the salt. Soak overnight (at least 12 hours, up to 24). Drain and rinse, then put in a large pan with the halved onion, carrot, garlic, rosemary, bay leaves and a pinch of salt. Generously cover with water and bring to the boil. Cook briskly for 10 minutes, then reduce the heat to a simmer and cook for about 30 minutes (you may need to top up the water), until the beans are tender. Using tongs, remove and discard the vegetables and herbs."}, {"step": "Meanwhile, put the molasses sugar in a measuring jug. Add the mustard and season. Drain the beans through a sieve over a bowl to catch the cooking liquor. Add enough of the liquor to the molasses sugar mixture to bring the volume up to roughly 300ml; stir until dissolved. Set aside the remaining cooking liquor. Preheat the oven to 160˚C, gas mark 3."}, {"step": "Heat the oil in a large, flameproof casserole dish over a medium-high heat. Add the chopped onion and cook for about 6 minutes, stirring, until tender and beginning to turn golden. Add the beans with the molasses mixture; stir to combine. Add enough of the reserved bean cooking liquor to just cover the beans (setting aside the rest); stir and bring to a simmer. Transfer to the oven and cook, uncovered, for about 4 hours. Check the beans every hour, topping up with bean liquor (or boiling water if you run out of liquor) to stop them from drying out. When cooked, the sauce should be thick and glaze the beans; if it’s too liquid, put on the hob and bubble down for a few minutes. Stir through the vinegar and season if needed. Toast the bread and top with the beans and chives, plus a fried egg, if liked."}], "nutrition": {"Energy": "1,458kJ 345kcals", "Fat": "5.8g", "Saturated Fat": "0.7g", "Carbohydrate": "56g", "Sugars": "10g", "Protein": "16g", "Salt": "1.6g", "Fibre": "3.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Boston-style-beans.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}