{"title": "Bourbon salted caramel cheesecake with toffee apples", "tags": null, "planning": {"prep_time": "PT20 minutes + chillingM", "cook_time": "PT50-55 minutesM", "total_time": "PT1 hour 15 minutesM", "serves": "8"}, "ingredients": [{"item": "For the caramel"}, {"item": "50g caster sugar"}, {"item": "75g double cream"}, {"item": "50g light brown muscovado sugar"}, {"item": "25g unsalted butter"}, {"item": "2 tbsp Bourbon"}, {"item": "½ tsp vanilla bean paste"}, {"item": "A pinch sea salt flakes"}, {"item": "For the crust"}, {"item": "150g pecans"}, {"item": "100g ginger nut biscuits"}, {"item": "70g unsalted butter, melted, plus extra for greasing"}, {"item": "A pinch sea salt flakes"}, {"item": "For the filling"}, {"item": "2 x 280g packs cream cheese"}, {"item": "75g caster sugar"}, {"item": "3 British Blacktail Medium Free Range Eggs"}, {"item": "100ml soured cream"}, {"item": "1 tsp finely grated lemon zest"}, {"item": "1 tsp cornflour"}, {"item": "For the toffee apples"}, {"item": "3 small eating apples"}, {"item": "50g unsalted butter"}, {"item": "3 tbsp caster sugar"}, {"item": "Juice of ¼ lemon"}], "instructions": [{"step": "Put the caster sugar for the caramel into a small pan and add 1 tbsp hot water. Warm over a low heat without stirring to dissolve the sugar. Increase the heat and bring to the boil. Cook until an amber-coloured caramel forms. Take the pan off the heat, add the double cream, muscovado sugar, butter, Bourbon, vanilla and salt. Return the pan to a low heat and gently bubble for 30 seconds, stirring until smooth. Pour into a bowl and leave until cold."}, {"step": "To make the crust, preheat the oven to 180°C, gas mark 4. Butter and line the base of a 20cm springform tin with baking parchment. Whizz the pecans in a food processor until finely chopped, then transfer to a bowl. Whizz the ginger biscuits until they become crumbs. Mix into the pecans with the melted butter and salt, and stir to combine. Using your fingers press the pecan crumb mixture onto the base and sides of the prepared tin in an even layer. Place on a baking tray and bake for 5 minutes, then remove. Reduce the oven to 170°C, gas mark 3."}, {"step": "Meanwhile, combine all the filling ingredients in a mixing bowl and whisk until smooth. Mix in 3 tbsp of the cooled caramel. Carefully pour the filling into the pecan crust and return to the oven for a further 35-40 minutes until set with a slight wobble in the middle. Remove from the oven and leave to cool completely before covering and chilling for at least 2-3 hours, or until ready to serve."}, {"step": "For the toffee apples, quarter and core the unpeeled apples, then cut each quarter in half again. Melt the butter with the caster sugar and lemon juice in a frying pan over a medium heat. Mix the apples into the buttery sugar and cook, turning occasionally until tender and golden. Leave to cool to room temperature. Warm the remaining caramel sauce until it becomes runny again. Serve the cheesecake with the apples on top and caramel sauce drizzled over."}], "nutrition": {"Energy": "2,855kJ 686kcals", "Fat": "48g", "Saturated Fat": "22g", "Carbohydrate": "47g", "Sugars": "40g", "Protein": "13g", "Salt": "1.1g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Bourbonsaltedcaramelcheesecakewithtoffeeapples.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}