{"title": "Braised ox cheek & pickled walnut stew", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT2 hours 40 minutesM", "total_time": "PT3 hoursM", "serves": "8"}, "ingredients": [{"item": "1.2kg ox cheeks, trimmed of excess fat and hard sinew"}, {"item": "350g turnips"}, {"item": "500g medium carrots"}, {"item": "400g trimmed leeks"}, {"item": "2 tbsp beef dripping, plus 100g for the dumplings"}, {"item": "2 tbsp plain flour, plus 200g for the dumplings"}, {"item": "500ml bottle stout"}, {"item": "1 pack 10 bay leaves"}, {"item": "25g pack flat leaf parsley, leaves chopped, stalks reserved"}, {"item": "250ml fresh beef stock"}, {"item": "390g jar Opies Pickled Walnuts, drained and roughly chopped"}, {"item": "1½ tsp baking powder"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Cut the meat into 4cm chunks and season with salt. Set aside at room temperature for 15 minutes. Meanwhile, peel all the vegetables, quarter the turnips, and cut the carrots and leeks into 3-4 pieces."}, {"step": "Warm a large casserole dish over a high heat, add 2 tbsp of the dripping or oil and the beef, and fry, in batches if necessary, for 8-10 minutes until well browned all over. Set aside. Lower the heat and add the vegetables and 2 tbsp of flour, stirring well for a couple of minutes. Pour in the porter, bring to the boil and bubble for 2-3 minutes, scraping the base of the pan to lift any caramelised bits. Tie the bay leaves and parsley stalks together with cook’s string and add to the pan with the stock and reserved beef."}, {"step": "Season well, cover the surface of the stew with foil or parchment, and then the lid and bring back to the boil. Braise in the oven for 1 hour 30 minutes. Uncover, add the pickled walnuts and cook for a further 30 minutes until thickened. Season, if needed."}, {"step": "For the dumplings, mix 200g flour with the baking powder and a pinch of salt. Using your fingertips, rub in 100g dripping until incorporated (don’t worry about a few lumps). Add the chopped parsley leaves and 3-4 tbsp cold water, mixing to form a rough dough. Divide into 8 pieces and roll into balls."}, {"step": "Place the dumplings on top of the stew, half of each poking out. Cover and bake for 10 minutes, before removing the lid and cooking for a final 10-15 minutes, until the dumplings are cooked through. Leave to rest briefly before serving with winter greens and mash, if liked."}], "nutrition": {"Energy": "2,821kJ 676kcals", "Fat": "39g", "Saturated Fat": "8.4g", "Carbohydrate": "38g", "Sugars": "13g", "Protein": "38g", "Salt": "2.2g", "Fibre": "5.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Waitrosw-Weekend_PW_SR_SR1408_WK439_WkEnd-Cooking_Braised-Ox-Cheek-Pickled-Walnut-Stew.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}