{"title": "Bread and butter pudding", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT45M", "total_time": "PT1 hour 5 minutesM", "serves": "6"}, "ingredients": [{"item": "40g unsalted butter"}, {"item": "25g currants"}, {"item": "3-4 thick slices white bread (about 250g)"}, {"item": "6 egg yolks"}, {"item": "250g caster sugar"}, {"item": "500ml whole milk"}, {"item": "500ml double cream"}, {"item": "2 vanilla pods"}, {"item": "200g apricot jam"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 3. Grease a shallow ovenproof dish (about 2 litres) with all of the butter, and scatter the currants over the base. Cut the bread into triangles and sit in the dish so that they're overlapping."}, {"step": "For the custard, whisk the egg yolks and sugar in a large mixing bowl. Heat the milk, cream and whole vanilla pods in a pan to just before boiling. Remove and reserve the vanilla pods, then pour the mixture over the eggs, whisking continuously. Split the vanilla pods and scrape the seeds into the custard (discard the pods). Pass the custard through a sieve into a jug."}, {"step": "Slowly pour the warm custard over the bread until everything is covered. Gently push the bread down into the custard, then sit the dish in a large roasting tin and pour boiling water into the tin so it comes about halfway up the side of the dish. Bake for 30-35 minutes, until the custard is just set."}, {"step": "Take the pudding out of the oven and lift it out of the roasting tin. Preheat the grill to high and toast the top of the pudding until golden all over. Warm the apricot jam in a small pan and use to glaze the top of the pudding. Serve dusted with a little icing sugar, if liked."}], "nutrition": {"Energy": "3,754kJ 899kcals", "Fat": "54.4g", "Saturated Fat": "32.1g", "Carbohydrate": "91.6g", "Sugars": "75.3g", "Protein": "10.8g", "Salt": "0.7g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/MPW---bread-pudding.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}