{"title": "Broad bean, prawn and brown rice bowls", "tags": null, "planning": {"prep_time": "PT10 minutes, plus standingM", "cook_time": "PT30M", "total_time": "PT40 minutes, plus standingM", "serves": "4"}, "ingredients": [{"item": "2 tbsp toasted sesame oil"}, {"item": "4 tbsp rice vinegar"}, {"item": "4 tbsp mirin"}, {"item": "1 tbsp finely grated fresh root ginger"}, {"item": "½ cucumber, peeled and finely sliced into rounds"}, {"item": "2½ tsp caster sugar"}, {"item": "300g brown basmati rice"}, {"item": "1 tbsp reduced salt soy sauce"}, {"item": "1 lime, juice"}, {"item": "pinch cayenne pepper"}, {"item": "200g podded young broad beans"}, {"item": "300g cooked king prawns"}, {"item": "1 small avocado, diced"}, {"item": "2 sheets nori seaweed"}, {"item": "50g pea shoots"}], "instructions": [{"step": "Combine the sesame oil and 2 tbsp each rice vinegar and mirin in a bowl with the ginger, sliced cucumber and ½ tsp sugar. Season and stand at room temperature for 1 hour. (Alternatively, cover and chill in an airtight container for up to 3 days). Drain before using."}, {"step": "Put the rice in a saucepan with 650ml water and a pinch of sea salt. Bring to a simmer, then reduce to low, cover and cook – without lifting the lid – for 25-30 minutes. Remove the pan from the heat and leave, with the lid on, for a further 20-25 minutes. Uncover and fluff up the rice with a fork."}, {"step": "For the dressing, combine the remaining 2 tbsp each rice vinegar and mirin with the soy sauce, lime juice and cayenne. Stir in the remaining 2 tsp sugar until dissolved. Blanch the broad beans in boiling water for 1-2 minutes, depending on size, then refresh and drain. If the beans are large, slip them from their skins."}, {"step": "Divide the warm rice between serving bowls and top with the prawns, avocado, drained cucumber, broad beans and dressing, to taste. Cut the nori into fine strips with clean scissors. Loosely tuck in the pea shoots and finish with the nori strips."}], "nutrition": {"Energy": "2,115kJ 502kcals", "Fat": "12g", "Saturated Fat": "2.2g", "Carbohydrate": "70g", "Sugars": "9.5g", "Protein": "22g", "Salt": "1.8g", "Fibre": "6.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Brad-bean,-prawn-and-brown-rice-bowls.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}