{"title": "Burnt honey & pecan ice cream", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT10 minutes + cooling and freezingM", "cook_time": "PT10M", "total_time": "PT20 minutes + cooling and freezingM", "serves": "8"}, "ingredients": [{"item": "100g clear honey, plus 1 tsp extra"}, {"item": "A dash of beaten medium Waitrose British Blacktail Egg white, about 1 tsp"}, {"item": "150g pecans"}, {"item": "600ml double cream"}, {"item": "275g Waitrose Condensed Milk"}, {"item": "1 tsp vanilla extract"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Line a baking sheet with baking parchment. Combine the 1 tsp honey and egg white in a bowl and stir in the pecans until glossy. Tip out onto the baking sheet and spread in a thin layer. Bake for 6-8 minutes until lightly toasted. Leave to cool slightly, then roughly chop the nuts."}, {"step": "Put the remaining honey in a small heavy-based saucepan and heat until bubbling. Let the honey continue to cook over a moderate heat for about 3 minutes until the bubbles are a pale honeycomb colour. Stir in 4 tbsp of the cream until smooth and leave to cool. If the honey is too thick to stir in the cream, then it has been overheated. If this is the case, heat for a minute or so with the cream to make it smooth again."}, {"step": "Weigh 275g condensed milk into a large bowl. Add the remaining cream, vanilla and honey mixture. Beat with a hand-held electric whisk until soft peaks form. Stir in two-thirds of the nuts. Turn into a freezerproof container and freeze for at least 5 hours or overnight, stirring once or twice, until firm."}, {"step": "Transfer to the fridge 30 minutes before serving. Scoop into serving glasses and sprinkle with the remaining nuts."}], "nutrition": {"Energy": "2,211kJ 533kcals", "Fat": "42.2g", "Saturated Fat": "20.4g", "Carbohydrate": "32.6g", "Sugars": "32.4g", "Protein": "5.6g", "Salt": "0.2g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/Waitrose-Weekend_WK351_Mega-Easter-WkEnd-Menu_Good-Friday_Burnt-Honey-&-Pecan-IceCream_.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}