{"title": "Burrowing bunny biscuits", "tags": null, "planning": {"prep_time": "PT40 minutes + chillingM", "cook_time": "PT10M", "total_time": "PT1 hour + chillingM", "serves": "20"}, "ingredients": [{"item": "100g unsalted butter, softened"}, {"item": "100g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "1 large Waitrose British Blacktail Free Range Egg"}, {"item": "200g plain flour"}, {"item": "½ tsp baking powder"}, {"item": "¼ tsp fine salt"}, {"item": "½ x 213g jar marshmallow fluff"}, {"item": "50g desiccated coconut"}, {"item": "Dr. Oetker Pink Neon Glitter Writing Gel (from a pack of 4 colours)"}, {"item": "40 Dr. Oetker Heart Marshmallows (the white ones with pink in the middle, from about 2 packs)"}], "instructions": [{"step": "Cream the butter and sugar together in a large bowl until it starts to turn pale. Add the vanilla extract and break in the egg then stir until combined. Mix in the flour, baking powder and salt until the dough holds together. Wrap in clingfilm and chill in the freezer for 15 minutes."}, {"step": "Preheat the oven to 170°C, gas mark 3. Line 2 large baking trays with parchment. Roll out the dough between 2 pieces of baking parchment to a thickness of 0.5cm. Cut about 20 x 7-8cm rounds using a cutter. Transfer to the lined baking trays and bake for 12-14 minutes until just golden. Remove and leave to cool on a wire rack."}, {"step": "To decorate, spread a teaspoon of marshmallow fluff neatly onto the top of each biscuit then dip into the coconut to coat. Use scissors to then cut the heart marshmallows in half."}, {"step": "Using marshmallow fluff as glue, stick on 2 marshmallow pieces, pink side up, at the bottom of the biscuit as feet then add 2 pieces at the top for ears. Use the writing icing to make 3 little dots on each foot to look like the pads on the paws. Lastly, spoon a little marshmallow fluff into the centre to make a tail."}], "nutrition": {"Energy": "700kJ 167kcals", "Fat": "6.2g", "Saturated Fat": "4.2g", "Carbohydrate": "25.8g", "Sugars": "14.6g", "Protein": "1.9g", "Salt": "0.2g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/12_KidsEasterDM2_024.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}