{"title": "Buttermilk pancakes with raw chia berry jam", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT15M", "total_time": "PT30M", "serves": "4"}, "ingredients": [{"item": "2 tbsp chia seeds"}, {"item": "4 tbsp coconut water (find this in the chiller cabinet next to the fruit juice)"}, {"item": "150g pack essential Waitrose Raspberries"}, {"item": "170g pack essential Waitrose Blueberries"}, {"item": "2 tbsp maple syrup, plus extra to serve"}, {"item": "250g plain flour"}, {"item": "1½ tsb baking powder"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "2 tbsp caster sugar"}, {"item": "2 x 284ml tubs buttermilk"}, {"item": "1 large Waitrose British Blacktail Free Range Egg, lightly beaten"}, {"item": "50ml melted butter, plus 1-2 tbsp extra for frying"}], "instructions": [{"step": "Place the chia seeds and coconut water into a tall container. Set aside to soak for 10 minutes until expanded. Add 100g of the raspberries, 1 tbsp of the blueberries and the maple syrup to the container. Using a stick blender, whizz until well combined. Set the jam aside in the fridge until ready to serve."}, {"step": "Meanwhile, sift the flour, baking powder, bicarbonate of soda, sugar and a pinch of salt into a large bowl. Whisk the buttermilk, egg and melted butter in another bowl until combined. Fold the buttermilk mixture and 75g of the blueberries into the dry ingredients until just combined. The mixture will be thick and lumpy."}, {"step": "Heat 1 tbsp butter in a large frying pan over a medium heat. Add 5 tbsp of the mixture to the pan to make 1 pancake and cook for 2 minutes until bubbles start to appear and the underside is golden. Carefully turn over and cook for a further 1-2 minutes until golden and cooked through."}, {"step": "Remove from the pan, cover and keep warm while you cook the remaining 7 pancakes, cooking up to 3 at a time if you have a large enough pan. Serve the pancakes with the jam, remaining berries and extra maple syrup."}], "nutrition": {"Energy": "2,514Kj 598kcal", "Fat": "20.8g", "Saturated Fat": "11g", "Carbohydrate": "87.4g", "Sugars": "37g", "Protein": "15.2g", "Salt": "2g", "Fibre": "5.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/11_Pankcake_BackCover_200x200.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}