{"title": "Caramelised onion & goat’s cheese tarte tatin", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT25M", "total_time": "PT55M", "serves": "6"}, "ingredients": [{"item": "500g small onions"}, {"item": "50g butter"}, {"item": "2 tbsp balsamic vinegar"}, {"item": "2 tbsp clear honey"}, {"item": "A few sprigs thyme, leaves removed, plus"}, {"item": "extra to garnish"}, {"item": "150g soft goat’s cheese"}, {"item": "1 x 320g puff pastry sheet"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Peel the onions and slice the top and root off each one, then cut them in half."}, {"step": "Place a 22cm tarte tatin tin, or large, ovenproof frying pan, over a medium heat and add the butter. When the butter has completely melted, stir in the balsamic vinegar and honey, and season. Arrange the onions face down in the pan, squeezing in as many as possible to cover the base, then sprinkle over the thyme leaves."}, {"step": "Cook the onions over a low heat without moving them for 8-10 minutes, or until they are soft on top and golden on the bottom. They will shrink a little as they cook, so you may be able to fit in a few more as they reduce in size."}, {"step": "When the onions are cooked and the honey glaze is thick and caramel-like, remove the pan from the heat and allow it to cool for 10 minutes."}, {"step": "Cut a circle from the puff pastry slightly larger than the diameter of your tin. Crumble the goat’s cheese over the top of the onions, then cover with puff pastry, using your fingers to carefully tuck it around the onions at the edges."}, {"step": "Bake the tarte tatin for 20-25 minutes, or until crisp and golden on the top. Remove from the oven and allow to cool for a few minutes before inverting onto a serving plate and garnishing with a few thyme leaves. Serve hot or cold."}], "nutrition": {"Energy": "1,651kJ 397kcals", "Fat": "27.8g", "Saturated Fat": "16.2g", "Carbohydrate": "27.5g", "Sugars": "10.2g", "Protein": "9.1g", "Salt": "1.1g", "Fibre": "2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Caramelised-Onion-Goats-Cheese-Tarte-Tartin_COVER_170987.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}