{"title": "Caramelised banana and rum pancakes", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "½ batch pancake batter (see below)"}, {"item": "40g salted butter"}, {"item": "75g light brown soft sugar"}, {"item": "½ tsp ground cinnamon"}, {"item": "¼ tsp sea salt"}, {"item": "2 bananas, thickly sliced"}, {"item": "2 tbsp dark rum"}, {"item": "2 scoops Madagascan vanilla ice cream, to serve"}, {"item": "100g plain flour"}, {"item": "2 eggs"}, {"item": "300ml milk"}], "instructions": [{"step": "Cook 4 pancakes following the basic recipe (below); keep warm. Combine the butter, sugar, cinnamon and salt in a frying pan, then put over a low-medium heat for about 1 minute, stirring, until the butter has melted into the sugar. When the mixture is bubbling, add the bananas. Cook, shaking the pan often, for 4-5 minutes, until the bananas are caramelised and sticky. Don’t be tempted to stir at this stage."}, {"step": "Add the rum and shake the pan to combine with the caramel. If flambéing, carefully hold a long lit match near the rum caramel to ignite it. Shake vigorously to coat the bananas and extinguish the flame."}, {"step": "Arrange the pancakes on 2 plates and top with the bananas. Put the ice cream in the centre and drizzle over the remaining sauce from the pan."}, {"step": "To make the batter, put the flour, eggs and a little of the milk in a large bowl and whisk together until smooth. Gradually whisk in the remaining milk to make a runny batter. (Alternatively, put all the ingredients in a blender and whizz until smooth.) Cover and set aside until ready to use (ideally chill it overnight) – or cook straight away."}, {"step": "Put a large non-stick frying pan over a medium heat, then test the pan by ladling in a very small amount of batter. It should take around 1 minute to brown on the bottom. If it browns too quickly, lower the temperature slightly; raise the temperature if it cooks too slowly and becomes rubbery. Discard (or eat!) the test pancake."}, {"step": "When the pan is at the right temperature, add a small knob of butter followed by a ladleful of batter. Swirl the pan to coat the base, then leave the pancake to cook for 1 minute. Flip and repeat on the other side, or until cooked through."}], "nutrition": {"Energy": "3,257kJ 779kcals", "Fat": "37g", "Saturated Fat": "23g", "Carbohydrate": "88g", "Sugars": "68g", "Protein": "12g", "Salt": "1.3g", "Fibre": "3.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Caramelised-banana-and-rum-pancakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}