{"title": "Caramelised praline profiteroles recipe | Waitrose", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT50 minutes, plus cooling and chillingM", "cook_time": "PT55M", "total_time": "PT1 hour 45 minutes, plus cooling and chillingM", "serves": "6 (makes about 30 choux buns)"}, "ingredients": [{"item": "70g unsalted butter, chilled and cubed"}, {"item": "175g strong white bread flour"}, {"item": "3 eggs, beaten"}, {"item": "150g golden caster sugar"}, {"item": "100g leftover whole mixed nuts"}, {"item": "3 egg yolks"}, {"item": "1½ tbsp plain flour"}, {"item": "250ml whole milk"}, {"item": "1 vanilla pod, split and seeds scraped out (or 1 tsp vanilla extract)"}, {"item": "125g dark chocolate  (70% cocoa), roughly chopped"}, {"item": "50ml double cream"}, {"item": "75ml whole milk"}, {"item": "25g salted butter"}, {"item": "1 tbsp golden syrup"}, {"item": "pinch flaky sea salt"}], "instructions": [{"step": "Preheat the oven to 220˚C, gas mark 7, and line 2-3 large baking trays with baking parchment. Start by making the pastry. Put the butter in a pan with 250ml water and a pinch of salt. Gently bring to a rolling boil, then vigorously beat the flour into the hot liquid until well mixed. Keep beating  over a low heat for 30 seconds until you have a smooth dough that comes away from the sides of the pan."}, {"step": "Set aside to cool for 5 minutes, then gradually beat in the eggs until incorporated; the dough should be smooth, slightly sticky and reluctantly drop from the spoon. Transfer the dough to a piping bag fitted with a 1cm nozzle (or cut a similar-sized opening in a disposable bag). Fix the parchment to the baking trays by piping small blobs underneath the corners."}, {"step": "Pipe 3cm-wide buns, spacing them evenly, and flatten any pointed tips with a damp finger. Splash the trays with a few drops of water (the steam helps them rise). Bake (in batches, if needed) on the middle shelf for  5 minutes, then reduce the oven to 180˚C, gas mark 4, and cook for 15-20 minutes, until golden, puffed and crisp. Cool on the trays, then pierce a hole in the base of each bun (or halve with a serrated knife)."}, {"step": "For the praline, warm 100g caster sugar in a small pan with 100ml water until dissolved. Simmer briskly for 3-5 minutes, without stirring, until you have light, amber caramel. Carefully stir in the nuts, then pour onto a baking parchment-lined tray; cool."}, {"step": "Pulse the praline in a food processor until roughly ground; reserve a handful  to decorate. Blitz the remaining mixture to  a smooth, spreadable paste – this may take 10-15 minutes, so give the food processor  a rest, if needed; set aside."}, {"step": "For the praline pastry cream, in a large bowl, whisk the egg yolks and flour with the remaining 50g sugar until pale and thick. Gently bring the milk to the boil with the vanilla pod and seeds (or extract). Pour the milk over the yolks, whisking constantly, then return to the pan. Cook over a low-medium heat, whisking constantly for 5-7 minutes, until smooth and thick; take care as it can scramble. Mix in the nut paste, then cover with cling film; cool, then chill until needed."}, {"step": "Gently heat all the ingredients for the chocolate sauce in a small pan, stirring until smooth – about 2-3 minutes. Fill the buns with the praline cream, then stack  on a cake stand or plates. Drizzle over the sauce and scatter with the reserved praline."}], "nutrition": {"Energy": "3,035kJ 727kcals", "Fat": "43.9g", "Saturated Fat": "20.5g", "Carbohydrate": "67g", "Sugars": "39.2g", "Protein": "16g", "Salt": "0.5g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose_Weekend_Dec14_LeftoversDOMADV_8065_Profiteroles_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}