{"title": "Caramel swiss roll with passion fruit cream", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8"}, "ingredients": [{"item": "A little icing sugar"}, {"item": "100g topped, tailed, peeled and finely grated carrot"}, {"item": "1 tsp vanilla extract"}, {"item": "70g white rice flour"}, {"item": "1 tsp baking powder"}, {"item": "100g caster sugar"}, {"item": "¼ tsp salt"}, {"item": "4 medium free-range eggs, yolks and whites separated"}, {"item": "140ml double cream"}, {"item": "2 tbsp icing sugar, sieved"}, {"item": "6 small passion fruit, cut in half and flesh scraped out"}, {"item": "4 tbsp Dulce de Leche"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line the base of a Swiss roll tin with baking parchment, cutting into the corners to get a neat fit. Sift a fine layer of icing sugar over to help prevent the sponge sticking to the bottom."}, {"step": "Weigh out the grated carrot on a plate and pour over the vanilla extract. Weigh out the flour and baking powder on to another plate."}, {"step": "Measure the caster sugar into a small mixing bowl with the salt, then put 2 tbsp of this into a large mixing bowl with the egg whites. Whisk until stiff and set aside."}, {"step": "Add the egg yolks to the sugar in the smaller mixing bowl and whisk for a full 4 minutes until they are pale, fluffy and hold a ribbon trail when you lift the beaters. Add the carrot, flour and baking powder to the egg yolk mixture and whisk to combine."}, {"step": "Using a rubber spatula, beat one-third of the egg whites into the egg yolk mixture."}, {"step": "Cautiously fold in the next third of egg whites: spoon into the middle of the bowl so that it is sitting on the bubbly mixture, then go under the contents with your spatula and dump the liquid from the bottom on to the floating egg white island in the middle. Cut through this with the side of your spatula and repeat the process until it has broken up and blended in an airy pillow with the heavier liquid part. Repeat with the final third of egg white."}, {"step": "Pour the mixture carefully into the Swiss roll tin, aiming to drag the lazy mixture from the bowl into the centre. Tilt the tin this way and that to coax it into the corners (don’t pat it down, as this will knock out the air). Cook in the middle of the oven for 20 minutes."}, {"step": "Once cooked, it’s important to act quickly. Lay a clean tea towel on a work surface and cover it with a slightly smaller rectangle of baking parchment. Take the tray out of the oven and carefully lift the sponge out of its tin, holding it by the edges of the baking parchment."}, {"step": "Lay the sponge, exposed side down, on to the baking parchment in the middle of the tea towel and carefully peel off the paper from the back, which will come off easily. Starting from one end of the cloth, roll up a cigar shape with the tea towel and baking parchment. When you come to the sponge, continue to roll it snugly so that the sponge and the towel are meshed together in a roly-poly shape. Continue until all the sponge is cosily tucked up inside the tea towel. Let it cool for 10 minutes and semi-set while you make the filling."}, {"step": "Sieve the icing sugar into the cream and beat for 1 minute until stiff. Gently fold in the flesh from the passion fruit to create a rippled effect. Keep in the fridge until needed."}, {"step": "Once the sponge has had 10 minutes, unroll it from its paper and tea towel and spread a layer of warm Dulce de Leche all over the inside followed by a layer of cream filling."}, {"step": "Roll the bulging sponge up again (don’t worry about the mess — it’s bound to crack and overspill a little). Sift over 2 tbsp icing sugar and refrigerate until 10 minutes before serving."}], "nutrition": {"Energy": "1230.096kJ 294Kcal", "Fat": "13.1g", "Saturated Fat": "7.1g", "Carbohydrate": "38.7g", "Sugars": "30.4g", "Protein": "5.4g", "Salt": "0.5g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Caramel-Swiss-Roll_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}