{"title": "Caramel apple turnovers", "tags": null, "planning": {"prep_time": "PT50 minutes, plus cooling and chillingM", "cook_time": "PT45M", "total_time": null, "serves": "8"}, "ingredients": [{"item": "150g plain flour, plus extra for dusting"}, {"item": "100g strong white bread flour"}, {"item": "250g unsalted butter, chilled"}, {"item": "1 large egg yolk"}, {"item": "1 tsp cider vinegar"}, {"item": "1 egg, beaten, for glazing"}, {"item": "5 braeburn apples"}, {"item": "1 tbsp light brown muscovado sugar"}, {"item": "25g unsalted butter 1⁄2 tsp mixed spice"}, {"item": "1⁄2 lemon, juice"}, {"item": "75g caster sugar, plus extra for sprinkling"}, {"item": "125g crème fraîche"}, {"item": "25g light brown muscovado sugar"}], "instructions": [{"step": "For the pastry, combine both ours in a bowl with a pinch of salt; dice 50g butter and rub in using your hands. Make a well in the middle and drop in the egg yolk. Mix 75ml ice-cold water with the vinegar and add to the bowl, mixing with a cutlery knife to bring the dough together until smooth; don’t overwork it. Flatten the dough into a neat rectangle, cover with cling film and chill for 1 hour."}, {"step": "Lightly dust a work surface with plain flour and roll the dough out to a 15cm x 45cm rectangle, with one of the shorter sides closest to you. Put the remaining 200g butter between 2 sheets of baking parchment and, using a rolling pin, flatten it into a square that is slightly smaller than 1/3 of the pastry rectangle (about 13cm x 13cm). 3 Place the butter onto the middle section of pastry and fold the bottom 1/3 up over it, brushing off any excess flour. Fold the top 1/3 down so that the butter is completely encased; brush off any excess flour. Turn the square 90o anticlockwise and, holding the rolling pin at each end and, using short, sharp movements, tap out to flatten, then roll out again to a 15cm x 45cm rectangle. Try to keep it as neat as possible, using your hands to tidy the ends and sides between rolls."}, {"step": "In the same way as before, fold the bottom 1/3 of the pastry up over the middle 1/3 and the top 1/3 down, brushing off any excess flour. Lightly press the pastry edges together, turn the square 90o anticlockwise, wrap in baking parchment and chill for 1 hour. Repeat this rolling, folding and chilling twice, then chill for 2 hours more before using."}, {"step": "While the pastry is chilling, prepare the filling. Peel, core and thinly slice the apples and put them into a medium pan. Add the remaining ingredients, then cover and cook over a medium heat until softened – about 8 minutes. Remove the lid and cook until the apple begins to break down and any moisture has evaporated. Set aside to cool."}, {"step": "For the caramel, put the caster sugar in a small pan with 1-2 tbsp water. Warm over a medium heat to dissolve the sugar without boiling. Once the syrup is clear, bring to the boil and cook until it becomes a rich amber colour – about 6 minutes. Take off the heat, then slowly and carefully add the remaining ingredients and a pinch of salt. Return the pan to a low heat to re-melt any hardened caramel; simmer again for 1 minute. Pour into a bowl and cool."}, {"step": "Lightly dust the work surface with plain flour and roll out the pastry into a neat square roughly 0.2cm thick (about 40cm x 40cm). Cut the square in half, then cut each half into 4 equal rectangles (about 10cm x 20cm)."}, {"step": "Spoon the apples into a mound on one side of each pastry rectangle and top with a heaped teaspoon of the caramel. Brush the other side of each rectangle with a little water; fold it over the apples to completely encase them. Press the edges together to seal and ‘knock up’ the sides, tapping a sharp knife horizontally against the cut edges of the pastry. Arrange the pastries on a parchment-lined baking tray, brush with beaten egg and chill for 30 minutes. Preheat the oven to 180°C, gas mark 4. Brush the pastries with more egg, sprinkle with caster sugar, snip a hole in the top of each and bake for 25 minutes, until the pastry is risen, crisp and golden. Serve warm with the remaining caramel and extra crème fraîche, if liked."}], "nutrition": {"Energy": "2,279kJ 547kcals", "Fat": "36.5g", "Saturated Fat": "23.3g", "Carbohydrate": "49.3g", "Sugars": "25.3g", "Protein": "5.3g", "Salt": "0.3g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Apple puffs.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}