{"title": "Carrot patch cupcakes", "tags": null, "planning": {"prep_time": "PT25 minutesM", "cook_time": "PT25 minutesM", "total_time": "PT50 minutesM", "serves": "12"}, "ingredients": [{"item": "100g Président Butter Unsalted, softened, plus extra for greasing"}, {"item": "200g Billington’s Golden Caster Sugar"}, {"item": "1 British Blacktail Large Free Range Egg, beaten"}, {"item": "100ml whole milk"}, {"item": "½ tsp vanilla bean extract"}, {"item": "150g self-raising flour"}, {"item": "50g cocoa powder"}, {"item": "Pinch of sea salt flakes"}, {"item": "½ x 400g tub Cooks’ Ingredients Tanzanian Chocolate Icing"}, {"item": "25g dark chocolate"}, {"item": "200g white chocolate"}, {"item": "Orange food colouring gel"}, {"item": "12 British Strawberries, leaves attached"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease a 12-hole nonstick muffin tin with butter. Beat together the butter and sugar, using an electric mixer, until light and fluffy. Gradually beat in the egg, milk and vanilla. Finally, sift in the flour, cocoa powder and salt and whisk thoroughly."}, {"step": "Divide between the holes in the tin and bake for 20-22 minutes, or until springy to the touch. Remove from the oven and leave to cool in"}, {"step": "the tin for a couple of minutes, then remove to a rack to cool completely."}, {"step": "Spread the icing onto the cupcakes, then finely grate the dark chocolate over the top to look like soil. Set aside."}, {"step": "Melt the white chocolate with enough orange food colouring to give a vibrant ‘carrot’ colour in a bowl over a pan of just simmering water. Holding the strawberry leaves, dip the fruit into the chocolate until coated, but with the leaves clean. Place onto a baking parchment-lined tray and place in the fridge to set. Add some more orange gel to the remaining white chocolate to make a darker colour and drizzle from side to side over the set ‘carrots’. Leave to set again before placing one onto each cake."}], "nutrition": {"Energy": "1,617kJ 387kcals", "Fat": "20g", "Saturated Fat": "12g", "Carbohydrate": "45g", "Sugars": "33g", "Protein": "4.9g", "Salt": "0.4g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Carrotpatchcupcakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}