{"title": "Cauliflower & almond soup with chorizo drizzle", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "4"}, "ingredients": [{"item": "40g flaked almonds"}, {"item": "1 cauliflower"}, {"item": "2 tbsp olive oil"}, {"item": "1 large onion, roughly chopped"}, {"item": "2 sticks celery, chopped"}, {"item": "750ml semi-skimmed milk"}, {"item": "1 gluten free vegetable stock cube"}, {"item": "40g chorizo, very finely diced"}, {"item": "50ml essential Reduced Fat British Crème Fraîche"}], "instructions": [{"step": "Toast the almonds in a large saucepan then tip out onto a plate. Cut a quarter of the cauliflower into large florets, then into thick bitesized slices. Roughly chop the rest of the cauliflower including the core."}, {"step": "Heat 1 tbsp of oil in the saucepan and fry the sliced florets until deep golden, turning once or twice. Remove to a plate. Add the chopped cauliflower, onion, celery, milk and 250ml boiling water to the pan. Crumble in the stock cube and add all but 2 tbsp of the almonds. Bring to a simmer. Cover and cook for 20 minutes until the cauliflower is tender. Blend the soup until smooth, in a food processor or using a stick blender."}, {"step": "Heat the remaining oil in a small saucepan and add the chorizo. Cook very gently until the chorizo is crisped and the oil a deep amber colour. Stir half the crème fraîche into the soup and reheat gently. Season. Ladle into bowls and scatter with the fried cauliflower florets. Dot with the remaining crème fraîche and the reserved almonds. Spoon over the chorizo and its oil to serve."}], "nutrition": {"Energy": "1,320kJ 317kcals", "Fat": "20g", "Saturated Fat": "5.7g", "Carbohydrate": "20g", "Sugars": "15g", "Protein": "14g", "Salt": "1.7g", "Fibre": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Weekend_WK449_Good-Health_Cauliflower-Almond-Soup-_-Chorizo.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}