{"title": "Cauliflower cheese soup with crispy croutons", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT25M", "total_time": "PT45M", "serves": "8"}, "ingredients": [{"item": "1 medium cauliflower, with green leaves attached"}, {"item": "2 medium potatoes"}, {"item": "3 cloves garlic, finely chopped"}, {"item": "1L semi-skimmed milk"}, {"item": "3 sprigs thyme"}, {"item": "About 500ml vegetable stock (made with vegetable bouillon powder), or"}, {"item": "as needed"}, {"item": "2 tsp English mustard powder"}, {"item": "50g mature Cheddar, grated"}, {"item": "25g Parmigiano Reggiano, finely grated"}, {"item": "For the croutons"}, {"item": "3 thick slices stale bread (sourdough or ciabatta are perfect but any unsliced bread will work)"}, {"item": "2 tbsp olive oil"}, {"item": "1 tsp garlic granules (optional)"}, {"item": "1 tsp dried mixed herbs (optional)"}], "instructions": [{"step": "Trim any gnarly edges off the cauliflower, then chop the entire thing into small pieces, discarding only the end of the core piece and any blemished outer leaves. Everything else is edible. Wash well and dry. Peel the potatoes (keep the peel in long sections, covered with a clean, damp cloth, ready to be made into crisps – see recipe here). Chop the potato into small pieces."}, {"step": "Put the cauliflower, potato, garlic, milk and thyme into a large saucepan. Add enough stock to cover everything (you may not need it all, or you may need a little more). Cover and bring to a simmer over a medium heat. Reduce the heat to low and cook for 20 minutes, stirring occasionally, until the potato is totally soft. Remove the thyme sprigs. Add the mustard powder and cheeses to the pan, then use a heatproof stick blender or food processor to purée until smooth. Season to taste."}, {"step": "For the croutons, preheat the oven to 200ºC, gas mark 6. Cut the bread into cubes (1.5cm-2cm). Put in a mixing bowl, drizzle with the olive oil, then sprinkle over the garlic granules and mixed herbs, if using. Mix well with your hands."}, {"step": "Spread the croutons out on a large baking tray in a single layer (scrape out every bit from the bowl) and bake for 10-15 minutes, until golden. To store them for later use, cool completely, then keep in an airtight container for up to 2 days. Serve the hot soup scattered with the croutons, plus a little extra cheese if liked."}], "nutrition": {"Energy": "1,126kJ 268kcals", "Fat": "9.2g", "Saturated Fat": "3.9g", "Carbohydrate": "33g", "Sugars": "9.8g", "Protein": "13g", "Salt": "0.8g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/CAULIFLOWER_CHEESE-SOUP_WITH_HERB_AND_GARLIC_CROUTONS_0049_5.6.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}