{"title": "Cauliflower & smoked fish pie with crispy crumbs", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT75M", "total_time": "PT95M", "serves": "4 - 6"}, "ingredients": [{"item": "1 large cauliflower"}, {"item": "300g Maris Piper potatoes, cut into chunks"}, {"item": "40g unsalted butter"}, {"item": "600g smoked haddock fillet, skinned and cut into large portions"}, {"item": "5 tbsp milk"}, {"item": "350g tub essential Cheese Sauce"}, {"item": "100ml crème fraîche"}, {"item": "3 tbsp capers, rinsed"}, {"item": "150g frozen petits pois"}, {"item": "30g Cooks’ Ingredients Lemon & Pepper Crust"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Cut the cauliflower into florets and chop the stalk into small pieces. Cook the potatoes in a large pan of boiling, lightly salted water for 5 minutes. Reserve a quarter of the cauliflower florets and add the remainder and the stalks to the potatoes. Cook for a further 7-8 minutes until completely tender. Drain well, return to the pan and mash with half the butter."}, {"step": "Melt the remaining butter in a frying pan and gently fry the reserved cauliflower florets for 8-10 minutes until golden. Tip into a pie dish. Place the fish and milk in the pan and cook gently, turning the fish once, for 5-6 minutes until just cooked through. Lift the fish into the pie dish, breaking it into pieces."}, {"step": "Add the cheese sauce and crème fraîche to any cooking liquid left in the frying pan and heat through. Pour two-thirds into the dish, sprinkle with the capers and petits pois and spoon the mash on top. Pour over the remaining sauce. Scatter with the lemon and pepper crust and bake for about 45 minutes until the top is crisp and golden."}], "nutrition": {"Energy": "2,333kJ 558kcal", "Fat": "29g", "Saturated Fat": "18g", "Carbohydrate": "30g", "Sugars": "8.2g", "Protein": "42g", "Salt": "3.3g", "Fibre": "6.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cauliflower & smoked fish pie with crispy crumbs.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}