{"title": "Celeriac and cod fishcakes", "tags": null, "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT20M", "total_time": "PT50 minutes, plus coolingM", "serves": "6"}, "ingredients": [{"item": "800g skin-on cod fillet"}, {"item": "4 tbsp milk"}, {"item": "I large celeriac, peeled"}, {"item": "300g baking potatoes, peeled and cut into chunks"}, {"item": "80g pack prosciutto crudo, chopped"}, {"item": "2 tbsp capers"}, {"item": "1 tbsp finely chopped thyme"}, {"item": "1 medium British Blacktail Free Range Egg, beaten"}, {"item": "Polenta or plain flour, for dusting"}, {"item": "1 small clove garlic, crushed"}, {"item": "100ml half-fat crème fraîche"}, {"item": "100g half-fat mayonnaise"}, {"item": "25g pack fresh fl at-leaf parsley, finely chopped"}, {"item": "Vegetable oil, for shallow frying"}, {"item": "Lemon wedges, to serve"}, {"item": "140g pack Waitrose Wild Rocket, to serve"}], "instructions": [{"step": "Put the cod in a frying pan with the milk. Cover and cook gently for about 10 minutes, or until cooked through. Leave to cool in the pan."}, {"step": "Meanwhile, cut the celeriac into chunks and place in a pan with the potatoes. Cover with cold water and bring to the boil. Reduce the heat to a gentle simmer and cook until tender, about 15-20 minutes. Drain thoroughly, return to the pan and mash until fairly smooth."}, {"step": "Remove the fish from the pan and flake into pieces, discarding the skin and checking for any bones. Add to the mash with the prosciutto, capers, thyme and a little seasoning. Drizzle with the egg and mix together. Divide the mixture into 12 pieces. Shape into chunky cakes about 2cm thick, dusting both sides with polenta or flour."}, {"step": "For the sauce, mix together the garlic, crème fraîche, mayonnaise and parsley and transfer to a small serving dish."}, {"step": "Heat a little oil in a frying pan and fry the fishcakes, in batches, for about 3 minutes on each side until golden. Keep warm while frying the remainder. Serve with the sauce, lemon wedges and salad leaves."}], "nutrition": {"Energy": "1,737kj/414kcals", "Fat": "19.1g", "Saturated Fat": "4.4g", "Carbohydrate": "25.1g", "Sugars": "6.1g", "Salt": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/2014wked-March-r7codcakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}