{"title": "Celeriac latkes with quick pickled cucumbers", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30M", "cook_time": "PT20M", "total_time": "PT50M", "serves": "4 (makes 16)"}, "ingredients": [{"item": "½ celeriac, coarsely grated (ideally in a food processor)"}, {"item": "1 onion, coarsely grated (ideally in a food processor)"}, {"item": "3 tbsp plain flour"}, {"item": "2 eggs, beaten"}, {"item": "1 tsp caraway seeds, crushed"}, {"item": "4 tbsp reduced fat soured cream"}, {"item": "1 tbsp chopped dill, plus extra to serve"}, {"item": "2 tbsp sunflower oil"}, {"item": "1 cucumber, thinly sliced"}, {"item": "4g fine sea salt"}, {"item": "1 tbsp white wine vinegar"}, {"item": "1 tbsp caster sugar"}], "instructions": [{"step": "For the pickle, put the cucumber in a sieve and sprinkle over the salt; drain over the sink or a bowl for at least 20 minutes. Meanwhile, put the celeriac and onion in a clean tea towel, hold over the sink and squeeze out as much liquid as possible. Tip into a large bowl. Mix in the flour, eggs and caraway; season and set aside."}, {"step": "To finish the pickle, put the vinegar and sugar in a bowl and stir to dissolve. Press the salted cucumbers between sheets of kitchen paper to remove any excess moisture, then stir into the vinegar mixture; set aside. Mix the soured cream and dill in a small bowl, season and set aside."}, {"step": "Heat the oil in a large frying pan. Dollop heaped tablespoons of latke mixture into the pan; press down with a fork or fish slice. Fry over a medium heat for a few minutes each side, until golden and crisp (you will need to do this in batches). Set aside on a wire rack until you’ve finished cooking – you may need an extra splash of oil for the last batch. To serve, divide the latkes between 4 plates and add a spoonful each of the dill soured cream and pickled cucumbers. Sprinkle with a little more dill before serving."}], "nutrition": {"Energy": "1,054kJ 252kcals", "Fat": "13g", "Saturated Fat": "3.3g", "Carbohydrate": "22g", "Sugars": "9.7g", "Protein": "9g", "Salt": "1.3g", "Fibre": "5.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Celeriac-latkes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}