{"title": "Chantenay carrot risotto", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT45M", "total_time": "PT1 hour, 5 minutesM", "serves": "4"}, "ingredients": [{"item": "500g Waitrose Small Chantenay Carrots,"}, {"item": "ends trimmed and scrubbed"}, {"item": "1 litre fresh Cooks’ Ingredients Vegetable Stock"}, {"item": "4 tsp olive oil"}, {"item": "20g unsalted butter"}, {"item": "1 onion, finely diced"}, {"item": "1 celery stalk, finely diced"}, {"item": "4 garlic cloves, crushed"}, {"item": "250g arborio rice"}, {"item": "175ml dry white wine"}, {"item": "40g parmigiano reggiano, finely grated, plus extra to serve"}], "instructions": [{"step": "Preheat the oven to 200 ̊C, gas mark 6. Thinly slice 1⁄2 the carrots and put in a saucepan with the stock and 250ml water. Bring to the boil, then simmer for 15 minutes until tender.Meanwhile, in another large saucepan, heat 3 tsp oil and10g butter over a medium heat. Sweat the onion, celeryand garlic with a pinch of salt for 10 minutes until soft. Stirin the rice, then pour in the wine and stir until absorbed."}, {"step": "Meanwhile, halve the remaining carrots lengthways (leave any really small ones whole). Toss with the remaining 1 tsp oil; season. Spread out on a parchment-lined baking tray, sprinkle with 10g cheese and roast for 20 minutes, turning halfway."}, {"step": "Lift the sliced carrots from the stock with a slotted spoon and place in a blender with 120ml of the stock; whizz until smooth, scraping down the sides as needed. Keep the remaining stock warm over a low heat and start adding to the rice, 2 ladlefuls at a time. Keep stirring the risotto and adding more stock until all the liquid has been absorbed and the rice is just tender to the bite (about 20 minutes)."}, {"step": "Stir the carrot purée and the remaining 10g butter and 30g cheese into the risotto, cover and leave to stand for 5 minutes. Divide between plates, topped with the roasted carrots, some black pepper and a little more grated cheese."}], "nutrition": {"Energy": "2,032kj 484kcals", "Fat": "13g", "Saturated Fat": "5.8g", "Carbohydrate": "68g", "Sugars": "16g", "Protein": "13g", "Salt": "0.8g", "Fibre": "6.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/New recipes/4206-jan21-recipecard-chantenay-carrot-risotto (1).jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}