{"title": "Charred tomato and jalapeno salsa with tortilla chips", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT25M", "total_time": null, "serves": "6 as a snack"}, "ingredients": [{"item": "1⁄2 small onion, finely diced"}, {"item": "1 lime, juice"}, {"item": "5 medium vine tomatoes, halved"}, {"item": "2 Waitrose Cooks’ Ingredients jalapeno chillies"}, {"item": "8 garlic cloves, unpeeled"}, {"item": "2 tbsp roughly chopped coriander leaves, plus extra to serve"}, {"item": "1 tbsp chipotle paste"}, {"item": "320g pack corn and wheat tortillas"}, {"item": "2 tbsp vegetable oil"}, {"item": "pinch sweet smoked paprika"}], "instructions": [{"step": "Stir the onion into the lime juice and set aside to soak. Preheat the grill to high. Place the tomatoes cut-side up in a shallow baking tray lined with foil, then season. Grill on the top rack of the oven until blackened – about 10 minutes. Set aside and heat the oven to 220 ̊C, gas mark 7."}, {"step": "Meanwhile, heat a dry, non-stick heavy-based frying pan and gently cook the jalapenos and garlic, turning over a low-medium heat for about 10 minutes, or until blackened on all sides. Put in a plastic bag to steam for a few minutes, then peel. Deseed the jalapenos; discard the stems."}, {"step": "Finely chop the jalapeno and garlic flesh with the tomatoes and coriander leaves, then mix with the chipotle paste until smooth (or pulse in a food processor). Transfer to a serving bowl and stir in the onion and lime juice; season."}, {"step": "Brush the tortillas on both sides with the oil and cut into shards. Spread in a single layer on a large baking sheet and bake for 8-10 minutes, until golden. Season with salt and paprika and serve with the salsa, scattered with a little extra coriander."}], "nutrition": {"Energy": "897kj 213kcal", "Fat": "7.2g", "Saturated Fat": "1.6g", "Carbohydrate": "32g", "Sugars": "4.3g", "Protein": "5.1g", "Salt": "0.9g", "Fibre": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Tortilla and salsa.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}