{"title": "Cheesy shepherd's pie", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT1M", "total_time": "PT1 hour 20 minutesM", "serves": "6 - 8"}, "ingredients": [{"item": "4 large potatoes, peeled and diced"}, {"item": "125g butter"}, {"item": "1 tbsp vegetable oil"}, {"item": "400g lamb mince (typically 10% fat)"}, {"item": "500g pork mince (typically 8% fat)"}, {"item": "1 onion, peeled and diced"}, {"item": "2 carrots, peeled and grated"}, {"item": "1 beef stock cube"}, {"item": "150g frozen peas"}, {"item": "75g flour"}, {"item": "4 tbsp Worcestershire sauce"}, {"item": "300ml milk"}, {"item": "50g Cheddar cheese, grated"}, {"item": "25g Parmigiano Reggiano, grated"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Place the chopped potatoes into a pan and cover with cold water. Bring to the boil and simmer for 15 minutes, or until totally cooked through. Drain through a colander. Melt 75g of the butter in the pan the potatoes were cooked in. When melted turn off the heat, add the drained potatoes and mash until smooth. Leave the mashed potatoes to one side."}, {"step": "Heat half the vegetable oil in a large frying pan over a high heat. When hot, crumble in the lamb mince and brown all over until no pink juices remain. Tip the browned meat into a bowl, add the remaining oil to the pan and brown off the pork mince, adding it to the lamb mince once browned and no pink juices remain."}, {"step": "Reduce the heat to medium-high, add the diced onion to the pan and soften for 2 minutes before adding the grated carrot. Stir-fry the vegetables together for 1-2 minutes, or until the onion has further softened. Tip the browned meat back into the pan and crumble in the beef stock cube, stir the whole lot together to mix well."}, {"step": "Add the frozen peas, 25g of the flour and the Worcestershire sauce to the mixture and fry for 2 minutes, until everything is well incorporated. Tip the mixture in to a large baking dish (29cm x 20cm)."}, {"step": "Melt the remaining 50g of butter in a saucepan over a medium heat. When melted and bubbling, add the remaining 50g of flour and stir well to combine. Fry the mix for 1 minute, stirring constantly. Take the pan off the heat and work in roughly a quarter of the milk. Add another quarter and stir until smooth. Place the pan back on the heat and pour in the remaining milk, whisk the sauce as it comes to the boil. Stir in the grated cheeses and remove the pan from the heat."}, {"step": "Dollop the mash on top of the meat mix, spreading it all over to form a thin layer of potatoes. Pour the cheese sauce over the top, and spread until even."}, {"step": "Place the dish in the oven and bake for 20 minutes, or until golden and bubbling. Remove the dish from the oven and let it sit for 5 minutes before scooping out large mounds of pie."}], "nutrition": {"Energy": "2,076kJ 497kcals", "Fat": "28.9g", "Saturated Fat": "15.4g", "Carbohydrate": "29g", "Sugars": "7.2g", "Protein": "30.2g", "Salt": "1.2g", "Fibre": "3.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/WRWK180216 Phillip cheesy shepherds pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}