{"title": "Cheesy sweet potato samosas", "tags": null, "planning": {"prep_time": "PT30 minutes + coolingM", "cook_time": "PT65M", "total_time": "PT95 minutes + coolingM", "serves": "12"}, "ingredients": [{"item": "1 large sweet potato (about 400g)"}, {"item": "115g pack baby spinach"}, {"item": "100g Gruyère, coarsely grated"}, {"item": "2 tbsp red onion or tomato chutney"}, {"item": "1 tsp thyme leaves"}, {"item": "4 sheets filo pastry"}, {"item": "25g unsalted butter, melted"}, {"item": "½ x 190g jar Meena’s Cool Mint Raita, to serve"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Carefully prick the sweet potato all over with a fork, put it on a baking tray and bake for 45-50 minutes, or until soft. Leave to cool for 15 minutes."}, {"step": "Meanwhile, put the spinach in a heatproof bowl and carefully pour over a kettleful of just-boiled water. Leave for a minute or two until the spinach has wilted, then tip into a colander and leave to drain. Press with a fork to squeeze out any excess water."}, {"step": "Halve the potato and use a spoon to scoop the flesh into a bowl, discarding the skin. Roughly chop the spinach and stir it in, along with the cheese, chutney and thyme. Season and leave to cool."}, {"step": "Using scissors, cut the sheets of filo lengthways into three strips. Stack the strips on top of each other and cover with a clean, damp tea towel. Remove the top pastry strip, leaving the others covered, and lay it vertically. Put a spoon of potato mixture at the top of the strip."}, {"step": "From one of the top corners of the pastry, make a diagonal fold to enclose the filling, then continue folding to form a neat, triangular parcel. Brush with the melted butter and put on a nonstick baking tray."}, {"step": "Repeat to make 12 parcels, then chill until ready to cook. Preheat the oven to 200°C, gas mark 6. Bake the samosas for 10-15 minutes, until crisp and golden, and serve warm with the cool mint raita."}], "nutrition": {"Energy": "530kJ 126kcals", "Fat": "5.1g", "Saturated Fat": "3.2g", "Carbohydrate": "15g", "Sugars": "5.9g", "Protein": "4.1g", "Salt": "0.5g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Samosas_055.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}