{"title": "Cheese and apple scones", "tags": null, "planning": {"prep_time": "PT5M", "cook_time": "PT15M", "total_time": "PT20M", "serves": "10"}, "ingredients": [{"item": "300g essential Waitrose Self-Raising Flour, plus a little extra for dusting"}, {"item": "½tsp baking powder"}, {"item": "75g butter, chilled and diced"}, {"item": "125g essential Waitrose Extra Mature Cheddar, grated"}, {"item": "6 sprigs fresh thyme, stalks discarded"}, {"item": "1 eating apple, such as Cox, coarsely grated"}, {"item": "1 essential Waitrose Medium Free Range Egg"}, {"item": "About 150ml milk"}], "instructions": [{"step": "Preheat the oven to 200ºC, gas mark 6, and grease a large baking sheet. Tip the flour into a large mixing bowl and stir in the baking powder. Add the diced butter and use your fingertips to rub it into the flour until it resembles fine breadcrumbs."}, {"step": "Stir 75g of the grated cheese, the thyme leaves and apple into the mixture. Crack the egg into a small measuring jug, beat lightly and then add enough of the milk to make up to 150ml liquid. Make a well in the centre of the flour mix, pour in the egg and milk and bring together with a round-bladed knife to form a soft dough."}, {"step": "Transfer the dough onto a lightly floured work surface, knead briefly until smooth then roll it out to 2cm thick. Using a 6cm straight-sided pastry cutter, cut out 10 scones, re-rolling the dough as you go."}, {"step": "Arrange the scones on the prepared baking sheet, making sure that they are spaced well apart without touching. Brush the tops with a little extra milk and then sprinkle a good pinch of the remaining grated cheese over the top of each scone. Bake for 12-15 minutes until well risen and golden. Transfer to a wire rack to cool. Serve warm, buttered, either on their own or with extra Cheddar and slices of apple."}], "nutrition": {"Energy": "987.424kJ 236kcal", "Fat": "11.9g", "Saturated Fat": "7.1g", "Carbohydrate": "25g", "Sugars": "2.4g", "Salt": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Scones_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}