{"title": "Cheese scones with whipped feta butter", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT20M", "total_time": "PT35M", "serves": "16"}, "ingredients": [{"item": "300g plain flour, plus extra for dusting"}, {"item": "1 tbsp baking powder"}, {"item": "½ tsp English mustard powder"}, {"item": "½ tsp cayenne pepper"}, {"item": "50g unsalted butter, chilled, diced"}, {"item": "100g grated mature Cheddar"}, {"item": "25g grated Parmigiano Reggiano"}, {"item": "4 salad onions, trimmed and sliced"}, {"item": "2 tbsp finely chopped chives"}, {"item": "100ml buttermilk"}, {"item": "125ml milk, plus 1 tbsp for glazing"}, {"item": "75g unsalted butter, at room temperature"}, {"item": "75g soft cheese"}, {"item": "100g feta, crumbled"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Line a baking sheet with baking parchment. Sift the plain flour, baking powder, mustard powder and cayenne into a large mixing bowl. Season well and add the butter. Using your fingers, rub the butter into the dry ingredients until there are only small flecks of butter still visible. Add all but 1 tbsp of the grated Cheddar, all of the Parmigiano Reggiano, the salad onions and half the chives, and mix to combine."}, {"step": "Make a well in the middle of the mixture, and pour in the buttermilk and milk. Using a palette or table knife, mix until the dough is just combined. Turn out onto a lightly floured work surface and very lightly knead the dough for 10 seconds until combined. Pat the dough into a neat square with a thickness of just over 2cm. Cut into 16 squares and place on the prepared baking sheet, leaving a little space between each scone to allow for spreading during cooking."}, {"step": "Brush the tops with a little milk, scatter with the remaining cheese and bake on the middle shelf of the preheated oven for 15-20 minutes until well risen and golden brown. Cool on a wire rack."}, {"step": "To prepare the feta butter, beat the butter until pale and light. Add the soft cheese and crumbled feta, and beat again until smooth. Add the remaining chives, season with black pepper and mix again. Split the scones in half and spread liberally with feta butter to serve."}], "nutrition": {"Energy": "827kJ 198kcals", "Fat": "12.2g", "Saturated Fat": "7.8g", "Carbohydrate": "16.2g", "Sugars": "1.3g", "Protein": "5.9g", "Salt": "0.6g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Weekend_WK352_WKEnd_Sat-Bake_Cheese-Scones-Whipped-Feta-Butter.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}