{"title": "Cherry and almond victoria sandwich", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "10-12"}, "ingredients": [{"item": "225g unsalted butter, softened, plus extra for greasing"}, {"item": "225g caster sugar"}, {"item": "4 eggs"}, {"item": "1 tsp almond extract"}, {"item": "3 tbsp whole milk"}, {"item": "225g self-raising flour, sieved"}, {"item": "2 tbsp toasted flaked almonds"}, {"item": "425g can black cherries in light syrup (or 250g stoned fresh cherries)"}, {"item": "200g morello cherry preserve"}, {"item": "300ml double cream"}, {"item": "1 tbsp icing sugar, plus extra for dusting"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Lightly butter 2 x 20cm sandwich tins and line the bases with baking parchment. Using electric beaters or a freestanding mixer, beat together the butter and sugar for 3–4 minutes until light and fluffy. Beat in the eggs one at a time, then the almond extract and milk."}, {"step": "Fold in the flour with a pinch of salt, then divide between the tins, smoothing the tops. Scatter the almonds over the top of one cake. Bake for 25 minutes until risen and golden. Leave to cool in the tins for 5 minutes, then transfer to a wire rack to cool completely."}, {"step": "Meanwhile, drain the cherries from the can, reserving 2 tbsp syrup (if using canned cherries). Mix the cherries, reserved syrup and the preserve in a small pan. Cook over a medium heat, stirring, for 5–7 minutes until syrupy but not too thick. (If using fresh cherries, cook with the preserve for 10 minutes, until the cherries are soft.) Leave to cool completely."}, {"step": "Once the cakes and cherry filling are cool, whisk the cream and icing sugar together until soft peaks form. Place the plain cake on a serving plate and spread the cherry mixture over the top, then spoon over the cream. Top with the almond-sprinkled sponge and dust with icing sugar before serving."}], "nutrition": {"Energy": "2108.736kJ 504kcals", "Fat": "31.8g", "Saturated Fat": "18.4g", "Carbohydrate": "49g", "Sugars": "34.7g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Screen Shot 2013-04-25 at 16.50.49.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}