{"title": "Cherry Bakewell trifle", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8 - 10"}, "ingredients": [{"item": "400g essential Waitrose Black Cherries In Light Syrup"}, {"item": "72g Tate & Lyle Fruit Sugar (fructose)"}, {"item": "26g A L’Olivier Raspberry Vinegar"}, {"item": "10g gelatine (about 6 sheets)"}, {"item": "½ x 70cl bottle Heston from Waitrose Cherry Bakewell Vodka"}, {"item": "150g A L’Olivier Raspberry"}, {"item": "Vinegar"}, {"item": "150g whole milk"}, {"item": "300g double cream"}, {"item": "10g camomile flower tea leaves, from about 8-10 teabags"}, {"item": "6g gelatine (about 3 sheets)"}, {"item": "300g Waitrose British Blacktail Free Range Egg yolk (about 15 eggs)"}, {"item": "120g caster sugar"}, {"item": "½ x 70cl bottle Heston from Waitrose Cherry Bakewell Vodka"}, {"item": "450g Whipping cream"}, {"item": "45g Icing sugar"}, {"item": "50g roasted almonds, quartered"}, {"item": "10g egg white"}, {"item": "Pinch of salt"}, {"item": "90g caster sugar"}, {"item": "150g amaretto"}, {"item": "15g caster sugar"}, {"item": "88g Waitrose Sponge Fingers"}, {"item": "Popping candy"}, {"item": "Fresh lime zest"}, {"item": "Waitrose Cooks’ Homebaking Freeze Dried Strawberries"}], "instructions": [{"step": "For the macerated cherries, strain the cherries through a fine sieve, discarding the syrup. Place the cherries in a bowl and add the fruit sugar and raspberry vinegar. Cover and set aside, leaving the cherries to macerate until needed."}, {"step": "To make the cherry jelly, soften the gelatine in room temperature water. Meanwhile, in a pan over medium-high heat, bring the vodka to a boil, allowing it to boil for 3 minutes. Remove from the heat and set aside to cool slightly, then stir in the vinegar and the gelatine. Mix well until the gelatine has dissolved."}, {"step": "For the camomile custard, place the milk, cream and camomile leaves in a plan and allow to just come to a simmer over a low heat. Remove from the heat and cover, allowing to infuse for 30 minutes."}, {"step": "Strain the liquid through a fine sieve, discarding the leftover tea leaves. Weigh out 300g of the infused milk – if it’s less, top up with more milk. Place the infused milk in a pan and allow to come to a simmer. In the meantime, soften the gelatine in room temperature water."}, {"step": "In a separate bowl, mix the egg yolks with the sugar, using a whisk, until light and creamy. Pour the hot milk into the egg mixture, whisk well and put back in the pan. Cook until the mixture reaches 82ºC. Add the softened gelatine and mix until the gelatine has dissolved. Pass through a sieve and place over an iced water bath to cool."}, {"step": "For the cherry cream, place the vodka in a pan over high heat and boil until the mixture has reduced to 80g (about 100ml). In the bowl of a stand up mixer fitted with a whisk, beat the cream, icing sugar and cherry vodka to medium peaks. Cover and place in the fridge."}, {"step": "For the salted sugar almonds, place the almonds in a bowl and mix with the egg whites and salt to coat. Place in a 170ºC, gas mark 3 preheated oven for approximately 10 minutes or until they dry. In the meantime, place the sugar and 40g of water in a pan over medium heat and bring to 135ºC. Add the almonds, then remove the pan from the heat and whisk until the sugar crystallises. Pour onto a parchment-lined tray and allow to cool. Break into small pieces."}, {"step": "For the sponge fingers, mix the amaretto and sugar in a pan over medium heat until the sugar has dissolved. Allow to cool, then place the sponge fingers in a deep sided tray and pour the amaretto syrup on top. Allow to stand until the liquid has been absorbed."}, {"step": "In a large glass serving bowl, place the syrup-soaked fingers, covering the bottom of the bowl. Place the macerated cherries on top and pour over the cherry jelly. Place in the fridge and allow to set. When set, pour the camomile custard on top and place back in the fridge to set. Using a piping bag with a large plain nozzle, pipe the cream on top of the custard. Finish by sprinkling with popping candy, lime zest, freeze dried strawberries and the salted sugar almonds."}], "nutrition": {"Energy": "2,726kJ 655kcals", "Fat": "44.6g", "Saturated Fat": "23.2g", "Carbohydrate": "53.3g", "Sugars": "50.3g", "Protein": "10g", "Salt": "0.4g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Weekend-262_Heston_Cherry-Bakewell-Trifle131910.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}