{"title": "Cherry and almond ombré cake", "tags": null, "planning": {"prep_time": "PT50 minutes, plus coolingM", "cook_time": "PT45M", "total_time": "PT1 hour 35 minutes, plus coolingM", "serves": "12 - 14"}, "ingredients": [{"item": "225g unsalted butter, plus extra for greasing"}, {"item": "400g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "2 tsp almond extract"}, {"item": "4 large egg whites, lightly whisked until frothy"}, {"item": "325g plain flour"}, {"item": "25g cornflour"}, {"item": "41⁄2 tsp baking powder"}, {"item": "250ml whole milk"}, {"item": "300g cherries"}, {"item": "20g caster sugar"}, {"item": "4 large egg whites"}, {"item": "320g caster sugar"}, {"item": "2 tsp vanilla bean paste"}, {"item": "480g unsalted butter, diced, at room temperature"}, {"item": "red gel food colouring"}], "instructions": [{"step": "Start by making the compote. Set 7-8 cherries aside to decorate, then pit and halve the remaining cherries. Put in a small pan with the sugar and cook over a medium heat for about 10 minutes, stirring occasionally, until the fruit has softened and is starting to break down. Tip into a small bowl and set aside to cool."}, {"step": "Preheat the oven to 180 ̊C, gas mark 4; lightly grease 3 x 20cm cake tins and line the bases with baking parchment. For the cake, put the butter and sugar in a large bowl and, using electric beaters, beat together for 10 minutes, until light and fluffy. Add the vanilla and almond extracts and beat to combine. Add the egg whites a little at a time, beating until fully combined before adding more. In a separate bowl, mix the flour, cornflour, baking powder and a pinch of salt together, then beat into the butter mixture in 3 additions, alternating with the milk. Divide the cake batter between the prepared tins and bake for 25-30 minutes, or until a skewer inserted into the centres comes out clean. Cool in the tins for 10 minutes before inverting onto a wire rack to cool completely."}, {"step": "To make the buttercream, put the egg whites, sugar and vanilla in a large, heatproof bowl and set over a pan of simmering water. Whisk the mixture together lightly until the sugar has dissolved and the whites are warm – to test this, dip two fingers into the whites and rub together; if you can feel sugar grains it needs longer. Remove the bowl from the heat and use electric beaters to whisk until a thick, glossy meringue has been formed and is cool. Continue to whisk and add the butter a piece at a time. Once incorporated, you should have a silky smooth buttercream, if not, continue to whisk until the texture changes."}, {"step": "To decorate the cake, place the first layer onto a cake stand, spread with a thin layer of the buttercream and top with 1⁄2 the compote. Repeat with the second layer of the cake and finish by placing the final cake layer on top. Spread a very thin layer of buttercream over the entire cake, sealing in the crumbs. Divide the remaining buttercream into 3 portions: put 1⁄2 in a bowl and divide the remaining 1⁄2 between 2 separate bowls. Use the red gel food colouring to tint the smaller portions – one a pale red, the other a darker shade of red."}, {"step": "Transfer the darkest red buttercream into a piping bag and cut a hole 1cm from the tip. Pipe this around the bottom 1/3 of the cake (don’t worry about being neat at this stage). Repeat with the lighter buttercream across the middle, then pipe the white buttercream across the top 1/3 and over the top of the cake too."}, {"step": "Now carefully smooth out the piped buttercream. Using a palette knife or spatula, flatten out the top of the cake. Clean the palette knife or spatula and hold it at a slight angle horizontally against the cake, then, starting from the base, gently move it around and up the sides of the cake, merging the three shades. You might need to do this in stages, cleaning the excess icing off the palette knife or spatula in between."}, {"step": "To neaten up the icing, repeat as above with a clean palette knife, turning the cake to create a smooth finish. For the top of the cake, press the palette knife in the middle of the cake and then turn, slowly dragging the knife outwards, to create a light spiral effect. Place the reserved cherries on the top of the cake and serve."}], "nutrition": {"Energy": "2,987Kj 715Kcal", "Fat": "42.6g", "Saturated Fat": "27.6g", "Carbohydrate": "77.9g", "Sugars": "58.1g", "Protein": "5.1g", "Salt": "0.5g", "Fibre": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/Inspiration/Competitions/8.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}