{"title": "Cherry Clafoutis", "tags": null, "planning": {"prep_time": "PT30 minutes, plus 2 hours marinatingM", "cook_time": "PT45M", "total_time": "PT1 hour 5 minutes to 1 hour 15 minutes, plus 2 hours marinatingM", "serves": "4"}, "ingredients": [{"item": "500g \tcherries, stoned"}, {"item": "10 tbsp \tcaster sugar, plus extra to serve"}, {"item": "1 tbsp \tkirsch"}, {"item": "75g \tunsalted butter"}, {"item": "50g \tplain flour"}, {"item": "50g \tground almonds"}, {"item": "1 \tmedium egg, plus 3 egg yolks"}, {"item": "6 drops \tvanilla extract"}, {"item": "1\t unwaxed lemon, zest finely grated"}, {"item": "160ml\t whole milk"}, {"item": "160ml \twhipping cream"}], "instructions": [{"step": "Mix together the cherries, 1 tbsp caster sugar and the kirsch and leave to marinate for 2 hours to maximise the fruit’s flavour.  Preheat the oven to 190°C/gas 5. In a small saucepan, heat the butter until it turns a golden hazelnut colour and leave to cool. Brush inside a 20cm x 5cm-deep baking dish with 1 tbsp of the melted butter. Add 3 tbsp caster sugar and shake the dish to coat it. This will create a lovely crust round the pudding while it cooks.  In a bowl, mix the flour, ground almonds and two pinches of salt; make a well in the middle. Put the eggs, egg yolks, remaining 6 tbsp caster sugar, vanilla extract and lemon zest into the well. Using a whisk, slowly incorporate the egg mixture into the flour until it has a smooth consistency. Gradually whisk in the milk, then the cream and finally the cooled, browned butter.  Combine the mixture with the cherries and their juices; pour into the buttered, sugared baking dish to come three quarters of the way up the sides. Bake in the oven for 35–45 minutes. The clafoutis is cooked when the blade of a knife inserted into the mixture comes out completely clean. To serve, sprinkle over some more caster sugar."}], "nutrition": {"Energy": "3322.096kJ 794.0kcal", "Fat": "42.3g", "Saturated Fat": "23.7g", "Sugars": "74.0g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/0807062-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}