{"title": "Cherry Bakewell cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 45 minutes, plus coolingM", "serves": "10"}, "ingredients": [{"item": "200g unsalted butter, softened, plus extra for greasing"}, {"item": "150g Waitrose Cooks’ Homebaking golden marzipan, cut into 1cm cubes"}, {"item": "150g cherries, halved"}, {"item": "150g self-raising flour, sifted 2 tbsp"}, {"item": "200g golden caster sugar"}, {"item": "3 large beaten eggs"}, {"item": "1 tsp vanilla extract"}, {"item": "70g ground almonds"}, {"item": "1 lemon, zest and 2 tbsp juice"}, {"item": "3-5 tbsp icing sugar"}, {"item": "2 tbsp toasted flaked almonds"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Lightly grease and line a deep, 20cm cake tin with parchment. Toss the marzipan and all but 4 of the cherry halves in 2 tbsp of flour then set aside. Beat the butter and sugar together until light and fluffy. Gradually add the eggs, beating between additions and stirring in a spoonful of flour if the mixture curdles. Add the vanilla, then fold in the remaining flour and ground almonds, followed by the lemon zest and 1½ tbsp juice, to make a thick batter."}, {"step": "Spoon about 2 /3 of the batter into the tin and top with half the floured cherries and marzipan. Cover with the remaining batter, smooth the top, and add the remaining cherries and marzipan in an even layer, pressing them down slightly (they will sink into the cake as it cooks). Bake for about 1 hour 15 minutes, loosely covering the top of the cake with foil if it browns too quickly. Cool in the tin for 15 minutes before carefully turning out onto a wire rack to cool completely."}, {"step": "Roughly chop the 4 reserved cherry halves and squeeze out their juice (or pass through a sieve) into a bowl. Stir in the remaining ½ tbsp lemon juice and the icing sugar until you have a smooth, spoonable, pink icing. Drizzle ½ this icing over the cake, scatter with the flaked almonds and drizzle with the remaining icing to finish."}], "nutrition": {"Energy": "1,994kJ 477kcals", "Fat": "26g", "Saturated Fat": "12g", "Carbohydrate": "51g", "Sugars": "39g", "Protein": "7.6g", "Salt": "0.3g", "Fibre": "2.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cherry-bakewell-tart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}