{"title": "Cherry & almond brioche French toast", "tags": null, "planning": {"prep_time": "PT15 minutesM", "cook_time": "PT30 minutesM", "total_time": null, "serves": "4"}, "ingredients": [{"item": "425g can black cherries in light syrup"}, {"item": "3 tsp Tate & Lyle Fairtrade Cane Icing Sugar, plus extra for dusting"}, {"item": "1 medium British Blacktail Free Range Egg"}, {"item": "250ml whole milk"}, {"item": "1⁄2 tsp almond extract"}, {"item": "8 slices sliced brioche loaf"}, {"item": "2 tbsp unsalted butter"}, {"item": "150g pot vanilla yogurt"}, {"item": "1 tbsp toasted flaked almonds"}], "instructions": [{"step": "Put a sieve over a small saucepan and drain the cherries. Set the cherries aside and simmer the juices for 5 minutes until reduced. Add 1 tsp icing sugar and the drained cherries to the saucepan and simmer for another 5 minutes, until the cherries are coated in a glossy syrup."}, {"step": "Meanwhile, set your largest frying pan over a medium-highheat. In a large, shallow dish, whisk the egg, milk, almondextract and remaining 2 tsp icing sugar. Add 4 brioche slices to the mixture, soaking on each side for about 45 seconds until they’ve absorbed plenty of the mixture but aren’t too soggy. Add 1 tbsp butter to the frying pan and, when foaming, fry the brioche for 4 minutes on each side until golden and puffed up. Arrange on plates while you prepare the remaining slices in the same way, frying in the remaining 1 tbsp butter."}, {"step": "Serve 2 slices of brioche per person. Top with a spoonful of vanilla yogurt and the warm cherries and syrup (reheat briefly if necessary). Scatter with the toasted almonds and dust with a little icing sugar to serve."}], "nutrition": {"Energy": "1,643kj 392kcals", "Fat": "18g", "Saturated Fat": "9.1g", "Carbohydrate": "46g", "Sugars": "22g", "Protein": "11g", "Salt": "0.7g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/New recipes/4983-Cherry-Almond-French-Toast.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}