{"title": "Cherry, vanilla & amaretti crumb gelato", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes + freezingM", "cook_time": "PT10M", "total_time": "PT30 minutes + freezingM", "serves": "1 litre"}, "ingredients": [{"item": "4 large Waitrose British Blacktail Free Range Egg yolks"}, {"item": "150g caster sugar"}, {"item": "1 litre unsweetened almond milk"}, {"item": "1 tsp vanilla powder or essence"}, {"item": "250g cherries, pitted"}, {"item": "50g caster sugar"}, {"item": "Juice of ½ a lemon"}, {"item": "100g amaretti biscuits, crushed"}], "instructions": [{"step": "Whisk the egg yolks with the caster sugar until combined."}, {"step": "In a pan, warm the almond milk with the vanilla powder (or essence), then add a ladleful to the egg yolks. Stir to combine then pour all of this egg mixture back into the remaining almond milk."}, {"step": "Stir continuously over a low heat until slightly thickened and the mixture coats the back of a spoon. This will take up to 10 minutes – take care not to rush this stage or the eggs will scramble. Remove from the heat, tip into a bowl and cover with clingfilm, pressing the film onto the surface to prevent a skin forming. Chill before churning."}, {"step": "Whizz the cherries in a blender with the sugar and lemon juice, and set aside."}, {"step": "Pour the cooled custard into an ice cream machine and churn for 20 minutes until thick. If you don’t have an ice cream machine, tip the mixture into a tub, freeze for 2 hours then stir with a fork to break up any large crystals. Repeat the stirring every few hours until the ice cream is smooth and frozen."}, {"step": "Pour the cherry juice over the ice cream and swirl with a spoon. Scatter over the amaretti crumbs and freeze overnight. Remove from the freezer 15-30 minutes before serving to soften slightly."}], "nutrition": {"Energy": "455kJ 108kcals", "Fat": "2.6g", "Saturated Fat": "0.5g", "Carbohydrate": "19.5g", "Sugars": "19.1g", "Protein": "1.6g", "Salt": "0.1g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Weekend-269_Wk'end-Meals_Cherry-Vanilla-&-Ameretti-Crumb-Gelato.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}