{"title": "Cherry cheesecake torte", "tags": null, "planning": {"prep_time": "PT35M", "cook_time": "PT50M", "total_time": "PT85M", "serves": "10"}, "ingredients": [{"item": "225g self-raising flour, plus extra for dusting"}, {"item": "200g firm, lightly salted butter, diced, plus extra to grease"}, {"item": "225g icing sugar"}, {"item": "4 medium egg yolks, plus"}, {"item": "1 tbsp beaten egg white, to glaze"}, {"item": "2 x 200g tubs full fat soft cream cheese"}, {"item": "300g cherries, pitted, plus a handful for decoration"}, {"item": "1 x vanilla sugar, for dusting"}], "instructions": [{"step": "Put the flour in a food processor with the butter and blend until the mixture resembles fine breadcrumbs. Briefly blend in 175g of the icing sugar. Add the egg yolks and blend to a thick, soft paste. (Alternatively, rub the butter into the flour with your fingertips then add the sugar and egg yolks and mix to a dough). Wrap in clingfilm and chill for about 1½-2 hours until firm."}, {"step": "Preheat the oven to 180ºC, gas mark 4. Beat the cream cheese in a bowl with the remaining icing sugar. Grease a 22-23cm spring-release tin."}, {"step": "Roll out 375g of the dough on a lightly floured surface until roughly 5cm larger than the diameter of the tin. Lift into the tin and press into the edges and about 3cm up the sides (patching with extra pastry, if required). Spread the cheese mixture into the case, scatter the cherries on top and push them down into the filling. Roll out the remaining dough and lay over the filling, pressing it down around the edges to enclose the filling and secure the two layers of dough together."}, {"step": "Brush with the egg white and place on a baking sheet and cook for 50 minutes or until risen, crisp and golden. Leave in the tin for 1 hour before transferring to a serving plate. Serve slightly warm or at room temperature, dusted with vanilla sugar and scattered with extra cherries."}], "nutrition": {"Energy": "1995.768kJ 477kcals", "Fat": "29.3g", "Saturated Fat": "17.9g", "Carbohydrate": "47.4g", "Sugars": "30.3g", "Salt": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/2012wkwe-August-r12h.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}