{"title": "Cherry and Chocolate Hot Cross Buns", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes plus provingM", "cook_time": "PT25M", "total_time": "PT40M", "serves": "12"}, "ingredients": [{"item": "450 g Waitrose Very Strong Canadian Flour"}, {"item": "½ tsp salt"}, {"item": "2 tsp ground cinnamon"}, {"item": "100 g caster sugar"}, {"item": "7g sachet McDougalls Fast Action Dried Yeast"}, {"item": "2 x 80g packs Forest Feast Sour Cherries"}, {"item": "100g pack Waitrose Cooks’ Ingredients Dark Chocolate Chunks"}, {"item": "50 g butter"}, {"item": "250 ml semi-skimmed milk, plus 3 tbsp extra for the glaze"}, {"item": "1 egg, beaten"}, {"item": "50 g plain flour"}], "instructions": [{"step": "Sift the strong flour, salt and 1 and a half tsp cinnamon into a large bowl to lightly combine the ingredients. Add 50g sugar, and the yeast, dried cherries and chunks of chocolate, then stir until just combined.  Gently melt the butter in a small pan, add 250ml milk and heat for 1 minute until tepid. Pour in the egg and stir enough of the milk mixture into the flour to form a soft dough, using a round-bladed knife.  Turn out onto a lightly floured work surface and knead for about 10 minutes until smooth and elastic. Divide the dough into 12 equal-sized pieces and shape into balls, pushing any of the chunks of chocolate that poke out of the dough back in, to stop too much chocolate oozing out in the oven. Transfer onto large baking sheets lined with non-stick baking parchment, leaving space between each bun. Cover with lightly oiled clingfilm. Leave to prove in a warm place for about 1-1 1 and a half hours, until doubled in size.  Preheat oven to 190°C, gas mark 5. To decorate with the crosses, put the plain flour in a small bowl and gradually add 5-6 tbsp cold water to form a smooth, thick paste. Spoon this mixture into a small piping bag, or a clean plastic food bag and snip off a corner, then neatly pipe a cross over each of the buns. Bake in the oven for 20-25 minutes until golden brown in colour.  Meanwhile, prepare the glaze. Place the remaining milk, 3 tbsp cold water, the remaining cinnamon and sugar in a small pan and heat gently for 2-3 minutes, stirring until the sugar has dissolved. When the buns are cooked, transfer them onto a cooling rack and brush the glaze over each one twice. Allow to cool."}], "nutrition": {"Energy": "1334.696kJ 319.0kcal", "Fat": "7.5g", "Saturated Fat": "4.2g", "Sugars": "24.9g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/0903ss10r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}