{"title": "Chestnut chocolate cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT35M", "total_time": "PT55M", "serves": "6 - 8"}, "ingredients": [{"item": "150g butter, plus extra"}, {"item": "for greasing"}, {"item": "150g fresh chestnuts"}, {"item": "150g dark chocolate"}, {"item": "2 tbsp Waitrose 1 Salted Caramel Dipping Sauce"}, {"item": "3 Waitrose British Blacktail Large Free Range Eggs, separated"}, {"item": "100g caster sugar"}, {"item": "2 tbsp granulated sugar"}, {"item": "5 or 6 fresh chestnuts,"}, {"item": "cocoa powder, for dusting"}], "instructions": [{"step": "Preheat the oven to 180°C gas mark 4. Butter and base-line a 20cm deep round cake tin. Roast all the chestnuts for 30 minutes. When cool enough to handle, remove their skins. Reserve 5-6 for topping and finely chop the remaining chestnuts in a processor."}, {"step": "Break up the chocolate and place in small pan with the butter and caramel sauce. Heat gently until just melted. Put the egg yolks and sugar in a large bowl and whisk with an electric mixer until pale and thick – it should leave a thick trail across the top. Whisk in the melted chocolate then fold in the chopped chestnuts."}, {"step": "Whisk the egg whites until they form soft peaks. Stir a quarter into the chocolate mixture to loosen, then fold the chocolate into the whites. Spoon into the prepared tin and bake for 30–35 minutes until well risen and just set. It will be a little soft and gooey inside. Cool for 5 minutes then turn onto a cooling rack."}, {"step": "For the topping, melt the sugar in a small pan then cook until a golden caramel. Remove from the heat, and toss the reserved chestnuts in the caramel. Turn out onto baking parchment and leave to set. Dust the cake with cocoa powder and scatter with the chopped caramelised chestnuts and serve with vanilla ice cream or crème fraÎche."}], "nutrition": {"Energy": "1,747kJ 419kcals", "Fat": "26.5g fat", "Saturated Fat": "15.5g", "Carbohydrate": "37.9g", "Sugars": "26.9g", "Protein": "5.8g", "Salt": "0.5g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/_Chestnut-Chocolate-Cake_-178054.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}