{"title": "Garlic and coriander naan bread", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "50g unsalted butter"}, {"item": "1 clove garlic, peeled and finely chopped"}, {"item": "½ x 28g pack fresh coriander"}, {"item": "3g fast action dry yeast"}, {"item": "450g Waitrose Canadian & Very Strong White Bread Flour"}, {"item": "150g natural yogurt"}, {"item": "1 Waitrose British Black Tail Free Range Egg, lightly beaten"}, {"item": "150g whole milk"}, {"item": "10g salt"}, {"item": "4 packs Heston from Waitrose Chicken Tikka Curry Skewer"}], "instructions": [{"step": "For the coriander butter, melt the butter in a pan over low heat. With a spoon, remove the frothy layer. Add the chopped garlic to the clarified butter. Finely chop the coriander leaves and add to the butter. Allow to stand for at least 10 minutes to cool or until needed."}, {"step": "To make the naan bread, mix the yeast with a tablespoon of lukewarm water and set aside for 5 minutes. Place the flour, yogurt, egg, yeast mixture and milk in the bowl of a stand up mixer fitted with a hook and mix for 3 minutes or until a dough is formed. Allow to rest for 10 minutes. Add the salt and mix for a further 5 minutes on medium speed until a smooth dough is formed. Portion into 8 even balls and place on an oiled tray. Oil a sheet of clingfilm and cover the dough balls, place the tray in a warm place and allow the dough to prove for 2 ½ hours or until it has doubled in size."}, {"step": "Meanwhile, light the barbecue and preheat a pizza stone on the grill for 20 minutes. Gently take a portion of dough with greased hands and roll into a round shape approximately 0.5cm thick. Carefully place the naan bread on the stone and cook for approximately 3-4 minutes or until cooked through. Turn the naan over and cook for 30 seconds to 1 minute. Remove from the grill, brush with some of the reserved garlic butter and serve with the Heston from Waitrose Chicken Tikka Curry Skewers, cooked according to pack instructions."}], "nutrition": {"Energy": "3,588kJ 855kcals", "Fat": "34.9g", "Saturated Fat": "13.7g", "Carbohydrate": "89.9g", "Sugars": "6.5g", "Protein": "45.2g", "Salt": "3.3g", "Fibre": "4.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Weekend-261_Chicken-Tikka-Skewers-&-Naan-Bread131845.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}