{"title": "Chicken liver parfaits with sauternes jelly recipe | Waitrose", "tags": [{"tag": "Gluten Free"}, {"tag": "Christmas"}], "planning": {"prep_time": "PT30 minutes, plus cooling and overnight chillingM", "cook_time": "PT45M", "total_time": "PT75 minutes, plus cooling and overnight chillingM", "serves": "8"}, "ingredients": [{"item": "220g unsalted butter"}, {"item": "400g chicken livers, trimmed, frozen and defrosted†"}, {"item": "4 shallots, finely sliced"}, {"item": "1 garlic clove, finely sliced"}, {"item": "1 tsp thyme leaves, chopped"}, {"item": "2 bay leaves"}, {"item": "200ml sauternes"}, {"item": "1⁄4 tsp freshly grated nutmeg"}, {"item": "2eggs"}, {"item": "11⁄2 tsp fine salt"}, {"item": "100ml double cream"}, {"item": "175ml sauternes"}, {"item": "2 sheets leaf gelatine"}, {"item": "handful thyme sprigs"}, {"item": "†The Food Standards Agency recommends freezing and defrosting chicken livers before cooking in a pate"}], "instructions": [{"step": "Preheat the oven to 140 ̊C, gas mark 1. Melt 20g butter in a frying pan and fry the livers for 1-2 minutes on each side, until just browned. Remove from the pan and set aside."}, {"step": "Gently fry the shallot in another 20g butter in the pan with a pinch of salt for 5 minutes, until soft but not coloured. Add the garlic, thyme and bay; cook for 1 minute. Add the sauternes and bubble for 2-3 minutes, until slightly reduced, scraping the pan. Take off the heat, discard the bay and tip everything into a food processor with the livers, nutmeg, eggs and salt."}, {"step": "Gently warm the remaining 180g butter with the cream in a small pan. Blend the liver mixture and slowly pour in the buttery mixture in 2-3 additions, blending to a smooth liquid. Pass through a fine sieve into a wide jug, pressing it with a wooden spoon."}, {"step": "Divide between 8 small ramekins, leaving a 0.5cm gap at the top of each. Put them in a large, deep roasting tray and pour in enough just-boiled water to reach 2/3 up the side of each ramekin. Cover with foil and bake for 30-40 minutes, testing after 25 minutes with a digital thermometer. Once they reach 70 ̊C in the middle they are ready and should be just set. Transfer the ramekins to a wire rack to cool completely; cover and chill overnight."}, {"step": "For the jelly, bring the sauternes to a simmer in a small pan; take off the heat and cool slightly. Soak the gelatine in cold water for 5 minutes. Squeeze out the water, then stir into the wine until dissolved; pour into a small bowl and cool. Set this bowl in another bowl of ice; stir until the jelly thickens but is still pourable."}, {"step": "Smooth any cracks on the surface of the parfaits and top each with 2 thyme sprigs. Pour over the jelly until evenly covered. Chill for 1-2 hours, until set. Take out of the fridge 15 minutes before serving. The parfaits can be stored in the fridge for up to 24 hours."}], "nutrition": {"Energy": "1,485kJ 359kcals", "Fat": "32.6g", "Saturated Fat": "19.8g", "Carbohydrate": "4.1g", "Sugars": "3.8g", "Protein": "12.3g", "Salt": "1.1g", "Fibre": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Pate_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}