{"title": "Chick biscuits", "tags": [{"tag": "Vegetarian"}, {"tag": "Children's"}], "planning": {"prep_time": "PT30M", "cook_time": "PT9-10 minutesM", "total_time": null, "serves": "24"}, "ingredients": [{"item": "250g plain flour"}, {"item": "½ tsp Cook’s Homebaking Bicarbonate Of Soda"}, {"item": "2 tsp ground ginger"}, {"item": "100g Stork"}, {"item": "1 Waitrose British Blacktail Medium Free Range Egg"}, {"item": "2 tbsp golden syrup"}, {"item": "300g icing sugar"}, {"item": "Yellow, orange and black gel food colouring"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Line 2 large baking trays with baking parchment."}, {"step": "Place the flour, bicarbonate of soda and ginger in a large bowl. Add the Stork and rub in with your fingertips until it resembles breadcrumbs."}, {"step": "Mix the egg and syrup, pour this into the flour and mix to give a soft dough. Roll out on to a floured surface to 0.5cm thick and, using a 6cm round cutter, cut out 24 rounds. Place on the trays leaving space between them. Bake for 9-10 minutes or until golden. Cool on a wire rack."}, {"step": "Sift the icing sugar into a large bowl and add 2-3 tbsp water until you get a smooth mixture that is thick but just pourable. Reserve 2 tbsp in a small bowl and set aside. In a separate bowl add ½ tbsp icing and add a little black colouring. Finally, reserve 1 tbsp icing and add a little orange colouring. Place all these in 3 separate plastic piping bags until required. Add yellow colouring to the remaining icing."}, {"step": "Spread the yellow icing over the biscuits up to the edge and allow to dry completely. Pipe pea-sized circles for eyes with the white icing and fill in the centre. Using the orange icing, pipe beaks and 2 small lines at the bottom for feet and allow to dry. Make dots in the centre for the eyeballs with the black icing to finish."}], "nutrition": {"Energy": "517kJ 123kcals", "Fat": "3.5g", "Saturated Fat": "1.2g", "Carbohydrate": "20g", "Sugars": "20g", "Protein": "1.2g", "Salt": "0.3g", "Fibre": "trace"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/WRWK22032018_Chick-Biscuits_183004.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}