{"title": "Chicken shawarma with easy flatbreads", "tags": null, "planning": {"prep_time": "PT20 minutes + chillingM", "cook_time": "PT25M", "total_time": "PT45 minutes + chillingM", "serves": "4"}, "ingredients": [{"item": "1 Essential Lemon, zest and juice, plus wedges, to serve"}, {"item": "150ml Essential Greek Style Yogurt, plus 2 tbsp"}, {"item": "2 tsp Cooks’ Ingredients Shawarma Spice Blend"}, {"item": "6 Essential British Chicken Thigh Fillets"}, {"item": "200g Essential Self-raising White Flour, plus extra"}, {"item": "for rolling"}, {"item": "½ red cabbage (about 400g), very thinly sliced"}, {"item": "1 small Essential Red Onion, very thinly sliced"}, {"item": "5 radishes, very thinly sliced"}, {"item": "1 tsp nigella seeds, or black sesame seeds"}, {"item": "1 tbsp Essential Olive Oil"}, {"item": "½ x 25g pack fresh mint"}], "instructions": [{"step": "Put the lemon zest and half the juice in a large bowl. Stir in 2 tbsp yogurt and the spice blend. Using tongs or a fork, add the chicken to the yogurt mixture, turning until evenly coated. If time allows, cover and chill for up to 2 hours."}, {"step": "In a large bowl, stir together the remaining 150ml yogurt, the flour and a pinch of salt. Using your hands, bring the mixture together to make a soft dough. Lightly flour the work surface and knead the dough for 2-3 minutes until smooth. Return to the bowl and cover."}, {"step": "Stir together the cabbage, red onion, radishes and the remaining lemon juice."}, {"step": "Preheat the grill to medium. Transfer the chicken to a foil-lined grill pan and cook for 10 minutes on each side until nicely browned, thoroughly cooked, the juices run clear and no pink meat remains."}, {"step": "Meanwhile, divide the dough into 4 balls and roll each out to a rough 20-23cm round. Sprinkle over a few nigella seeds and roll them into the dough. Heat a nonstick frying pan and cook the bread for 2 minutes on each side until puffed and lightly browned. Drizzle each with a little olive oil and put on serving plates."}, {"step": "Slice the chicken, pile on top of the bread with the cabbage slaw then scatter with mint leaves. Serve with a lemon wedge on the side."}], "nutrition": {"Energy": "1,896kJ 451kcals", "Fat": "15g", "Saturated Fat": "5.3g", "Carbohydrate": "46g", "Sugars": "8.2g", "Protein": "28g", "Salt": "0.9g", "Fibre": "5.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/Essential relaunch 2020/shawama-recipeimage.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}