{"title": "Chicken rice bowl with soft-boiled egg and veggie pickle", "tags": null, "planning": {"prep_time": "PT20 minutes, plus resting M", "cook_time": "PT15M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "6 essential Waitrose British chicken thigh fillets (about 500g), trimmed of excess fat and sinew, halved"}, {"item": "15g fresh root ginger, finely grated"}, {"item": "2 tbsp mirin rice wine"}, {"item": "2 tbsp less salt soy sauce"}, {"item": "1 large carrot, cut into matchsticks"}, {"item": "1⁄2 cucumber, finely sliced"}, {"item": "3 tbsp Chinese rice vinegar"}, {"item": "250g basmati (or long grain) rice"}, {"item": "4 essential Waitrose eggs"}, {"item": "4 tbsp sriracha (or chilli sauce)"}, {"item": "vegetable oil, for greasing"}, {"item": "1 sheet sushi nori, finely snipped with scissors (optional)"}], "instructions": [{"step": "In a large bowl, mix the chicken with the ginger, mirin and soy; set aside. In another bowl, toss the carrot and cucumber with 2 tbsp rice vinegar and a large pinch of salt; set aside to pickle slightly. Meanwhile, cook the rice according to pack instructions; drain."}, {"step": "In a separate pan, boil the eggs for 6 minutes. Cool under cold water, then peel and set aside. Mix the remaining 1 tbsp vinegar with the sriracha (or chilli sauce) in a small bowl and set aside."}, {"step": "Preheat the grill to high. Spread the chicken over a foil-lined baking tray, wiping off the excess marinade. Grill for 4-5 minutes each side, until crisp and piping hot; rest under foil for 5 minutes. 4 Divide the rice and chicken between bowls. Drain the pickled vegetables and halve the boiled eggs; add both to the bowls. Drizzle over the chilli sauce mix and top with the sushi nori, if using."}], "nutrition": {"Energy": "2,429kJ 578kcals", "Fat": "20.4g", "Saturated Fat": "5.2g", "Carbohydrate": "60.7g", "Sugars": "7.1g", "Protein": "37.8g", "Salt": "1.2g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Chicken rice bowl.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}