{"title": "Chicken pot roast with bacon, tarragon and grapes", "tags": null, "planning": {"prep_time": "PT15 minutes, plus restingM", "cook_time": "PT1 hour 45 minutesM", "total_time": "PT2 hours, plus restingM", "serves": "6"}, "ingredients": [{"item": "200g smoked bacon lardons"}, {"item": "1-2 tbsp vegetable oil"}, {"item": "1.5kg Waitrose & Partners No.1 Corn Fed Free Range Whole Chicken"}, {"item": "5 echalion shallots, halved"}, {"item": "7 tarragon sprigs"}, {"item": "500g Heston from Waitrose & Partners Chicken Stock"}, {"item": "200ml dry white wine"}, {"item": "300g red seedless grapes, stalks discarded"}], "instructions": [{"step": "Preheat the oven to 160˚C, gas mark 3. Heat a large fl ameproof casserole dish over a medium heat and dry-fry the bacon for 10 minutes, stirring occasionally, until golden. Scoop onto a plate, leaving the fat behind; set aside."}, {"step": "Turn up the heat slightly; add 1 tbsp oil to the dish. Season the chicken, then add it breast-side down so it’s leaning on one side. Fry for 20 minutes, turning every 5 minutes, until deep golden all over (add more oil, if needed) – you want it nicely browned, so take your time. Lift the chicken onto a plate; set aside."}, {"step": "Put the shallots in the dish; fry for 2 minutes. Add 6 sprigs of tarragon, the crispy bacon, stock and wine. Simmer for 1 minute, scraping up any golden bits from the base. Sit the chicken on top, breast-side up; cover and roast in the oven for 40 minutes, making sure the juices run clear and there is no pink meat. Add the grapes and roast, uncovered, for a further 20 minutes."}, {"step": "Transfer the chicken to a plate and rest under a loose sheet of foil for at least 15 minutes. Pour the liquid through a sieve into a large pan. Discard the tarragon sprigs and arrange the bacon and shallot mixture on a serving plate; keep warm. Bring the sauce to the boil; bubble until reduced by 1 /3 (about 10 minutes). Sit the chicken on top of the bacon and shallot mixture; scatter with the remaining tarragon leaves, torn. Serve with the sauce and some mashed potato, if liked."}], "nutrition": {"Energy": "1,709kJ 391kcals", "Fat": "18.3g", "Saturated Fat": "5.5g", "Carbohydrate": "9.1g", "Sugars": "8.9g", "Protein": "40.8g", "Salt": "1.61g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Chicken-pot-roast.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}