{"title": "Chicken tikka pancakes with mango chutney", "tags": [{"tag": "Low Fat"}], "planning": {"prep_time": "PT30M", "cook_time": "PT20M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "125g plain flour"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "300ml semi-skimmed milk"}, {"item": "1 green chilli, deseeded and finely chopped"}, {"item": "1 tsp ground cumin"}, {"item": "2 tbsp sunflower oil"}, {"item": "2 x 300g packs Waitrose British Chicken Breast Chunks In A Spiced Tikka Marinade"}, {"item": "4 salad onions, sliced"}, {"item": "4 tbsp Geeta’s Premium Mango Chutney"}, {"item": "4 tbsp low fat Greek yogurt"}], "instructions": [{"step": "Sift the flour and a pinch of salt together into a bowl. Make a well in the centre and add the egg and half the milk. Whisk together well then stir in the rest of the milk to make a smooth batter. Stir in the chilli and cumin, and set aside for 30 minutes."}, {"step": "Reserve 1 tbsp of the oil, then heat a little of the remaining oil in an 18cm pancake pan or shallow frying pan and add a ladleful of the batter. Swirl it around the pan and cook for 1–2 minutes each side until golden. Transfer to a plate and keep warm. Repeat with the remaining mixture to make 8 pancakes, keeping them warm, separated with sheets of kitchen paper."}, {"step": "Heat the rest of the oil in a large, non-stick frying pan and cook the chicken for 10–12 minutes, turning occasionally, until cooked through with no pink meat. Divide the chicken between the pancakes, putting it on one quarter of the pancake, and top with the salad onions, mango chutney and yogurt. Fold up the pancakes to make parcels, and serve."}], "nutrition": {"Energy": "2,102kJ 499kcals", "Fat": "15.1g", "Saturated Fat": "3.6g", "Carbohydrate": "41.9g", "Sugars": "14.3g", "Protein": "48.9g", "Salt": "1.1g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/chicken_tikka_chutney_pancakes.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}