{"title": "Chicken pot pie", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT135M", "total_time": "PT145M", "serves": "6 - 8"}, "ingredients": [{"item": "1 Duchy Organic Free Range British Whole Chicken (1.3kg-1.4kg)"}, {"item": "½ lemon"}, {"item": "3 cloves garlic, bashed with skin left on"}, {"item": "¼ x 20g pack thyme"}, {"item": "1 bay leaf"}, {"item": "1 tbsp olive oil"}, {"item": "For the filling"}, {"item": "70g unsalted butter"}, {"item": "2 large leeks, cut into half-moon slices"}, {"item": "75ml white wine"}, {"item": "150g frozen petits pois, defrosted"}, {"item": "40g plain flour"}, {"item": "400ml whole milk"}, {"item": "200ml chicken stock"}, {"item": "2½ tsp Dijon mustard"}, {"item": "¼ x 20g pack tarragon, finely chopped"}, {"item": "½ lemon, finely grated zest, or more to taste"}, {"item": "320g pack all-butter ready-rolled puff pastry sheet"}, {"item": "1 British Blacktail Medium Free Range Egg, beaten"}, {"item": "Green veg such as wilted greens or Tenderstem broccoli, to serve"}], "instructions": [{"step": "Preheat the oven to 200ºC, gas mark 6. Put the chicken into a roasting tin, squeeze the lemon over it, then put it into the cavity with the garlic, thyme and bay leaf. Drizzle over the oil and season. Roast for 25 minutes. Reduce the oven temperature to 180ºC, gas mark 4 and continue to cook for 50 minutes-1 hour, or until thoroughly cooked, the juices run clear and there’s no pink meat. Set aside to cool on a plate. Pour any excess fat from the tray juices and reserve the juices for the filling."}, {"step": "Meanwhile, for the filling, melt 30g butter in a frying pan, then add the leeks and fry until softening and starting to colour. Add the wine and allow to evaporate, then tip into a 30x20cm ceramic or metal oven dish and set aside. Scatter over the petits pois."}, {"step": "Wipe the frying pan with kitchen paper before returning to the heat. Add the remaining butter to melt, then stir in the flour and cook for"}, {"step": "2-3 minutes, until a shade darker and smelling nutty. Add the milk and stock, a little at a time, stirring until incorporated. Simmer for 5-10 minutes until thickened. Mix in the mustard, tarragon, lemon zest and reserved tray juices. Season and pour into the dish."}, {"step": "Remove the chicken meat from the bones, add to the vegetables and sauce and mix to combine. Allow the mixture to cool for about 20 minutes. Meanwhile, preheat the oven to 200ºC, gas mark 6. Unroll the pastry onto the top of the oven dish, crimp the edges with a fork and make a couple of air holes in the middle with the tip of a knife, before placing onto a baking tray. Brush with beaten egg, then bake for about 40-45 minutes until the pastry is puffed and golden. Serve with wilted greens and steamed Tenderstem broccoli."}], "nutrition": {"Energy": "2,448kJ 587kcals", "Fat": "35g", "Saturated Fat": "19g", "Carbohydrate": "34g", "Sugars": "7.5g", "Protein": "31g", "Salt": "1.6g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/20200909_Waitrose-Weekend_SR201817_WK522_Weekend-Cooking_Chicken-Pot-Pie_218292.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}