{"title": "Chicken schnitzel with sweet and sour cabbage", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT25M", "total_time": "PT40M", "serves": "1"}, "ingredients": [{"item": "2 chicken breasts"}, {"item": "35g panko breadcrumbs"}, {"item": "50g essential plain flour"}, {"item": "1 egg"}, {"item": "1 essential baking potato (about 225g)"}, {"item": "1 tsp unsalted butter"}, {"item": "1 tbsp semi-skimmed milk"}, {"item": "2 tsp olive oil"}, {"item": "1 tsp caraway seeds"}, {"item": "¼ essential white cabbage, cored and shredded"}, {"item": "2 tsp white wine vinegar"}, {"item": "1½ tsp caster sugar"}, {"item": "½ x 20g pack dill, fronds chopped, a few reserved"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. Put each chicken breast between 2 pieces of baking parchment and bash with a rolling pin until evenly flattened and about 1cm thick. Tip the breadcrumbs onto a plate and the flour onto another plate; season the flour. Crack the egg into a small bowl and beat with a fork. Dip the chicken in the flour to coat completely, then dip in the egg and finally the breadcrumbs. Chill in the fridge until ready to cook."}, {"step": "Put the whole potato into a pan of boiling salted water. Cook for 20-25 minutes until tender to the point of a knife. Drain, peel, then mash with the butter and milk; season and keep warm."}, {"step": "Meanwhile, heat 1 tsp oil in a frying pan and fry the breaded chicken for 1-2 minutes on each side until golden. Transfer to a baking tray and bake for 15 minutes, until cooked through, the juices run clear and no pink meat remains. Meanwhile, return the frying pan to the heat, add the remaining 1 tsp oil, the caraway seeds and cabbage; season. Fry, stirring, for 5 minutes, until the cabbage has softened a little. Add the vinegar, sugar and 5 tbsp water; cook for 2 minutes, then stir through the dill. Set aside and chill 1 chicken breast; serve the other with the mashed potato and sweet and sour cabbage, sprinkled with the reserved dill fronds."}], "nutrition": {"Energy": "2,927kJ 696kcals", "Fat": "20g", "Saturated Fat": "5.7g", "Carbohydrate": "79g", "Sugars": "16g", "Protein": "45g", "Salt": "0.6g", "Fibre": "9.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/chicken-schnitzel.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}