{"title": "Chicken and bulgar wheat Waldorf salad with dill and poppy seed yogurt", "tags": null, "planning": {"prep_time": "PT35 minutes, plus soakingM", "cook_time": "PT1 hour 20 minutesM", "total_time": "PT1 hour 55 minutes, plus soakingM", "serves": "6"}, "ingredients": [{"item": "3 lemons"}, {"item": "1.2kg chicken"}, {"item": "3 tbsp rapeseed oil"}, {"item": "300g bulgar wheat"}, {"item": "100g walnuts, roughly chopped"}, {"item": "200g seedless green grapes, halved"}, {"item": "2 celery sticks, shaved into ribbons with a vegetable peeler"}, {"item": "bunch salad onions, finely chopped"}, {"item": "2 x 20g packs dill, roughly chopped"}, {"item": "1 tbsp cider vinegar"}, {"item": "2 tbsp clear honey"}, {"item": "2 tsp dijon mustard"}, {"item": "300ml Greek yogurt"}, {"item": "1 tbsp poppy seeds"}, {"item": "2 small cox or egremont russet apples (or use jazz or tentation later in the year), cored and thinly sliced"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Zest 1 lemon and rub the zest over the chicken with 1 tbsp oil; season. Put the zested lemon in the cavity of the chicken, set in a roasting tin, breast-side down, and roast for 1 hour 20 minutes, turning halfway to breast-side up, until the juices run clear."}, {"step": "Meanwhile, put the bulgar wheat in a large bowl and pour over 300ml boiling water. Leave to soak for about 15 minutes, then fluff up the grains with a fork. Add the walnuts, grapes, celery, salad onions and  the dill; toss together."}, {"step": "Zest and juice the remaining 2 lemons. For the dressing, mix the lemon zest with  the lemon juice, the remaining 2 tbsp oil, the vinegar, honey and mustard; season. For the poppy seed yogurt, mix the remaining lemon juice and dill with the yogurt and poppy seeds; chill until ready to serve."}, {"step": "When the chicken is cooked, remove the whole lemon from the cavity. Holding it over the bowl of dressing, cut it in half and scoop out the flesh; discard the skin. Remove any pips, then mash it into the dressing and whisk in any roasting juices from the chicken."}, {"step": "Shred the chicken and any crispy skin, discarding the bones, then add to the bulgar wheat. Add the apples and dressing, season, then toss everything together. Tip onto a platter and serve with the dill and poppy seed yogurt."}], "nutrition": {"Energy": "2,924kJ 697kcals", "Fat": "32.2g", "Saturated Fat": "5.4g", "Carbohydrate": "58.4g", "Sugars": "21.5g", "Protein": "43.5g", "Salt": "0.8g", "Fibre": "6.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/WKApples_Waldorf_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}