{"title": "Chicken, quinoa and red pepper salsa wraps", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 chicken breasts"}, {"item": "200g LOVE life quinoa"}, {"item": "4 outer leaves of a pointed cabbage"}, {"item": "3 tbsp chopped basil"}, {"item": "2 salad onions, finely chopped"}, {"item": "16 sugar snap peas, halved lengthways"}, {"item": "1 red pepper, deseeded and thinly sliced"}, {"item": "2 red peppers"}, {"item": "1½ tbsp olive oil"}, {"item": "1 onion, finely chopped"}, {"item": "2 garlic cloves, finely chopped"}, {"item": "1 red chilli, finely chopped"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. Put the chicken breasts in a deep ovenproof dish, cover with just-boiled water and cook in the oven for 30 minutes. Check the chicken is cooked through and no pink meat remains, then transfer to a plate and leave to cool."}, {"step": "Meanwhile, for the salsa, put the peppers on a foil-lined baking tray and drizzle with 1 tbsp olive oil. Roast for 30 minutes, until blackened slightly."}, {"step": "Cook the quinoa according to pack instructions; drain and set aside to cool."}, {"step": "Put the cabbage leaves in a large bowl, cover with just-boiled water and leave for 2 minutes. Remove and pat dry with kitchen paper. Cut away the woody end of the stems; set aside."}, {"step": "To finish the salsa, heat the remaining oil in a pan. Fry the onion for 5 minutes until softened, then add the garlic and chilli and cook for 1 minute more; season. Peel the skin from the cooled pepper and discard it along with the seeds. Put the flesh in the small bowl of a food processor along with the onion mixture. Blitz until smooth, then stir 2/3 of the mixture into the quinoa, along with the basil and salad onions. Set the remaining salsa aside."}, {"step": "Slice the poached chicken into long strips, season and set aside with the sugar snap peas and red pepper."}, {"step": "Now start rolling. Take a cabbage leaf and spread about 1/4 of the quinoa evenly over it, leaving a 2cm border around the edges. Spoon a little of the remaining salsa down the centre, then a few strips of chicken, sugar snaps and red pepper. Firmly roll each cabbage leaf around the filling, tucking the edges in. Repeat with the remaining ingredients to make 4 rolls."}, {"step": "If you are eating straight away, slice the roll down the middle. If you are preparing it for lunch the next day, wrap in clingfilm and refrigerate overnight."}], "nutrition": {"Energy": "1640.128kJ 392kcals", "Fat": "10g", "Saturated Fat": "1.5g", "Carbohydrate": "48.1g", "Sugars": "13g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Picture 1212.png/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}