{"title": "Chilli-roasted squash with mushroom rice & cucumber", "tags": null, "planning": {"prep_time": "PT20 minutesM", "cook_time": "PT35-40 minutesM", "total_time": "PT1 hourM", "serves": "4"}, "ingredients": [{"item": "1 tsp light soy sauce"}, {"item": "1 tsp groundnut oil, plus extra for frying"}, {"item": "1/2 tsp chilli flakes"}, {"item": "1 tsp sesame seeds"}, {"item": "1 butternut squash, cut into 8 pieces, seeds removed"}, {"item": "For the rice"}, {"item": "40g piece ginger, peeled and finely chopped"}, {"item": "1 large clove garlic, sliced"}, {"item": "200g mix shiitake, oyster or chestnut mushrooms, sliced"}, {"item": "1 x 15g sachet instant brown miso soup paste, or 11/2 tbsp brown miso paste"}, {"item": "400g short grain white rice"}, {"item": "For the cucumber"}, {"item": "1 cucumber, peeled"}, {"item": "Juice of 1 lime"}, {"item": "1/2 tsp toasted sesame oil"}, {"item": "1 tsp Chinese rice vinegar"}, {"item": "Pickled ginger and 1 lime, cut into wedges, to serve"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. In a casserole, mix together the soy sauce, oil, chilli flakes, sesame seeds and squash and season with a little salt and pepper. Roast in the oven for 35-40 minutes until golden and tender."}, {"step": "Meanwhile, fry the ginger, garlic and mushrooms in a little more oil until sizzling and golden, then add the miso and rice. Toast the rice, stirring, for a minute, then add 600ml water. Bring to the boil, cover with a lid and turn down the heat. Leave for 20 minutes, then remove the lid and fork through the rice. Don’t be tempted to remove the lid during cooking – you want the steam to cook the rice completely."}, {"step": "While the rice is cooking, prepare the cucumber. Halve the cucumber lengthways and remove the seeds with a teaspoon. Bash the cucumber with a rolling pin so it breaks into rough 3cm pieces. (You can chop it if you prefer.) Dress the cucumber in the lime juice, a pinch of salt, sesame oil and rice vinegar."}, {"step": "Serve the rice, roasted squash and cucumber in four bowls with pinches of pickled ginger and wedges of lime."}], "nutrition": {"Energy": "3,208kJ 769kcals", "Fat": "47g", "Saturated Fat": "17g", "Carbohydrate": "46g", "Sugars": "1.1g", "Protein": "38g", "Salt": "0.6g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Chilliroastedsquashwithmushroomriceandcucumber.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}