{"title": "Chilli cashew ‘cheese’ & pesto wheel", "tags": [{"tag": "Vegetarian"}, {"tag": "Vegan"}], "planning": {"prep_time": "PT15 minutes + chillingM", "cook_time": "PT10M", "total_time": "PT25 minutes + chillingM", "serves": "6"}, "ingredients": [{"item": "200g cashew nuts"}, {"item": "2 tsp garlic granules"}, {"item": "3 tbsp lemon juice"}, {"item": "1 tsp salt"}, {"item": "¼ tsp black pepper"}, {"item": "For the garnish"}, {"item": "¼ tsp black peppercorns"}, {"item": "1 tsp pink peppercorns"}, {"item": "¼ tsp chilli flakes, plus extra to taste"}, {"item": "2 tbsp chopped flat leaf parsley"}, {"item": "¾ x 145g tub The Happy Pear Lovely Basil Pesto"}, {"item": "Extra virgin olive oil, for drizzling"}], "instructions": [{"step": "To make the cheese, place the cashew nuts in a saucepan and cover with boiling water. Simmer for 10 minutes to soften. Drain and rinse under cold water. Put the cashews in a blender or food processor with 50ml water, garlic granules, lemon juice and seasoning. Blend until really smooth, then with the motor running, trickle in up to 50ml more water until you have a thick cream cheese texture. Use a spatula to scrape down the sides during blending if needed."}, {"step": "Line a small round springform tin or bowl approximately 12-13cm in diameter with clingfilm, allowing enough to overhang to cover the cheese once the tin or bowl is filled. Crush the black and pink peppercorns."}, {"step": "Sprinkle the chilli flakes and peppercorns on the base of the tin or dish along with some chopped parsley. Press half the cashew cheese firmly into the tin or bowl. Spread all the pesto gently over the top, followed by the remaining cashew cheese. Spread to level the surface, then fold the overhanging clingfim over the top and leave to chill in the fridge for 1-2 hours until firm."}, {"step": "Invert the pan or tin onto a small plate or board and remove the clingfilm. Drizzle with a little oil and some more parsley and chilli flakes so there is a good crust. Serve with crusty bread or crackers."}], "nutrition": {"Energy": "1,372kJ 331kcals", "Fat": "29g", "Saturated Fat": "5.1g", "Carbohydrate": "8.2g", "Sugars": "2.1g", "Protein": "8.7g", "Salt": "1g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/ChilliCashewCHeese.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}