{"title": "Chilli bean pie", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT1 hour 5 minutesM", "total_time": "PT1 hour 25 minutesM", "serves": "6"}, "ingredients": [{"item": "1 dried ancho chilli"}, {"item": "2 tbsp essential olive oil"}, {"item": "1 onion, chopped"}, {"item": "1 red pepper, cut into bite-sized pieces"}, {"item": "2 garlic cloves, crushed"}, {"item": "1 tsp Bart Blends fajita spice (or 2 tsp if you like it hot)"}, {"item": "2 x 400g cans plum tomatoes"}, {"item": "2 x 400g cans black beans, 1 undrained"}, {"item": "750g (1 medium) essential swede, peeled and cut into chunks"}, {"item": "280g (1 medium) potato, peeled and cut into chunks"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. Put the ancho chilli in a small bowl and cover with boiling water. Set aside to soak for 10 minutes."}, {"step": "Heat 1 tbsp oil in a large frying pan over a medium heat. Cook the onion with a pinch of salt for 5 minutes, until starting to soften. Add the pepper and garlic; cook for another 6-8 minutes, adding the fajita spice blend for the last 2 minutes. Finely chop the soaked ancho chilli (or whizz it in a mini blender with 1 tbsp of the soaking liquid). Add the tomatoes to the pan, mash a little with a wooden spoon; add the black beans (including the liquid from 1 can) and chopped chilli. Simmer for 15-20 minutes until thickened, season."}, {"step": "Meanwhile, cover the swede and potato with cold water in a medium pan, add a pinch of salt and cover with a lid. Bring to the boil then simmer for 15 minutes, until soft. Drain, then return the swede and potato to the pan. Mash with a potato masher, stir in the remaining 1 tbsp oil and season."}, {"step": "Pour the bean mixture into an ovenproof dish (about 1.8 litres in volume) and top with the swede mash. Bake for 25-30 minutes until the top is crisp and golden. Served with steamed Tenderstem broccoli, if liked."}], "nutrition": {"Energy": "1,264kJ 301kcals", "Fat": "6.8g", "Saturated Fat": "1g", "Carbohydrate": "37g", "Sugars": "20g", "Protein": "14g", "Salt": "0.8g", "Fibre": "16g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Chilli-bean-pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}