{"title": "Ching-He Huang's Zhajiang noodles", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2"}, "ingredients": [{"item": "2 tablespoons rapeseed oil"}, {"item": "1 tablespoon finely chopped garlic"}, {"item": "1 tablespoon finely chopped root ginger"}, {"item": "2 tablespoons diced baby leeks"}, {"item": "1 teaspoon Sichuan peppercorns"}, {"item": "200g smoked lardons, finely diced"}, {"item": "1 tablespoon Shaohsing rice wine or dry sherry"}, {"item": "1 tablespoon fragrant oil (see tip)"}, {"item": "1 teaspoon dark soy sauce"}, {"item": "150ml hot chicken or pork stock"}, {"item": "1 tablespoon tian mian jiang or hoisin sauce"}, {"item": "1 tablespoon yellow bean paste or miso paste"}, {"item": "1 tablespoon sesame oil"}, {"item": "1 teaspoon dried chilli sauce laced with chilli oil"}, {"item": "200g plain wheat flour or egg noodles, cooked, drained and tossed with 1 teaspoon toasted sesame oil"}, {"item": "2 small red radishes, sliced into matchsticks"}, {"item": "1/2 cucumber, deseeded and sliced into matchsticks"}, {"item": "1 spring onion, finely chopped"}], "instructions": [{"step": "Start with the noodles. Divide the sesame oil and chilli sauce between two serving bowls. Place the cooked noodles in the bowls, toss in the oil and sauce and set aside."}, {"step": "Heat a wok over a high heat until smoking and add the rapeseed oil. Add the garlic, ginger, leeks and Sichuan peppercorns and toss for a few seconds, then add the lardons and stir-fry for 1 minute. Add the Shaohsing rice wine or dry sherry, the fragrant oil and dark soy sauce and stir-fry for 1 minute. Add the stock, tian mian jiang or hoisin sauce and the yellow bean paste or miso and toss together well. Cook for 2 minutes, stirring until the pork is cooked."}, {"step": "Divide the pork mixture between the two bowls of noodles and garnish with the radish and cucumber matchsticks. Sprinkle with the spring onion and serve immediately. To eat, toss and mix all the ingredients together well."}, {"step": "Heat 5 tablespoons of groundnut oil. Add a pinch of salt, 1 tablespoon grated ginger and 1 tablespoon finely chopped spring onion, cook for 1 minute then strain the oil into a glass jar. Keep for 5 days in a cool place."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Zhajiang-smoky-bacon-noodles.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}