{"title": "Ching-He Huang's fish fragrant chicken and aubergine", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2"}, "ingredients": [{"item": "200g boneless chicken thighs, sliced into 1cm strips"}, {"item": "pinch of sea salt flakes"}, {"item": "pinch of ground white pepper"}, {"item": "1 teaspoon cornflour"}, {"item": "2 tablespoons rapeseed oil"}, {"item": "200g aubergine, sliced into batons"}, {"item": "2 garlic cloves, crushed and finely chopped"}, {"item": "2.5cm piece of fresh root ginger, peeled and grated"}, {"item": "1 medium red chilli, deseeded and finely chopped"}, {"item": "1 tablespoon chilli bean sauce"}, {"item": "1 tablespoon Shaohsing rice wine or dry sherry"}, {"item": "1 spring onion, finely sliced, to garnish"}, {"item": "100ml cold vegetable stock"}, {"item": "1 tablespoon low-sodium light soy sauce"}, {"item": "1 tablespoon Chinkiang black"}, {"item": "rice or balsamic vinegar"}, {"item": "1 tablespoon cornflour"}], "instructions": [{"step": "Place the chicken in a bowl and season with the salt, white pepper and cornflour and stir to combine. Whisk together all the ingredients for the sauce in a jug, then set aside."}, {"step": "Heat a wok over a high heat and, as the wok starts to smoke, add 1 tablespoon rapeseed oil. Add the aubergine and stir-fry for 5 minutes until softened and brown. During this process, keep adding the 50ml of water in small drops around the edge of the wok to create some steam to help cook and soften the aubergine."}, {"step": "When soft and cooked, transfer to a plate and set aside. Return to the heat and add another tablespoon of rapeseed oil. Add the garlic, ginger, chilli and chilli bean sauce and cook together for a few seconds. Add the chicken strips and cook for 1 minute until they start to turn brown and opaque, then season with the Shaohsing rice wine or dry sherry and stir-fry for 3 minutes until the chicken is cooked all the way through."}, {"step": "Return the aubergines to the wok, pour in the sauce and simmer on a medium heat for 3 minutes. Sprinkle the spring onion over and serve immediately."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Fish-fragrant-chicken-aubergine.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}