{"title": "Chocolate and salted peanut cookies", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "24"}, "ingredients": [{"item": "200g dark chocolate, chopped"}, {"item": "75g unsalted butter, at room temperature"}, {"item": "110g essential Waitrose smooth peanut butter"}, {"item": "50g caster sugar"}, {"item": "200g light brown soft sugar"}, {"item": "2 eggs"}, {"item": "1 egg yolk"}, {"item": "150g plain flour"}, {"item": "1 tbsp cocoa powder"}, {"item": "11⁄2 tsp baking powder"}, {"item": "1 tbsp whole milk"}, {"item": "100g Waitrose Cooks’ Homebaking white chocolate chunks"}, {"item": "50g salted peanuts, roughly chopped"}, {"item": "50g icing sugar"}], "instructions": [{"step": "Melt the dark chocolate in a heatproof bowl set over a pan of barely simmering water, stirring until smooth. Remove from the heat and cool for 2-3 minutes."}, {"step": "Using electric beaters, cream the butter with 50g peanut butter and both sugars until smooth. Gradually add the eggs and egg yolk and mix again until smooth, scraping down the sides of the bowl with a rubber spatula from time to time. Mix in the melted chocolate."}, {"step": "Sift the flour, cocoa and baking powder into the bowl, add the milk and mix again until smooth. Fold in the chocolate chunks and peanuts, cover the mixture and leave to firm up in a cool place for about 1 hour (or chill for 30 minutes)."}, {"step": "Preheat the oven to 180 ̊C, gas mark 4 (or 160 ̊C, gas mark 3 if cooking from frozen); line 2 large baking sheets with parchment. Reserve 2 heaped tbsp of cookie dough, and roll the remainder into 24 walnut sized balls, making sure that the chocolate chips and peanuts are evenly distributed."}, {"step": "Press your thumb into the middle of each ball to make a deep indent; ll it with 1⁄2 tsp of the reserved peanut butter. Cover with a nugget of the reserved cookie dough and roll into a ball to seal. (The cookies can be frozen at this stage.)"}, {"step": "Roll the dough balls in icing sugar until thickly and evenly coated, then arrange on the baking sheets, leaving plenty of space for them to spread. Bake in batches, on the middle shelf of the oven, for 14 minutes (or 20 minutes at the lower heat from frozen) until firm but still a little soft in the middle. Cool on the trays for 5 minutes; transfer to a wire rack to cool completely."}], "nutrition": {"Energy": "932kJ 223kcals", "Fat": "12g", "Saturated Fat": "5.9g", "Carbohydrate": "24.7g", "Sugars": "18.3g", "Protein": "4g", "Salt": "0.2g", "Fibre": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/161125_005_Cookies-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}