{"title": "Chocolate orange bundt cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT1 hour 20 minutesM", "total_time": "PT1 hour 45 minutes, plus coolingM", "serves": "14"}, "ingredients": [{"item": "300g Menier Swiss Dark Chocolate"}, {"item": "300g plain flour"}, {"item": "1 tsp baking powder"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "375g light brown soft sugar"}, {"item": "1 tsp flaky sea salt"}, {"item": "300ml soured cream"}, {"item": "250ml sunflower oil"}, {"item": "3 large British Blacktail Free Range Eggs, beaten"}, {"item": "3 large oranges, zest of all, 2 tbsp juice"}, {"item": "For the drizzle"}, {"item": "50g unsalted butter"}, {"item": "1 tbsp light brown soft sugar"}, {"item": "100g Menier Swiss Dark Chocolate, broken into pieces"}, {"item": "30ml double cream"}, {"item": "½ tsp flaky sea salt"}, {"item": "Candied orange"}, {"item": "30g caster sugar"}, {"item": "1 orange, zest of all in fine strips, 2 tbsp juice"}, {"item": "flaky sea salt, to serve"}], "instructions": [{"step": "Thoroughly grease and flour a 2.4 litre bundt tin. Preheat the oven to 200˚C, gas mark 6. Melt the chocolate in a heatproof bowl over a pan of barely simmering water or in the microwave. Sift the flour, baking powder, bicarbonate of soda and light brown soft sugar into a large bowl. Add the salt, crumbling it with your fingers."}, {"step": "In a measuring jug or a separate clean bowl, combine the soured cream, sunflower oil and eggs. Add the orange zest and juice. Add the wet mixture to the dry then pour in the chocolate. Beat together using a balloon whisk. Pour into the tin and bake"}, {"step": "for 50 minutes-1 hour (covering after 45 minutes if it browns too quickly), until a skewer inserted into the cake comes out clean. Leave in the tin for 20 minutes before carefully turning the cake out onto a wire rack to cool completely."}, {"step": "To make the chocolate drizzle, melt the butter and sugar in a pan over a low heat, until the sugar dissolves. Add the chocolate and stir until melted, then remove from the heat and stir in the cream and salt. Allow to cool for 20 minutes."}, {"step": "Meanwhile, make the candied orange. Line a tray with baking parchment. In a small pan, combine the caster sugar, orange zest and juice. Put over a low heat to dissolve the sugar then increase the heat and bubble for a few minutes, until the syrup is thick and of a coating consistency. Turn off the heat and use a fork to carefully lift the zest out onto the parchment. When the drizzle has cooled but is still runny, drizzle it over the cooled cake. Top the cake with  the orange zest, scattering with extra sea salt flakes, if liked."}], "nutrition": {"Energy": "2,711kJ 651kcals", "Fat": "43g", "Saturated Fat": "15g", "Carbohydrate": "56g", "Sugars": "38g", "Protein": "7.4g", "Salt": "0.8g", "Fibre": "5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/250620_Waitrose_Baking_Chocolate-Orange-Bundt-Cake_EXT.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}