{"title": "Chocolate-dipped sea salt and rye digestives", "tags": null, "planning": {"prep_time": "PT30 minutes, plus chilling and coolingM", "cook_time": "PT40M", "total_time": "PT70 minutes, plus chilling and coolingM", "serves": "About 24 biscuits"}, "ingredients": [{"item": "240g dark rye flour, plus extra for rolling"}, {"item": "1 tsp baking powder"}, {"item": "1⁄2 tsp fine salt"}, {"item": "200g golden icing sugar"}, {"item": "100g unsalted butter, at room temperature"}, {"item": "75-90ml double cream"}, {"item": "250g milk chocolate"}, {"item": "Flaky sea salt, to sprinkle"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4. Line 2-3 large baking trays with baking parchment. Put the flour, baking powder, salt, icing sugar and butter in a large bowl, mixing with a fork (or a food processor) to create a sandy texture. Mix in 75ml cream until it starts to come together; you may need an extra 15ml if it’s dry. Knead brie y to a rough dough; don’t overmix."}, {"step": "Liberally pour the worktop and roll the dough out to a thickness of 0.4cm. Using a 7cm cutter, stamp out rounds and place on the prepared trays, about 4cm apart; re-roll any trimmings to create about 24 biscuits. Use a bamboo skewer or fork to make deep indentations in the biscuits. Chill for 20 minutes."}, {"step": "Bake from chilled, in batches, for 20 minutes, until golden. Leave on the tray for a few minutes, then transfer to a wire rack and leave to cool completely."}, {"step": "Melt the chocolate in a heatproof bowl set over a pan of barely simmering water. Half-dip the biscuits in the chocolate, let the excess drip off, then lay on fresh parchment. Sprinkle with the salt; leave to set for 30-40 minutes. They can be stored in an airtight container for up to 1 week."}], "nutrition": {"Energy": "728kJ 174kcals", "Fat": "8.5g", "Saturated Fat": "5.2g", "Carbohydrate": "22.6g", "Sugars": "14.7g", "Protein": "1.7g", "Salt": "0.3g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/digestive-biscuits_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}