{"title": "Chocolate rye crackle cookies", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "20"}, "ingredients": [{"item": "100g dark chocolate"}, {"item": "(80-85% cocoa), chopped"}, {"item": "180g dark rye flour"}, {"item": "30g cocoa powder"}, {"item": "½ tsp baking powder"}, {"item": "¼ tsp bicarbonate of soda"}, {"item": "¼ tsp flaky sea salt"}, {"item": "120g unsalted butter, softened"}, {"item": "80g golden caster sugar"}, {"item": "80g dark brown soft sugar"}, {"item": "1 egg"}, {"item": "40g golden syrup"}, {"item": "30g milk chocolate, chopped"}], "instructions": [{"step": "Put 70g dark chocolate in a heatproof bowl, then melt over a pan of barely simmering water, ensuring the bowl is not touching the water; set aside. In another bowl, combine the flour, cocoa, baking powder, bicarbonate and salt; set aside."}, {"step": "Using electric beaters, cream the butter and sugars in a large bowl until light and fluffy (about 4 minutes). Add the melted chocolate, egg and syrup; beat for about 2 minutes, until combined and fluffy. Fold in the flour mixture followed by the remaining 30g chopped dark chocolate and the milk chocolate."}, {"step": "Put heaped tablespoon-sized scoops of the cookie dough on a board or plate that will fit in your fridge; chill for 15 minutes. Line 2 large baking trays with parchment. Preheat the oven to 180˚C, gas mark 4. With your hands, roll each scoop of cookie dough into a neat ball. Divide the cookie dough balls between the trays, making sure they are evenly spaced out, and bake for 10 minutes. Swap the trays and cook for 5 minutes more. Leave on the trays to cool for 2 minutes, then transfer to a wire rack. Enjoy warm or leave to cool completely."}], "nutrition": {"Energy": "673kJ 161kcals", "Fat": "8.7g", "Saturated Fat": "5.2g", "Carbohydrate": "18g", "Sugars": "11g", "Protein": "2g", "Salt": "0.2g", "Fibre": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/210120_WaitroseChocolate_Choc-Chip-Cookies.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}