{"title": "Chocolate pistachio torte", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": null}, "ingredients": [{"item": "100g pack pistachio nuts"}, {"item": "200g bar Waitrose Belgian White Chocolate, chopped"}, {"item": "450ml essential Waitrose Double Cream"}, {"item": "250g tub ricotta cheese"}, {"item": "2 tsp vanilla bean paste or extract"}, {"item": "330g Waitrose Double Chocolate Loaf"}, {"item": "3 tbsp Kirsch, optional"}, {"item": "200g bar Waitrose Continental Plain Chocolate, chopped"}, {"item": "2 tbsp golden syrup"}], "instructions": [{"step": "Put the nuts in a heatproof bowl and cover with boiling water. Leave to stand for 30 seconds, then drain well and tip the nuts onto several sheets of kitchen paper. Cover with more layers of paper and rub under the palms of your hands to release the skins. Peel away the skins. (Don’t worry about removing every last little bit of skin, though.) Roughly chop the nuts, either by hand or in a food processor.  Put the white chocolate and 100ml of the cream in a heatproof bowl over a pan of gently simmering water. Leave until melted, stirring occasionally. Remove from the heat and beat in the ricotta and vanilla.  Slice the cake as thinly as possible. You’ll need at least 21 slices but it doesn’t matter if they break up slightly. Arrange a third of the slices in a base-lined 20cm spring-release or shallow, loose-based cake tin, cutting the slices to fit. Drizzle with 1 tbsp of the Kirsch, if using.  Whip a further 200ml of the cream until firm, and stir into the white chocolate mixture, along with all but 2 tbsp of the nuts. Spread half the mixture in the tin and level the surface. Arrange half the remaining cake slices on top and drizzle with another tbsp of the Kirsch. Spread with the remaining filling, then the remaining cake slices and Kirsch. Cover and chill for at least 2 hours.  Melt the plain chocolate in a heatproof bowl over a saucepan of simmering water. Remove from the heat and add the golden syrup, then the remaining 150ml of cream, stirring until smooth. Leave until cooled but not thickened. Run a knife around the edges of the cake and release the cake from the sides of the tin. Invert onto a serving plate and peel away the lining paper. Spread the chocolate mixture over the top and sides with a palette knife and scatter with the reserved nuts."}], "nutrition": {"Energy": "1502.056kJ 359.0kcal", "Fat": "27.9g", "Saturated Fat": "15.1g", "Sugars": "16.5g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/201004S31r1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}