{"title": "Chocolate chestnut tarts", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes, plus chillingM", "cook_time": "PT30M", "total_time": "PT1 hour 15 minutes, plus chillingM", "serves": "6"}, "ingredients": [{"item": "200g dark chocolate (70% cocoa solids)"}, {"item": "170g unsalted butter, softened"}, {"item": "200g pack chestnut purée"}, {"item": "65g icing sugar"}, {"item": "gold lustre spray/gold leaf (optional)"}, {"item": "Pastry"}, {"item": "150g plain flour, plus extra for dusting"}, {"item": "30g cocoa powder"}, {"item": "1 tbsp caster sugar"}, {"item": "100g unsalted butter, cubed and chilled"}, {"item": "1 egg yolk"}, {"item": "Cream"}, {"item": "200ml double cream"}, {"item": "11/2 tbsp icing sugar"}, {"item": "1 vanilla pod, seeds only"}], "instructions": [{"step": "For the pastry, mix the flour, cocoa powder, sugar and a pinch of fine sea salt in a large bowl. Add the butter and rub in with your fingertips until it resembles breadcrumbs (alternatively, pulse in a food processor). Add the egg yolk and 2 tbsp cold water. Using a blunt-edged knife, draw the mixture together. When it starts to clump, bring it together with your hands, adding a sprinkle of water to any dry patches. Knead lightly into a smooth disc. Wrap and chill for at least 20 minutes."}, {"step": "Preheat the oven to 190˚C, gas mark 5. Put 6 x 8cm fluted tart cases on a baking sheet. On a lightly floured surface, roll out the pastry to 0.3cm thick. Use a small bowl (about 12-13cm diameter) to cut out 6 circles (you’ll need to re-roll). Carefully line each case, letting any excess hang over the sides. Prick the bases, then line with baking parchment and fill with baking beans. Bake for 15-18 minutes, until the edges are dry, then remove the parchment and beans; bake for 5 minutes more, until the bases feel dry and sandy. Allow to cool to room temperature in the tins, then cut off the excess pastry with a serrated knife."}, {"step": "Melt the chocolate and butter in a heatproof bowl over a pan of barely simmering water until smooth and combined; allow to cool a little. In another bowl, use a wooden spoon to beat the chestnut purée and icing sugar until smooth (add 1 tbsp boiling water, if needed, to loosen). Fold in the chocolate mixture with a pinch of fine salt until smooth. Spoon into the cases and chill for at least 2 hours."}, {"step": "To serve, whip the cream, icing sugar and vanilla seeds to soft peaks. Remove the tarts from their tins, top each with a dollop of cream and dust with gold lustre spray or scatter over gold leaf, if liked."}], "nutrition": {"Energy": "3,711kJ 895kcals", "Fat": "71g", "Saturated Fat": "44g", "Carbohydrate": "52g", "Sugars": "27g", "Protein": "8.9g", "Salt": "0.5g", "Fibre": "6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Chocolate-chestnut tarts-250920_193.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}