{"title": "Chocolate cherry tarts", "tags": null, "planning": {"prep_time": "PT30 minutes, plus chillingM", "cook_time": "PT10M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "100g blanched hazelnuts"}, {"item": "2 tbsp cacao powder"}, {"item": "2 tbsp maple syrup"}, {"item": "1 tbsp coconut oil, melted"}, {"item": "Pinch sea salt"}, {"item": "150ml maple syrup"}, {"item": "6 tbsp cacao powder"}, {"item": "4 tbsp coconut oil, melted"}, {"item": "4 tbsp black cherry preserve"}, {"item": "Pinch sea salt"}, {"item": "4 glacé cherries"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. For the tart crust, tip the hazelnuts onto a roasting tray and roast for 6-8 minutes until golden; set aside to cool completely. Once cool tip the nuts into the bowl of a food processor and whizz, pulsing until just finely ground, (take care not to over-blend or the nuts will release too much oil). Tip in the cacao and pulse again until combined, then add the maple syrup, coconut oil and a pinch of sea salt. Pulse until just combined."}, {"step": "Line 4 x 9cm tart tins with a large square of clingfilm and press a quarter of the tart crust into each, using oiled fingertips to evenly cover the base and sides. Chill for at least 2 hours."}, {"step": "Spread 1 tbsp cherry conserve over the base of each tart. Next place the maple syrup in a mixing bowl and, with a balloon hand whisk, whisk in the cacao 1 tablespoon at a time. Whisk in the melted coconut oil a little at a time until you have an emulsified mixture. If the mixture is too thick, set the bowl over a pan of simmering water briefly to warm up the mixture.  Stir in a pinch of sea salt, then pour into the tart cases. Top each with a glacé cherry and chill for at least 2 hours or overnight before serving, dusted with a little more cacao powder, if liked."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Chocolate_Cherry_Tarts_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}