{"title": "Chocolate Guinness cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT60M", "total_time": "PT80M", "serves": "10 - 12"}, "ingredients": [{"item": "250ml Guinness"}, {"item": "250g unsalted butter"}, {"item": "100g cocoa powder"}, {"item": "300g caster sugar"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "1 tbsp vanilla essence"}, {"item": "150ml buttermilk"}, {"item": "300g plain flour"}, {"item": "2 tsp bicarbonate of soda"}, {"item": "150g unsalted butter, softened"}, {"item": "150g icing sugar"}, {"item": "½ tsp vanilla essence"}, {"item": "420g full-fat cream cheese (such as Philadelphia)"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3. Line the base and sides of a loose-bottomed, deep, 20cm cake tin."}, {"step": "Pour the Guinness into a medium saucepan with the butter and gently heat until melted. Remove the pan from the heat and stir in the cocoa powder and caster sugar."}, {"step": "Mix the eggs, vanilla essence and buttermilk in a bowl, then add this to the mixture in the pan."}, {"step": "Sift the flour and bicarbonate of soda together into a large bowl or into the bowl of a freestanding electric mixer with a paddle attachment. Using a hand-held electric whisk or the mixer set on a low speed, pour in the contents of the pan. Scrape down the sides"}, {"step": "of the bowl and continue to mix thoroughly until all the ingredients are incorporated."}, {"step": "Pour the mixture into the prepared cake tin and bake for approximately 55-60 minutes or until the sponge bounces back when lightly pressed and a skewer inserted into the centre of the cake comes out clean."}, {"step": "Set aside to cool, then remove from the tin onto a wire rack, making sure the cake is cold to the touch before you frost it."}, {"step": "To make the frosting, use the electric whisk or the freestanding mixer with paddle attachment to mix the butter, icing sugar and vanilla together until it is fully combined in a smooth mixture. Add the cream cheese and mix on a low speed, then increase the speed to medium and beat until the frosting is light and fluffy."}, {"step": "Place the cooled cake on a serving dish and spread the top generously with the vanilla cream cheese frosting."}], "nutrition": {"Energy": "2,623kJ 629kcals", "Fat": "38.9g", "Saturated Fat": "24.3g", "Carbohydrate": "61.8g", "Sugars": "41.7g", "Protein": "7.8g", "Salt": "1.1g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Weekend_WK311_Wkend-Menu_Sunday-Pud_Choc-Guiness-Cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}