{"title": "Chocolate, caramel & chestnut yule log cake recipe | Waitrose", "tags": [{"tag": "Vegetarian"}, {"tag": "Christmas"}], "planning": {"prep_time": "PT1 hour, plus cooling and chillingM", "cook_time": "PT1 hour 20 minutesM", "total_time": "PT2 hour 20 minutes, plus cooling and chillingM", "serves": "12 - 14"}, "ingredients": [{"item": "200g unsalted butter, softened, plus extra for greasing"}, {"item": "600ml single cream"}, {"item": "2 tsp vanilla extract"}, {"item": "600g soft light brown sugar"}, {"item": "200g dark chocolate (70% cocoa solids), chopped"}, {"item": "4 eggs, lightly beaten"}, {"item": "450g plain flour"}, {"item": "1 tsp salt"}, {"item": "2 tsp bicarbonate of soda"}, {"item": "240g can Clement Faugier whole peeled and cooked chestnuts"}, {"item": "75ml whole milk, plus extra if needed"}, {"item": "150g caster sugar"}, {"item": "75ml double cream"}, {"item": "50g salted butter"}, {"item": "large pinch flaky sea salt"}, {"item": "100ml crème fraîche"}, {"item": "450ml double cream"}, {"item": "2 tbsp golden syrup"}, {"item": "240g dark chocolate (70% cocoa solids), finely chopped"}, {"item": "240g milk chocolate, finely chopped"}, {"item": "90g salted butter, softened"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4. Start with the filling. Roast 140g chestnuts for 20 minutes, until dark brown, then set aside to cool on kitchen paper. Simmer the milk and remaining 100g chestnuts in a pan for 2-3 minutes, until soft. Blend in a small food processor to a thick, smooth paste, scraping down the sides and adding a splash more milk, if needed. Cover with cling film and set aside until needed."}, {"step": "Next, in a small pan, heat the caster sugar with 2 tbsp water, until dissolved. Simmer briskly for 4-6 minutes, without stirring, until you have a dark amber caramel (170 ̊C on a sugar thermometer). Turn the heat to low and add the roast chestnuts, swirling the pan to coat them. Using a lightly oiled fork, transfer the chestnuts to a sheet of parchment. Leave for about 1 hour to cool and set hard."}, {"step": "Add the cream and butter to the remaining caramel (take care as it may splutter) and heat gently until dissolved. Bring to a simmer and cook for 2-3 minutes, until thick yet pourable (no more than 112 ̊C). Transfer to a bowl, cool for 15 minutes, then stir in the salt. Cover the surface with cling film, cool and chill."}, {"step": "For the sponge cake, preheat the oven to 180 ̊C, gas mark 4. Grease 2 x deep 20cm sandwich tins and line the bases with baking parchment. Warm the cream, vanilla and 300g brown sugar in a pan, stirring until the sugar has melted, then heat until just steaming. Stir in the chocolate until just melted and set aside."}, {"step": "In a separate bowl, using electric beaters, cream the butter and remaining 300g brown sugar, until light and fluffy. Beat in the eggs, a little at a time, until incorporated, then mix in the melted chocolate mixture. Sift in the flour in stages, mixing as you go, then add the salt and bicarbonate of soda and beat to a smooth batter. Divide between the prepared tins and bake for 45 minutes, or until a skewer inserted into the centre comes out clean. Put the cakes in their tins on a wire rack and leave to cool."}, {"step": "For the milk and dark chocolate ganaches, gently heat the cream, syrup and a pinch of salt in a small pan, until just before boiling. Remove from the heat and divide between 2 separate bowls. Add the dark chocolate to one bowl and the milk chocolate to the other. Stir each until smooth, then mix 45g butter into each. Chill, uncovered, until set but spreadable – about 1 hour 30 minutes."}, {"step": "Reserve 6 caramelised chestnuts and roughly chop the rest. Beat the crème fraîche for the filling with the chestnut purée. Halve each cake horizontally so you have 4 equal layers. Place one on a board and spread with 1/3 of the chestnut crème fraîche, then drizzle with 1/3 of the caramel sauce, and sprinkle over 1/3 of the caramelised chestnuts. Repeat with the second and third layers of cake and filling."}, {"step": "Sit the final layer of sponge on top. Spread the milk chocolate ganache all over the cake using a palette knife, then cover with the dark chocolate ganache (you may not need to use it all). Press the reserved caramelised chestnuts into the sides, then create a streaky bark effect using a fork to marble the two ganaches together. Lightly dust with icing sugar to serve."}], "nutrition": {"Energy": "4,661kJ 1,117kcals", "Fat": "69.6g", "Saturated Fat": "42.7g", "Carbohydrate": "110.4g", "Sugars": "78.7g", "Protein": "12.3g", "Salt": "1.2g", "Fibre": "3.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Log-Cake-Cut_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}