{"title": "Chocolate salami", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2 salami"}, "ingredients": [{"item": "50g sultanas"}, {"item": "75g dried figs, chopped into sultanasized pieces"}, {"item": "2 tablespoons dark rum or amaretto"}, {"item": "150g mixed nuts (50g each of pistachios, blanched almonds and hazelnuts)"}, {"item": "200g dark chocolate, chopped"}, {"item": "75g unsalted butter"}, {"item": "75g caster sugar"}, {"item": "25g soft light brown sugar"}, {"item": "1 large egg plus 1 large egg yolk"}, {"item": "175g plain biscuits (such as amaretti or digestives)"}, {"item": "2 tablespoons icing sugar"}, {"item": "Store"}, {"item": "Chocolate Salami will keep for up to 1 week, well wrapped and in the fridge."}], "instructions": [{"step": "Preheat the oven to 180°C/gas mark 4."}, {"step": "Tip the sultanas and figs into a medium-sized bowl. Add 1 tablespoon of the rum, mix well and leave to soak while you prepare the remaining ingredients. Tip all of the nuts on to a baking tray and toast in the oven for about 4 minutes until lightly golden. Allow the nuts to cool slightly and then roughly chop."}, {"step": "Tip the chocolate and butter into a medium-sized heatproof bowl and melt over a pan of barely simmering water, taking care not to allow the bottom of the bowl to touch the water. Stir until smooth."}, {"step": "Meanwhile, in another bowl, whisk together the caster sugar, soft light brown sugar, whole egg and egg yolk until smooth and thoroughly combined. Add to the chocolate and butter and mix well. Stirring frequently, continue to cook over the pan of water until the sugar has dissolved, the mixture is silky smooth and hot to the touch and the eggs are cooked– this will take about 4–5 minutes."}, {"step": "Meanwhile tip the biscuits into a freezer bag and crush using a rollingpin until the pieces are slightly larger than the sultanas. Sprinkle with the remaining tablespoon of rum. Add the nuts and biscuits to the dried fruit. Pour over the chocolate mixture and stir with a rubber spatula to thoroughly combine. Leave at room temperature to cool and thicken slightly."}, {"step": "Take two large sheets of baking parchment and divide the mixture evenly between them, spreading it into a log. Roll the paper up and over the mixture, twisting the ends to seal and to pack the mixture into a tight sausage shape. Chill overnight. Remove the salami from the fridge and unwrap from the paper. Tip the icing sugar onto a baking sheet and roll each salami in the sugar to coat completely. Using a sharp knife, cut the salami into slices to serve."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/2013wkwe-November-r7chocsalami.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}