{"title": "Choc-peanut ice cream sandwiches", "tags": null, "planning": {"prep_time": "PT30 minutes, plus infusing, churning, freezing and coolingM", "cook_time": "PT25M", "total_time": "PT55 minutes, plus infusing, churning, freezing and coolingM", "serves": "12 sandwiches"}, "ingredients": [{"item": "600ml whole milk"}, {"item": "250g pack roasted peanuts"}, {"item": "4 tbsp smooth peanut butter"}, {"item": "1 tsp flaky sea salt, plus an extra pinch"}, {"item": "6 egg yolks"}, {"item": "350g golden caster sugar"}, {"item": "100ml double cream, plus extra if needed"}, {"item": "3 eggs (2 whole eggs, 1 egg white – use the yolk in the ice cream)"}, {"item": "175g golden caster sugar"}, {"item": "1 tbsp golden syrup"}, {"item": "2 tsp vanilla extract (or paste)"}, {"item": "125g vegetable oil"}, {"item": "125g cocoa powder"}, {"item": "1⁄2 tsp baking powder"}, {"item": "1⁄4 tsp bicarbonate of soda"}, {"item": "150g milk chocolate, cut into small chunks"}, {"item": "75g dark chocolate (70%cocoa), cut into small chunks"}, {"item": "1 tsp sea salt flakes"}], "instructions": [{"step": "To make the ice cream, put the milk, peanuts, 2 tbsp peanut butter and the salt into a small pan set over a low heat. Bring to a simmer, then take off the heat and set aside for 20 minutes to infuse. Sieve into a clean pan, then rinse the peanuts and dry on kitchen paper."}, {"step": "Whisk the egg yolks and 150g sugar in a large bowl. Bring the peanut milk back to the boil and gradually pour over the eggs, whisking all the time. Return to the pan and cook gently, stirring constantly, until thickened and coating the back of a spoon – about 10 minutes. Pour into a bowl, cover the surface with cling film, cool then chill."}, {"step": "Meanwhile, in a small pan, gently heat the cream and soaked peanuts with the remaining 200g sugar and 2 tbsp peanut butter. Stir until the sugar dissolves, then simmer briskly, stirring often, to make a pourable, deep brown caramel; set aside to cool and stir in a large pinch of salt."}, {"step": "Churn the chilled peanut custard in an ice-cream machine until firmly set and the blade almost stops. Transfer 1⁄2 the ice cream to a pre-chilled container and ripple through 1⁄4 of the peanut caramel (gently warm through, if needed); top with the remaining ice cream and another 1⁄4 of the caramel. Freeze for at least 4 hours, or until set; reserve the remaining caramel to serve."}, {"step": "For the cookies, preheat the oven to 180 ̊C, gas mark 4. Using electric beaters, whisk the whole eggs and egg white, sugar, golden syrup and vanilla until frothy; whisk in the oil. In a separate bowl, sift together the cocoa, baking powder and bicarbonate of soda. Fold into the egg mixture, followed by the chocolate chunks and salt. Put heaped tablespoons of the batter 2-3cm apart on parchment-lined baking trays. Bake in batches for 10-12 minutes, until crisp on the surface. Run a palette knife under each cookie, then transfer to a wire rack to cool."}, {"step": "Reheat the reserved caramel; add a dash more cream if it’s too thick. Serve scoops of ice cream between cookies with the reserved caramel drizzled over the top."}], "nutrition": {"Energy": "3,011Kj 722Kcal", "Fat": "44.4g", "Saturated Fat": "14.5g", "Carbohydrate": "64.9g", "Sugars": "60.9g", "Protein": "15.6g", "Salt": "1.8g", "Fibre": "3.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/peanut butter ice cream.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}