{"title": "Choc hazelnut ice cream sandwiches", "tags": null, "planning": {"prep_time": "PT10 minutes, plus cooling and freezing M", "cook_time": "PT15M", "total_time": null, "serves": "9"}, "ingredients": [{"item": "110g Lurpak Unsalted Butter, at room temperature"}, {"item": "200g caster sugar"}, {"item": "1 egg"}, {"item": "180g plain flour, plus  extra for dusting"}, {"item": "1⁄2 tsp baking powder"}, {"item": "1⁄2 tsp bicarbonate of soda"}, {"item": "1⁄2 tsp salt"}, {"item": "100g pack chopped  roasted hazelnuts"}, {"item": "475ml tub Waitrose 1  Chocolate & Hazelnut Italian Gelato"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4. Line 2 x 20cm square cake tins with baking parchment. Put the butter, sugar and egg in a food processor and blend until just combined (or beat together with a wooden spoon). Add the flour, baking powder, bicarbonate of soda and salt and blend again until smooth. Add the nuts and pulse to combine."}, {"step": "Divide between the cake tins, smoothing the tops with the back of a spoon. Bake for 20 minutes until golden. Leave to cool in the tins for 10 minutes, then transfer to a wire rack to cool completely."}, {"step": "Leave the gelato out of the freezer for 10 minutes; line one of the cake tins with cling film. Peel the parchment off the cookie squares and trim any raised edges so they’re an even height. Place one cookie square in the base of the tin. Tip the gelato into a bowl and quickly mix until smooth – but try not to let it melt too much. Spread over the cookie base. Top with the second cookie square, pressing down lightly. Return to the freezer for at least 3 hours."}, {"step": "Lift out of the tin using the cling film. Cut into squares and serve; you can refreeze them once they’re cut too."}], "nutrition": {"Energy": "1,872kj 447kcal", "Fat": "23.3g", "Saturated Fat": "8.2g", "Carbohydrate": "54.5g", "Sugars": "36.6g", "Protein": "7.1g", "Salt": "0.5g", "Fibre": "2.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/i/Ice cream sandwich.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}