{"title": "Chocolate mousse, raspberry and profiterole gâteau", "tags": [{"tag": "Vegetarian"}, {"tag": "Christmas"}], "planning": {"prep_time": "PT30 minutes, plus chillingM", "cook_time": "PT5M", "total_time": "PT35 minutes, plus chillingM", "serves": "8"}, "ingredients": [{"item": "oil, for greasing"}, {"item": "100g milk chocolate"}, {"item": "225g dark chocolate (70% cocoa)"}, {"item": "3 eggs, separated"}, {"item": "300ml double cream"}, {"item": "2 x 300g packs essential Waitrose frozen profiteroles"}, {"item": "225g fresh small raspberries"}, {"item": "gold stardust or edible gold glitter, for dusting"}], "instructions": [{"step": "Lightly oil an 18cm loose-bottom deep cake tin and line the sides and base with baking parchment. Put the milk chocolate and 200g dark chocolate in a large heatproof bowl over a pan of barely simmering water and gently heat, stirring occasionally, until melted. Remove from the heat and cool slightly."}, {"step": "In a clean bowl, whisk the egg whites to soft peaks; set aside. In another bowl, whisk the cream to soft peaks. Stir the egg yolks into the cooled melted chocolate, then gradually fold in the cream, followed by the egg whites, until combined into a mousse."}, {"step": "Spoon a thin layer of chocolate mousse over the base of the cake tin, then arrange a single layer of frozen profiteroles (12-14) on top. Pop a few raspberries into any gaps, squishing them in. Top with ½ the remaining mousse, smoothing with the back of a spoon, then another layer of profiteroles and more berries. Spoon the remaining mousse over the profiteroles, then top with the remaining profiteroles, lightly squishing them into the mousse. Chill for at least 4 hours or up to 24 hours."}, {"step": "Defrost the chocolate sauce sachets that come with the profiteroles and chill until needed. To serve, remove the dessert from the cake tin. Leaving the paper on the sides of the gâteau, tilt it up to remove the base parchment and transfer to a cake plate. Remove the outside paper. Drizzle a little of the chocolate sauce all over the top. Finely chop the remaining 25g dark chocolate and scatter over. Sprinkle with gold stardust and serve with the remaining chocolate sauce."}], "nutrition": {"Energy": "Per serving 2929kJ 707kcals", "Fat": "57g", "Saturated Fat": "33.2g", "Carbohydrate": "33.1g", "Sugars": "29g", "Protein": "11.3g", "Salt": "0.4g", "Fibre": "6.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/chocolate-mousse-gateau.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}