{"title": "Chocolate banana bundt with salted caramel frosting", "tags": null, "planning": {"prep_time": "PT25 minutes, plus cooling and setting M", "cook_time": "PT45M", "total_time": null, "serves": "12"}, "ingredients": [{"item": "200g unsalted butter at room temperature, plus extra to grease"}, {"item": "50g cocoa powder, plus extra for dusting"}, {"item": "4 ripe medium bananas"}, {"item": "3 tbsp soured cream"}, {"item": "2 tsp vanilla extract"}, {"item": "75g caster sugar"}, {"item": "100g light brown muscovado sugar"}, {"item": "4 large eggs, lightly beaten"}, {"item": "225g plain flour"}, {"item": "50g corn flour"}, {"item": "2 tsp baking powder"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "75g miniature Daim bars (or dark chocolate), finely chopped, plus extra to decorate"}, {"item": "200g light brown muscovado sugar"}, {"item": "75g unsalted butter"}, {"item": "100ml double cream"}, {"item": "25g dark chocolate, chopped"}, {"item": "½ tsp vanilla extract"}], "instructions": [{"step": "Preheat the oven to 190 ̊C, gas mark 5. Melt 2 tsp butter and use to brush the inside of a 2.5 litre bundt tin, getting into all the nooks and crannies. Dust with cocoa, covering every surface, then hold the tin upside-down and tap to get rid of the excess. Mash the bananas with a fork until smooth, add the soured cream and vanilla; set aside."}, {"step": "Tip the caster and muscovado sugars and 200g butter into the bowl of a freestanding mixer; beat well until pale and light – about 3-4 minutes. Gradually add the egg, scraping the sides of the bowl with a spatula as you go. Now add the banana mixture, flour, corn flour, baking powder, bicarbonate of soda, 50g cocoa and a pinch of salt, mixing to combine thoroughly."}, {"step": "Fold the chopped Daim bars (or chocolate) into the mixture, then spoon into the tin. Level with the back of a spoon and bake on the middle shelf of the oven for 30-40 minutes, until well risen and a skewer inserted into the centre comes out clean. Leave to cool in the tin for 2-3 minutes, then turn out onto on a wire rack and leave to cool completely."}, {"step": "For the icing, gently heat the sugar, butter and cream in a small saucepan until dissolved. Bring to the boil and simmer for 30 seconds. Remove from the heat, add the chocolate, vanilla and a large pinch of salt and stir until silky smooth; leave to cool for 5-10 minutes."}, {"step": "Carefully spoon the icing over the cooled cake, allowing it to drizzle over the sides. Leave to set for a few minutes before scattering the top of the cake with more chopped Daim bars. Leave to set completely before serving."}], "nutrition": {"Energy": "2,315kJ 554kcals", "Fat": "30g", "Saturated Fat": "18.2g", "Carbohydrate": "64.4g", "Sugars": "43.8g", "Protein": "6.5g", "Salt": "1g", "Fibre": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Chocolate and caramel bundt cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}