{"title": "Chorizo, manchego & almond biscuits recipe | Waitrose", "tags": null, "planning": {"prep_time": "PT25 minutes, plus chillingM", "cook_time": "PT30M", "total_time": "PT55 minutes, plus chillingM", "serves": "30"}, "ingredients": [{"item": "120g pack Waitrose Cooks’ Ingredients Iberico de Bellota diced chorizo"}, {"item": "200g manchego cheese, finely grated"}, {"item": "150g unsalted butter, softened"}, {"item": "1 tsp sweet smoked paprika"}, {"item": "100g pack blanched almonds"}, {"item": "200g plain flour"}], "instructions": [{"step": "Heat a non-stick frying pan and dry-fry the chorizo on a medium heat for 5 minutes, until crispy and the oil has released. Transfer with a slotted spoon onto a plate lined with kitchen paper. Pour the oil from the frying pan into a large bowl and leave to cool."}, {"step": "Add the cheese, butter and paprika to the chorizo oil and stir to combine. Finely chop the crispy chorizo, then add to the cheese mixture, along with the remaining ingredients. Knead the mixture together by hand until it forms a soft dough."}, {"step": "Lay a piece of cling film on the work surface and put the dough in the centre. Shape into a sausage about 30cm long; wrap in the cling film. Press and shape the dough into a rectangle about 5cm wide and 3.5cm tall. Chill for at least 1-2 hours, until firm."}, {"step": "Preheat the oven to 180˚C, gas mark 4, and line 2 baking sheets with baking parchment. Carefully cut the dough into 30 slices, about 1cm thick. Arrange on the baking sheets, spaced well apart, and bake for 20-25 minutes, swapping the trays halfway through, until golden. Leave to cool on the baking sheet. Tie biscuits up with greaseproof paper, brown paper and ribbon. Store in an airtight container in the fridge for up to 1 week."}], "nutrition": {"Energy": "529kJ 127kcals", "Fat": "9.8g", "Saturated Fat": "5g", "Carbohydrate": "5.5g", "Sugars": "0.3g", "Protein": "4.3g", "Salt": "0.3g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/04_chorizo-manchego-almond-biscuits-2-1_v2LR.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}