{"title": "Churros with Coconut Dulce de Leche", "tags": null, "planning": {"prep_time": "PT25 minutes, plus 5 minutes coolingM", "cook_time": "PT15M", "total_time": "PT45M", "serves": "16"}, "ingredients": [{"item": "Batter"}, {"item": "110g butter"}, {"item": "140g plain flour"}, {"item": "3 medium eggs, lightly beaten"}, {"item": "Dulce de Leche"}, {"item": "397ml condensed milk"}, {"item": "150ml coconut milk"}, {"item": "3 tbsp caster sugar"}, {"item": "1 tsp ground cinnamon"}, {"item": "750ml vegetable oil, for deep frying"}], "instructions": [{"step": "Cook the condensed milk in a small, heavy-based pan over a low heat. Stir, with your spoon scraping the bottom of the pan, for 12–15 minutes continuously, or until the liquid has turned a toffee colour and comes away from the sides of the pan. Take off the heat and beat in the coconut milk. Set aside.  Put 225ml water and the butter in another small pan and bring to a rolling boil. Tip in the flour, add a pinch of salt and remove from the heat. Beat vigorously until the mixture comes together into a ball. Set aside to cool for 5 minutes, then slowly beat in the eggs, a little at a time.  Fill a large saucepan one third full with the vegetable oil. Heat to 190°C (or until a cube of bread floats and turns golden after 20 seconds). Spoon the batter into a piping bag fitted with a 1.5cm star-shaped nozzle. Squeeze four 10–12cm lengths of batter into the hot oil, using a knife to slice off each length from the nozzle into the pan. Fry for 3–4 minutes, turning occasionally, until golden. Drain on kitchen paper and fry the remaining batter in the same way.  Mix the caster sugar and cinnamon and dust over the churros while hot. Serve warm with a bowl of the coconut dulce de leche."}], "nutrition": {"Energy": "995.792kJ 238.0kcal", "Fat": "14.1g", "Saturated Fat": "7.2g", "Sugars": "18.1g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/0802026-r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}