{"title": "Ciabatta", "tags": null, "planning": {"prep_time": "PT25 minutes, plus resting, proving and coolingM", "cook_time": "PT30M", "total_time": null, "serves": "2 loaves"}, "ingredients": [{"item": "150g super fine 00 grade flour, plus extra for shaping"}, {"item": "150g strong white bread flour"}, {"item": "1 tbsp fine salt"}, {"item": "2 tsp easy bake yeast"}, {"item": "extra virgin olive oil, for kneading"}, {"item": "100g super fine 00 grade flour"}, {"item": "100g strong white bread flour"}, {"item": "pinch easy bake yeast"}], "instructions": [{"step": "Prepare the biga the night before. In a deep bowl, beat together the flours and yeast with 160ml warm water, until combined. Scrape down the sides, cover and leave at room temperature for at least 8 hours, or ideally 12-16 hours."}, {"step": "The next day, gradually incorporate the flours, salt and yeast into the biga with 265ml warm water, until you have a smooth, wet dough. Transfer to a well-oiled work surface and, with oiled hands, knead vigorously for 20 seconds, then rest for 10 minutes; repeat twice, using more oil as needed. Put the dough in a large oiled bowl, cover and leave to prove at room temperature for 1 hour."}, {"step": "Scoop the dough onto an oiled work surface, flatten it slightly, then fold all 4 sides into the centre. Return to the oiled bowl, seam-side down, to prove for another hour, then repeat the folding and proving process again."}, {"step": "Now shape the dough, trying to handle it as little as possible to keep in the air. Flour a clean work surface very generously and scoop the dough on top. Flour the top of the dough and, using a floured knife, cut it lengthways into 2 even pieces; dust off the excess flour from the surface of the dough. One loaf at a time, fold the long sides into the centre, overlapping them slightly. Carefully transfer the loaves, seam-side down, to a large, well-floured baking tray. Cover with a clean tea towel and prove until puffed up – about 45-55 minutes."}, {"step": "Preheat the oven to 250˚C, gas mark 9, and put a deep, clean metal baking dish on the bottom of the oven. When ready to bake, put the bread on the middle shelf and fill the bottom dish with just-boiling water. Immediately reduce the temperature to 200˚C, gas mark 6, and bake for about 25-30 minutes, until the bread is golden and hollow-sounding when the base is tapped (if it browns too quickly, reduce to 180˚C, gas mark 4). Cool completely on a wire rack before serving."}], "nutrition": {"Energy": "614 145", "Fat": "2.4g", "Saturated Fat": "0.4g", "Carbohydrate": "26g", "Sugars": "0.6g", "Protein": "4.9g", "Salt": "1.4g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/Inspiration/Taste of Italy/bread2-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}