{"title": "Cinnamon and sesame swirls with tahini drizzle", "tags": null, "planning": {"prep_time": "PT25 minutes, plus provingM", "cook_time": "PT20M", "total_time": "PT45 minutes, plus provingM", "serves": "12"}, "ingredients": [{"item": "250g plain flour, plus extra for dusting"}, {"item": "250g strong white bread flour"}, {"item": "40g caster sugar"}, {"item": "5g fine salt"}, {"item": "2 x 7g sachets fast action/easy bake yeast"}, {"item": "270g whole milk"}, {"item": "50g unsalted butter, diced"}, {"item": "1 large egg"}, {"item": "1 large egg yolk"}, {"item": "flavourless oil (such as sunflower), for greasing"}, {"item": "180g unsalted butter, at room temperature"}, {"item": "140g light brown muscovado sugar"}, {"item": "40g plain flour"}, {"item": "3 tbsp ground cinnamon"}, {"item": "2 tbsp sesame seeds, plus extra for topping"}, {"item": "125g dried apricots, finely chopped"}, {"item": "30ml whole milk"}, {"item": "15g unsalted butter"}, {"item": "25g tahini"}, {"item": "175g icing sugar"}], "instructions": [{"step": "To make the dough, put the flours, sugar, salt and yeast in a mixing bowl (or preferably a freestanding mixer with dough hook) and stir together. Put the milk and diced butter in a saucepan; set over a high heat. Keep your finger in the milk as it heats up and as soon as it feels just warm – not hot – remove it from the heat (the butter won’t completely melt). Add the milk and butter to the dry ingredients along with the whole egg. Knead until you have a smooth dough (about 7 minutes in a freestanding mixer at a medium speed, or up to 15 minutes if kneading by hand)."}, {"step": "When the dough is smooth, elastic and supple, put it in a mixing bowl greased with a little flavourless oil. Cover the bowl with a tea towel or cling film, then leave the dough to prove until doubled in size (about 1 hour at room temperature). Meanwhile, prepare the filling. Beat together the butter, sugar, flour and cinnamon until you have a smooth, spreadable paste; set aside."}, {"step": "When the dough has doubled in size, liberally dust the work surface with flour and roll the dough out into a square of about 40cm. Spread the filling over the dough, from edge to edge. Scatter over the sesame seeds and apricots as evenly as possible, then roll into a tight spiral. Once you have a long sausage, trim the ends to neaten, then cut into 12 equal portions. (Rather than use a knife, which can squash the spirals, I use a length of plain dental floss; I slide it under the dough, position it where I want to cut, bring the ends of floss up and cross them over the dough, then pull them in opposite directions to cut through.) Place the portions of dough, spiral side up, on a 20cm x 30cm baking tray in 4 rows of 3, leaving room to spread. Loosely cover the tray with cling film or a tea towel and let the buns rise until doubled in size (35-45 minutes at room temperature). Preheat the oven to 180˚C, gas mark 4."}, {"step": "When the buns have risen, mix the egg yolk with ½ tsp water and a pinch of salt, then brush over the tops of the buns. Bake for 15-20 minutes, until puffed up and lightly golden. Meanwhile, make the drizzle. Put the milk and butter in a saucepan set over a high heat and bring to the boil. Take off the heat then add the tahini and icing sugar; stir to a smooth, glossy glaze. When the buns are cooked, drizzle the warm glaze over them. Finish with a scattering of toasted sesame seeds. Delicious eaten as soon as they are cool enough to handle."}], "nutrition": {"Energy": "Per bun 2161kJ 515kcals", "Fat": "22g", "Saturated Fat": "12g", "Carbohydrate": "69g", "Sugars": "35g", "Protein": "8.8g", "Salt": "0.5g", "Fibre": "5.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cinnamon-sesame-swirls.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}