{"title": "Cinnamon and raisin hot cross buns", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT35 minutes, plus 2-3 hours standing, rising and provingM", "cook_time": "PT25M", "total_time": "PT1 hour, plus 2-3 hours standing, rising and provingM", "serves": "16"}, "ingredients": [{"item": "230ml whole milk"}, {"item": "50g unsalted butter, cubed"}, {"item": "500g strong white bread flour"}, {"item": "½ tsp fine salt"}, {"item": "1 tsp ground mixed spice"}, {"item": "1½ tsp ground cinnamon"}, {"item": "60g golden caster sugar"}, {"item": "7g sachet easy bake yeast"}, {"item": "1 large egg"}, {"item": "100g raisins"}, {"item": "vegetable oil, for greasing"}, {"item": "1 egg"}, {"item": "70g plain flour"}, {"item": "apricot jam, to glaze"}], "instructions": [{"step": "Put the milk in a small saucepan and bring to just before boiling point. Remove from the heat, add the butter and set aside while it melts. Meanwhile, mix the strong white bread flour, salt, spices and sugar together in a large bowl; make a well in the centre and add the yeast. Pour about 200ml warm milk mixture into the well; leave to stand for 5 minutes to allow the yeast to dissolve (it should bubble)."}, {"step": "Beat the large egg and add to the bowl, then mix everything together with a wooden spoon to form a soft, smooth dough, adding the remaining warm milk mixture if it feels a little dry. Knead for 10-12 minutes by hand until smooth and elastic. Press into a flat round and top with the raisins. Fold over to encase the fruit and knead for a couple more minutes to distribute the raisins evenly. Put in a lightly greased bowl, cover with oiled cling film and set aside in a warm place until doubled in size (about 1½ hours). Meanwhile, oil 2 large baking sheets."}, {"step": "Tip the risen dough onto a work surface and divide into 16 equal portions (about 60g each), rolling into balls. Place about 2cm apart on the baking sheets. Flatten each slightly then cover with oiled cling film and leave to prove for about 45 minutes, or until doubled in size."}, {"step": "Preheat the oven to 200˚C, gas mark 6. Beat the egg for the glaze and brush the buns with it. To make the crosses, put the plain flour in a small bowl and mix in about 5 tbsp water, 1 tbsp at a time, until you have a thick paste (you may not need all the water). Spoon into a disposable piping bag and snip off the end. Pipe a cross onto each bun. Bake for 15-20 minutes, until golden. Put on a wire rack to cool slightly before glazing with a little warm, watered- down apricot jam."}], "nutrition": {"Energy": "Per bun 886kJ 210kcals", "Fat": "5g", "Saturated Fat": "2.3g", "Carbohydrate": "34.4g", "Sugars": "8.9g", "Protein": "6g", "Salt": "0.2g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cinnamon-and-raisin-hot-cross-buns.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}