{"title": "Classic pork pie", "tags": null, "planning": {"prep_time": "PT2 hours, plus chillingM", "cook_time": "PT2 hours 15 minutesM", "total_time": "PT4 hours 15 minutes, plus chillingM", "serves": "12"}, "ingredients": [{"item": "250g smoked back bacon rashers"}, {"item": "4 pork, leek and chive sausages (about 260g)"}, {"item": "1kg pork shoulder (from the meat service counter), very finely chopped"}, {"item": "1 tsp fine sea salt"}, {"item": "1 tsp ground black pepper"}, {"item": "1 tsp ground mace"}, {"item": "½ tsp freshly grated nutmeg"}, {"item": "1 tbsp dried thyme"}, {"item": "1 tbsp dried sage"}, {"item": "Pastry"}, {"item": "100g lard, diced"}, {"item": "100g unsalted butter, diced, plus extra for greasing"}, {"item": "2 tsp fine sea salt"}, {"item": "550g plain flour, plus extra for dusting"}, {"item": "1 large egg yolk"}, {"item": "Jelly"}, {"item": "350ml chicken stock"}, {"item": "3 sheets leaf gelatine"}], "instructions": [{"step": "Chop the bacon as finely as you can and put in a large bowl. Remove the sausagemeat from the skins and add to the bowl along with the finely chopped pork. Add the salt, pepper, spices and herbs to the meat mixture and use your hands to mix thoroughly. Cover and chill until needed."}, {"step": "To make the pastry, put 200ml water in a pan with the lard, butter and salt. Set over a medium heat until all the fat has melted and the salt has dissolved. Put the flour in a large bowl and make a well in the centre. Pour in the fat mixture and use a wooden spoon to mix together into a dough."}, {"step": "Tip the dough out onto a clean work surface and briefly knead it until smooth and uniform; it will be very soft. Cut off about ¹⁄³, press it into a disc, wrap and chill. Wrap the remaining pastry separately and chill for 30-45 minutes, until cooled to about room temperature but not cold. (If it’s too cold, it can crack when rolled out)."}, {"step": "Grease a deep 20cm diameter round cake tin with a removable base. Line the base and sides with baking parchment, trimming the excess so that it is almost flush with the top of the tin. Lightly butter the parchment. On a well-floured work surface, roll out the larger piece of dough until it’s about the thickness of a £1 coin and large enough to line the tin. Drape the pastry into the tin carefully, covering the base and sides, without tearing it. Use a sharp knife or scissors to trim away the excess, reserving it for later, then use a little ball of excess pastry to press it neatly into the edges of the tin."}, {"step": "Fill the pastry-lined tin with the pork mixture, packing it in quite firmly to remove any air pockets. Brush the inside of the exposed pastry above the meat with water to make it a little tacky. Roll out the smaller disc of dough about half as thick as the base and cut out a 20cm disc. Make a 2cm hole in the centre. Gently place the disc on the top of the pie filling and press the edges to the damp pastry, then fold the excess over the lid."}, {"step": "Press all the scraps of dough together and roll out thinly (about the same thickness as the lid). Use a small leaf cutter or a small, sharp knife to cut as many leaf-shaped pieces as possible. Brush the outside edge of the pie top with water and add a ring of leaves. Repeat, layering circles of leaves, working in to the centre, until the whole pie is covered and looks almost like a flower (or create your own design, if you prefer). Chill the pie for 1 hour."}, {"step": "Preheat the oven to 200˚C, gas mark 6. Make a little funnel with baking parchment and insert it into the hole in the middle. Bake the pie for 30 minutes. Beat the egg yolk with a splash of water and brush it over the top of the pie. Reduce the oven temperature to 180˚C, gas mark 4; bake for a further 1 hour 30 minutes. If the pie is browning too quickly, cover lightly with a tent of foil until the time is up. Leave the pie to cool completely in the tin."}, {"step": "Once the pie is at room temperature, make the jelly. Put the stock in a pan over a medium heat. Add the gelatine to a bowl of ice-cold water. Once it has softened and the stock is hot (about 3 minutes), remove the gelatine from the water, squeezing out the excess liquid, then stir it into the hot stock until dissolved. Pour this liquid jelly into a jug. Carefully remove the pie from the tin. Fill any cracks in the pastry with softened butter and freeze for a couple of minutes until firm (you can scrape away any butter after the jelly has set). Using the paper funnel, slowly pour the jelly into the vent hole until the pie will take no more. Discard the funnel. Chill the pie in the fridge until cold (about 1-2 hours, until the jelly in the hole is visibly set), then cut into thick slices to serve. It will keep for up to 2 days in the fridge and for 1 month in the freezer."}], "nutrition": {"Energy": "2,205kJ 528kcals", "Fat": "29g", "Saturated Fat": "12g", "Carbohydrate": "35g", "Sugars": "0.7g", "Protein": "31g", "Salt": "2.6g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Waitrose-Pie-27.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}