{"title": "Clementine Flan with Salted Almond Caramel and Chocolate Sauce", "tags": null, "planning": {"prep_time": "PT40 minutes, plus cooling and chillingM", "cook_time": "PT115M", "total_time": "PT155M", "serves": "6"}, "ingredients": [{"item": "Chocolate sauce"}, {"item": "120ml whole milk"}, {"item": "1 star anise"}, {"item": "100g dark chocolate (70 per cent cocoa solids), broken into small pieces"}, {"item": "60ml condensed milk"}, {"item": "5 egg yolks"}, {"item": "50g caster sugar"}, {"item": "100ml double cream"}, {"item": "280ml freshly squeezed clementine juice (from around 10-12 clementines)"}, {"item": "Salted almond caramel"}, {"item": "180g caster sugar"}, {"item": "100g marcona almonds or blanched almonds"}, {"item": "1½ tsp sea salt"}], "instructions": [{"step": "Preheat the oven to 140˚C/gas 1. Whisk the egg yolks with the sugar until light and fluffy. Gradually whisk in the cream and clementine juice until fully incorporated. Divide between six ramekins set in a deep-sided roasting tin. Pour enough cold water around the ramekins, to reach the same level as that of the flan mix. Bake for about 1 hour 30 minutes, or until the flans are just set. Cool, then chill for at least 4 hours, or overnight.  For the chocolate sauce, heat the milk with the star anise for 10 minutes without allowing it to boil. Take off the heat and cool for 10 minutes, removing the star anise. Gently melt the chocolate in a bain marie until smooth. Stir into the milk along with the condensed milk. Mix well, then decant the sauce into a pouring jug and set aside in a warm spot.  For the caramel, heat a saucepan over a medium heat. Pour the sugar into the pan and cook very slowly, swirling the pan now and then but never stirring. Remove from the heat when the colour turns a dark oak; no further or it will have a bitter taste. Add the almonds and salt, stir well and decant onto a non-stick oven tray. Be careful as it will be extremely hot.  Leave the caramel well alone for 20 minutes, until it is fully set and brittle, then break into chunks and pulse in a processor for 2 minutes or so, until it resembles rough breadcrumbs.  Remove the flans from the fridge, sprinkle over the crushed caramel and serve with the jug of chocolate sauce on the side."}], "nutrition": {"Energy": "2221.704kJ 531.0kcal", "Fat": "29.0g", "Saturated Fat": "11.0g", "Sugars": "58.0g", "Salt": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/0904wfi57r1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}