{"title": "Coconut cheesecake with mixed berries", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes + coolingM", "cook_time": "PT50-60 minutesM", "total_time": "PT70-80 minutes + coolingM", "serves": "8"}, "ingredients": [{"item": "150g digestive biscuits"}, {"item": "75g unsalted butter"}, {"item": "500g essential Waitrose Creamy Soft Cheese"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "160ml can Cooks’ Ingredients Coconut Cream"}, {"item": "75g caster sugar"}, {"item": "For the fruit topping"}, {"item": "150g each of cherries, raspberries and blueberries"}, {"item": "75ml orange or apple juice"}, {"item": "2 tbsp vanilla bean dusting sugar"}, {"item": "½ tsp cornflour"}, {"item": "Mint leaves, to decorate"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. Place the biscuits in a food bag and finely crush with a rolling pin. Melt the butter and mix with the biscuits in a bowl. Pack into the base and slightly up the sides of an 18cm loose-bottomed or spring-form cake tin. Press down firmly with the back of a spoon."}, {"step": "Put the soft cheese, eggs, coconut cream and sugar in a bowl and beat well until combined. Spoon into the tin and bake for 50–60 minutes or until the filling is lightly set but still slightly wobbly in the centre. Leave to cool completely in the tin then chill for at least 1 hour, or for up to 12 hours until ready to serve. This will make the cheesecake easier to slice."}, {"step": "Meanwhile, for the fruit topping, halve and stone the cherries. Place them in a saucepan with the fruit juice and sugar and cook gently for 3–4 minutes, until they have softened slightly. Blend the cornflour with 1 tsp cold water and add to the pan. Cook for 2 minutes until thickened and bubbling. Tip into a bowl, stir in the blueberries and raspberries and leave to cool."}, {"step": "Loosen the edges of the cheesecake with a knife then lift out onto a serving plate. Pile the fruits on top and scatter over a few mint leaves before cutting into wedges to serve."}], "nutrition": {"Energy": "1,966kJ 472kcals", "Fat": "33.2g", "Saturated Fat": "20.7g", "Carbohydrate": "35.8g", "Sugars": "23.1g", "Protein": "7.6g", "Salt": "0.7g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Coconut-cheesecake-Late-Summer-Harvest2015-WEB.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}