{"title": "Coconut and berry cake bars", "tags": null, "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT1 hour 15 minutesM", "total_time": null, "serves": "16"}, "ingredients": [{"item": "100g unsalted butter, chilled, plus extra for greasing"}, {"item": "175g plain flour, plus extra for dusting"}, {"item": "1⁄4 tsp fine salt"}, {"item": "2 tbsp desiccated coconut"}, {"item": "2 tbsp golden caster sugar"}, {"item": "1 egg yolk (reserve the white for the cake)"}, {"item": "1⁄2 tsp vanilla extract"}, {"item": "3 tbsp raspberry jam"}, {"item": "175g unsalted butter"}, {"item": "150g natural yogurt"}, {"item": "3 eggs, plus the reserved white from the base"}, {"item": "150g plain flour"}, {"item": "1⁄4 tsp fine salt"}, {"item": "2 tsp baking powder"}, {"item": "175g golden caster sugar"}, {"item": "100g desiccated coconut"}, {"item": "175g mixed raspberries and blueberries"}], "instructions": [{"step": "Lightly grease a 23cm square cake tin and line with baking parchment. For the base, put the flour, butter and salt into a food processor and pulse to fine crumbs, then pulse in the coconut and sugar. Beat the egg yolk with the vanilla and 1 tbsp cold water, then add to the machine with the motor running, to make a soft dough. Roughly press into the prepared tin with your hands, dust with a little flour and press with the back of a spoon to push into the corners and flatten. Prick with a fork, then chill for 10 minutes. Meanwhile, preheat the oven to 200 ̊C, gas mark 6."}, {"step": "Bake the biscuit base for 15 minutes, or until pale golden. Cool for a couple of minutes, then spread with the jam. Lower the oven temperature to 180 ̊C, gas mark 4."}, {"step": "For the cake, melt the butter in a pan, then take off the heat and use a fork to beat in the yogurt, then the eggs and reserved egg white. Sift the flour, salt and baking powder into a large bowl; stir in the sugar and coconut."}, {"step": "Pour the wet cake ingredients into the dry, and mix well with a spatula. Pour over the jammy base, level the top, then scatter with the berries. Bake for 45-50 minutes, until golden and risen all over; a skewer inserted into the middle should come out clean. Cool in the tin, then cut into bars."}], "nutrition": {"Energy": "1,491kJ 357kcals", "Fat": "22g", "Saturated Fat": "14.4g", "Carbohydrate": "34.9g", "Sugars": "18.8g", "Protein": "4.9g", "Salt": "0.4g", "Fibre": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Coconut and raspberry traybake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}