{"title": "Cod & caper fishcakes with watercress salad", "tags": null, "planning": {"prep_time": "PT20 minutes + chillingM", "cook_time": "PT30M", "total_time": "PT45-50 minutes + chilling timeM", "serves": "8"}, "ingredients": [{"item": "2 tbsp olive oil, plus extra for frying/baking"}, {"item": "6 salad onions, chopped"}, {"item": "400g leftover cooked cod"}, {"item": "400g cold mashed potato"}, {"item": "2 tbsp capers, rinsed, drained and chopped"}, {"item": "1 tbsp each chopped flat leaf parsley, dill and chives"}, {"item": "75g plain flour, seasoned with salt and pepper"}, {"item": "2 medium free-range eggs, beaten"}, {"item": "75g reserved cheesy breadcrumbs (from the crunchy cod recipe)"}, {"item": "Lemon wedges, to serve"}, {"item": "For the watercress salad"}, {"item": "200g frozen peas"}, {"item": "2 tsp wholegrain mustard"}, {"item": "4 tbsp olive oil"}, {"item": "2 tbsp lemon juice"}, {"item": "100g watercress"}, {"item": "160g cherry tomatoes, quartered"}], "instructions": [{"step": "Heat a dash of olive oil in a saucepan, add the salad onions and fry over a gentle heat for 1-2 minutes or until softened. Take off the heat."}, {"step": "Remove the lemon slices from the fish, then flake the cooked fish into a large bowl, discarding any bones and skin. Add the mashed potato, capers, chopped herbs and salad onions, season well and mix together. Divide into 8 patties, then roll each one in seasoned flour, shake off the excess, dip in beaten egg, then finally in the reserved breadcrumb mix. Place on a baking sheet lined with baking parchment and chill for at least 20 minutes to firm up."}, {"step": "Meanwhile, make the watercress salad. Cook the peas in a pan of boiling water for 2 minutes, drain and refresh in cold water. Place the mustard in a small jug, add the 4 tbsp olive oil and lemon juice, season and whisk together."}, {"step": "If you’re frying the fishcakes, heat 2 tbsp olive oil in a frying pan over a low-medium heat. Add the fishcakes, in batches, and fry for 4-5 minutes on each side until heated through. Alternatively, preheat the oven to 200°C, gas mark 6. Place the fishcakes on a baking sheet lined with baking parchment, drizzle with a little oil and bake for 15 minutes. Turn over the fishcakes and bake for another 5-8 minutes or until golden brown all over and cooked through."}, {"step": "To serve, divide the watercress, peas and tomatoes among 4 plates, drizzle over the dressing, then add 2 fishcakes per person and extra lemon wedges to squeeze over."}], "nutrition": {"Energy": "2,552kJ 611kcals", "Fat": "32g", "Saturated Fat": "7.1g", "Carbohydrate": "40g", "Sugars": "6.3g", "Protein": "37g", "Salt": "1.1g", "Fibre": "7.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/cod_fishcake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}