{"title": "Coffee cake with walnuts", "tags": null, "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT30M", "total_time": "PT1 hour, plus coolingM", "serves": "12"}, "ingredients": [{"item": "175g salted butter, softened, plus extra for greasing"}, {"item": "3 tbsp espresso coffee powder"}, {"item": "150ml buttermilk"}, {"item": "125g light brown soft sugar"}, {"item": "100g golden caster sugar"}, {"item": "3 large eggs, at room temperature"}, {"item": "200g self-raising flour"}, {"item": "50g cornflour"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "50g walnuts, chopped"}, {"item": "150g salted butter, softened"}, {"item": "250g golden icing sugar, plus 1 tsp for dusting"}, {"item": "50g walnuts, chopped"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease then line the bases of 2 x 20cm round sandwich tins. Dissolve the espresso coffee powder in 100ml boiling water. Stir together the buttermilk and 3 tbsp of the coffee, reserving the rest of the coffee. Put the butter, light brown soft sugar and caster sugar in a large bowl and beat until creamy and light using either electric beaters or a freestanding mixer. Add 1 egg, beat until creamy, then repeat until all the eggs have been incorporated."}, {"step": "In a separate bowl, mix the flour, cornflour and bicarbonate of soda, then sift half over the egg mixture. Fold in gently with a large metal spoon or spatula, then fold in half the coffee- buttermilk mixture. Don’t worry if it looks a little split. Repeat with the remaining flour mixture and coffee-buttermilk mixture, then fold in the chopped nuts. Divide the batter evenly between the tins, level out, then bake for 25-30 minutes or until risen, dark golden and shrinking from the sides. Cool completely in the tins, on a wire rack."}, {"step": "For the icing, put the butter, icing sugar and 4 tsp reserved coffee into a large bowl. Stir slowly until combined, then beat well with a wooden spoon (or use electric beaters or a freestanding mixer) until creamy and smooth. Put 1 cake onto a plate, bottom-side up. Peel off the parchment then drizzle the cake with 1 tbsp coffee. Spread over ¹⁄ ³ of the icing, then stack the second cake on top, the right way up. Mound the remaining icing on top, then spread it over the top of the cake using a palette knife. Decorate the top with the walnuts."}], "nutrition": {"Energy": "2,165kJ 518kcals", "Fat": "30g", "Saturated Fat": "15g", "Carbohydrate": "56g", "Sugars": "40g", "Protein": "6g", "Salt": "0.9g", "Fibre": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Coffee-cake-with-walnuts.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}