{"title": "Conference pear and cardamom loaf cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 40 minutes, plus coolingM", "serves": "10"}, "ingredients": [{"item": "175g unsalted butter, softened, plus extra for greasing"}, {"item": "2 tsp cardamom pods, split open and seeds removed"}, {"item": "175g light brown soft sugar"}, {"item": "3 conference pears, peeled, cored and cut lengthways into eighths"}, {"item": "1 lemon, zest"}, {"item": "2 eggs, beaten"}, {"item": "175g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "1½ tbsp flaked almonds"}, {"item": "icing sugar, for dusting"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease a 900g loaf tin; line the base and ends with a strip of baking parchment, slightly overhanging. Crush the cardamom seeds in a pestle and mortar."}, {"step": "Melt 25g butter in a frying pan with 25g sugar until bubbling. Add the pears and cook for 5 minutes, turning often, until slightly soft. Remove the pears, leaving the butter in the pan, and set aside."}, {"step": "Scrape the melted butter into a bowl. Add the cardamom, lemon zest and remaining sugar and butter. Beat until smooth and creamy, then work in the eggs, a little at a time. Mix the flour and baking powder, then fold into the mixture until well combined."}, {"step": "Chop ½ the pears and stir evenly into the mix. Spoon into the tin and smooth the top. Cover with the remaining pears, topping and tailing them across the cake, then scatter with the almonds."}, {"step": "Bake for 50-60 minutes; cover with foil after 45 minutes if it gets too dark. Leave to cool in the tin for at least 20 minutes, then eat warm with cream, or cool on a wire rack and dust with icing sugar."}], "nutrition": {"Energy": "1,365kJ 326kcals", "Fat": "17.4g", "Saturated Fat": "9.9g", "Carbohydrate": "38.6g", "Sugars": "25.4g", "Protein": "3.8g", "Salt": "0.4g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/WKSeasonal_PearCake2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}