{"title": "Continental cheese & ham crepes", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "8 crepes"}, "ingredients": [{"item": "300ml milk"}, {"item": "1 Waitrose British Blacktail Large Free Range Egg"}, {"item": "1 tbsp vegetable oil plus extra for frying"}, {"item": "100g buckwheat flour (or plain flour)"}, {"item": "3 tbsp mayonnaise"}, {"item": "2 tbsp Dijon mustard"}, {"item": "8 slices cooked ham"}, {"item": "2 x 160g packs Leerdammer Light Slices"}, {"item": "20g butter, melted"}, {"item": "95g bag Waitrose Lambs Lettuce"}], "instructions": [{"step": "Beat together the milk, egg and oil. Place the flour in a bowl, slowly pour in the milk and egg mixture and beat to a smooth batter."}, {"step": "Heat a small amount of oil in a non-stick frying pan (measuring about 25cm) and add a ladleful of the batter. Swirl around the pan to make a thin crepe and cook for 1-2 minutes until golden then flip over with a spatula and cook the other side until golden. Transfer to a board and continue with the remaining batter until you have 8 crepes."}, {"step": "Mix together the mayonnaise and mustard."}, {"step": "Preheat the grill. Spread some of the mustard mixture over 1 of the crepes then place 1 slice of ham and 2 slices of cheese on top. Fold in the sides then roll up to make a filled crepe. Place in a shallow baking dish (join-side down) and repeat with the remaining crepes. Brush the top with the melted butter."}, {"step": "Place the baking dish under the grill and cook for about 5 minutes until the top is golden and crispy. Serve with a handful of lambs lettuce and extra mustard mayonnaise."}], "nutrition": {"Energy": "2,896kJ 696kcals", "Fat": "49.5g", "Saturated Fat": "21g", "Carbohydrate": "21.9g", "Sugars": "5.7g", "Protein": "40.7g", "Salt": "3.5g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cheese&HamCrepes_021.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}