{"title": "Cornbread french toast with avocado and streaky bacon", "tags": null, "planning": {"prep_time": "PT30 minutes plus coolingM", "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 eggs"}, {"item": "100ml double cream"}, {"item": "20g unsalted butter"}, {"item": "8 rashers smoked streaky bacon 2 avocados, diced"}, {"item": "50g rocket"}, {"item": "1 lemon, juice"}, {"item": "2 tbsp olive oil"}, {"item": "400ml whole milk"}, {"item": "3eggs"}, {"item": "60g unsalted butter, melted 200g sweetcorn"}, {"item": "4 salad onions, chopped"}, {"item": "1 tbsp baking powder"}, {"item": "1 tbsp caster sugar •2tspsalt"}, {"item": "160g polenta"}, {"item": "65g strong white bread flour"}, {"item": "1⁄2 tbsp smoked paprika"}, {"item": "110ml maple syrup"}], "instructions": [{"step": "Preheat the oven to 200 ̊C, gas mark 6; line a 900g loaf tin with baking parchment. To make the cornbread, mix together the milk, eggs, butter, sweetcorn and salad onions in a large bowl. Sift all the dry ingredients together in another bowl. Combine the wet and dry ingredients swiftly, without over-mixing, and pour into the loaf tin. Bake for 30 minutes. Cool in the tin for 5 minutes, then turn out onto a wire rack. Once cool, set aside 4 thick slices. Keep the rest to eat – it’s delicious toasted and buttered– or it will freeze well. For the dressing, gently heat the paprika and maple syrup together in a small saucepan for a few minutes until fully combined; set aside. Turn the oven to 140 ̊C, gas mark 1. Whisk together the eggs and cream; season. Dip the cornbread slices into the egg mixture, making sure each slice is well coated. Heat the butter in a large frying pan over a high heat and when hot, fry the cornbread for 3–4 minutes on each side until golden. (You may need to do this in batches.) Keep the French toast warm in the oven until ready to serve. In a separate frying pan, cook the bacon for 2–3 minutes on each side until crisp. Toss together the avocado, rocket, lemon juice and olive oil; season well. Place a slice of the cornbread French toast on a plate, top with a heaped spoonful of the avocado mixture and 2 slices of crispy bacon, then drizzle over a little of the dressing."}], "nutrition": {"Energy": "3296.992kJ 788Kcal", "Fat": "57g", "Saturated Fat": "23.3g", "Carbohydrate": "45.8g", "Sugars": "18.1g", "Protein": "23g", "Salt": "3.9g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cornbread french toast.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}