{"title": "Cottage pie with sweet potato", "tags": null, "planning": {"prep_time": "PT20 minutes plus standingM", "cook_time": "PT1 hour 20 minutesM", "total_time": null, "serves": "4"}, "ingredients": [{"item": "1 tbsp olive oil"}, {"item": "500g British beef mince"}, {"item": "1 onion, diced"}, {"item": "1 stalk celery, diced"}, {"item": "1 carrot, peeled and diced"}, {"item": "1 Oxo Beef stock cube"}, {"item": "1 tbsp tomato purée"}, {"item": "11/2 tbsp plain flour"}, {"item": "2 tsp Worcestershire sauce"}, {"item": "3 thyme sprigs"}, {"item": "2 medium sweet potatoes, peeled"}, {"item": "1 tbsp unsalted butter"}], "instructions": [{"step": "Heat 1⁄2 tbsp oil in a large sauté pan or casserole dish over a high heat. Add the beef and fry, breaking it up, for 4-5 minutes, until browned. Remove from the pan, add the remaining 1⁄2 tbsp oil, lower the heat to medium and fry the onion, celery and carrot with a pinch of salt for 10 minutes, until softened. Meanwhile, dissolve the beef stock cube in 500ml just-boiled water."}, {"step": "Return the beef to the pan, add the tomato purée and cook for 1 minute, then stir in the flour and fry for 1 minute more. Add the stock, Worcestershire sauce and 2 thyme sprigs and simmer for 25-30 minutes, until the beef is coated in a thick gravy. Meanwhile, slice the potatoes as thinly as you can and put in a bowl. Cover with just-boiled water from the kettle; set aside for 10 minutes. Drain and use kitchen paper to pat dry thoroughly, then lay out on more kitchen paper to finish drying."}, {"step": "Preheat the oven to 200oC, gas mark 6. Melt the butter. Tip the beef and gravy into a medium ovenproof dish. Toss the potatoes with the butter and leaves from the remaining thyme sprig. Season and arrange in circles over the beef. Bake for 30 minutes until bubbling hot and the potatoes are cooked through. Stand for 10 minutes before serving."}], "nutrition": {"Energy": "1,837kJ 438kcals", "Fat": "19g", "Saturated Fat": "8.2g", "Carbohydrate": "35g", "Sugars": "12g", "Protein": "28g", "Salt": "1.3g", "Fibre": "5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/New recipes/4983-CottagePie-SweetPotato.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}