{"title": "Courgette, lemon & mascarpone cupcakes", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT18-20 minutesM", "total_time": "PT33-35 minutesM", "serves": "12 large cupcakes"}, "ingredients": [{"item": "150g grated courgette"}, {"item": "2 unwaxed lemons"}, {"item": "125g unsalted butter, melted and cooled slightly"}, {"item": "125g golden caster sugar"}, {"item": "2 medium eggs, beaten"}, {"item": "½ tsp vanilla paste"}, {"item": "75g self-raising flour"}, {"item": "50g ground almonds"}, {"item": "1 tsp baking powder"}, {"item": "125g icing sugar"}, {"item": "2 x 250g tubs mascarpone, chilled"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Place 12 muffin cases into a 12-hole muffin tin."}, {"step": "Finely grate the zest from the lemons. Place half the zest into a large mixing bowl and put the remainder to one side. Extract the juice from the lemons and set aside. Add the courgette, butter, caster sugar, eggs and vanilla to the mixing bowl, and mix to make a creamy batter. Stir in 2 teaspoons of lemon juice, the flour, ground almonds and baking powder."}, {"step": "Divide the mixture between the cake cases, then bake in the"}, {"step": "oven for 18-20 minutes, or until golden and springy to the touch. Meanwhile, mix 2 tablespoons of lemon juice in a bowl with 2 tablespoons of the icing sugar to make a drizzle. Remove the cakes from the oven and place on a cooling rack. Prick them all a few times with a cocktail stick or skewer, then spoon a little of the drizzle mixture over each one. Leave to cool completely."}, {"step": "Put the remaining icing sugar into a mixing bowl with the mascarpone, 2 tablespoons of lemon juice and all but a few sprinkles of the remaining lemon zest. Beat to make a creamy, smooth icing, adding 1-2 tablespoons of water if the mixture is too stiff. Spoon onto the cooled cakes and swirl attractively, then sprinkle over the leftover zest to finish."}], "nutrition": {"Energy": "1,738 418", "Fat": "31.7", "Saturated Fat": "19.9g", "Carbohydrate": "28.2g", "Sugars": "23.2g", "Protein": "5g", "Salt": "0.2g per cupcake", "Fibre": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Courgette-Lemon-&-Mascarpone-Cupcake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}