{"title": "Courgette lemon drizzle cake", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT1M", "total_time": null, "serves": "8 - 10"}, "ingredients": [{"item": "250g courgettes, coarsely grated"}, {"item": "175g unsalted butter, softened"}, {"item": "175g golden caster sugar"}, {"item": "3 large Waitrose British Blacktail Free Range Eggs, at room temperature"}, {"item": "1 tsp vanilla extract"}, {"item": "100g ricotta"}, {"item": "125g Doves Farm Gluten Free Plain Flour"}, {"item": "85g Polenta Valsugana"}, {"item": "2½ tsp baking powder"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "Finely grated zest 2 lemons and juice of 1 (about 3½ tbsp)"}, {"item": "Handful lemon thyme sprigs"}, {"item": "4 tbsp fondant icing sugar"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and base line a 900g loaf tin. Put the grated courgettes onto a plate lined with a few sheets of kitchen paper. Top with more paper and another plate and leave to drain."}, {"step": "Using electric beaters, cream the butter and sugar together in a large bowl until creamy. Gradually beat in the eggs, followed by the vanilla and ricotta. Mix the flour, polenta, baking powder, bicarb and ¼ tsp salt then sift into the bowl and fold in with a spatula or large metal spoon. Finally fold in most of the lemon zest, the grated courgettes and leaves from a few stalks of lemon thyme."}, {"step": "Spoon the mixture into the loaf tin and bake for 1 hour until risen, golden and a skewer inserted into the middle of the cake comes out clean. Place on a wire rack and leave to cool in the tin."}, {"step": "Mix the lemon juice with the icing sugar and a sprinkling of thyme leaves. Spoon the drizzle over the cooled cake, scatter with the reserved lemon zest and leave to set. Slice and serve."}], "nutrition": {"Energy": "1,504kJ 359kcals", "Fat": "18g", "Saturated Fat": "10.8g", "Carbohydrate": "42.9g", "Sugars": "27.6g", "Protein": "6.4g", "Salt": "0.2g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/CourgetteLemonCake_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}