{"title": "Cranberry, wild rice & squash burgers", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes, plus chillingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 40 minutes, plus chillingM", "serves": "4"}, "ingredients": [{"item": "1kg butternut squash, peeled, deseeded and cut into 2-3cm cubes (about 750g prepared weight)"}, {"item": "4½ tbsp olive oil"}, {"item": "100g red camargue and wild rice mix (or 200g ready-cooked rice)"}, {"item": "1 bunch salad onions, trimmed and sliced"}, {"item": "3 rosemary sprigs, leaves finely chopped"}, {"item": "2 tbsp balsamic vinegar"}, {"item": "150g cranberries"}, {"item": "30g pumpkin seeds"}, {"item": "2 tbsp dried breadcrumbs"}, {"item": "½ x 25g pack flat leaf parsley, chopped"}, {"item": "200g woodland mushrooms, torn if large"}, {"item": "4 brioche buns, halved horizontally"}, {"item": "4 tbsp Waitrose fresh pesto"}, {"item": "60g watercress, rocket and spinach salad"}], "instructions": [{"step": "Preheat the oven to 190˚C, gas mark 5. Toss the squash with 1½ tbsp oil on a large baking tray, season and roast for 45 minutes, until caramelised and tender. Roughly crush the squash on the baking tray with a fork. Meanwhile, cook the rice in salted boiling water, according to pack instructions, then drain well."}, {"step": "Heat 1 tbsp oil in a frying pan set over a medium heat and add the salad onions and rosemary with a pinch of salt. Soften, stirring, for 5 minutes, then add the vinegar, cranberries and pumpkin seeds and cook for 3-4 minutes more, until the cranberries start to burst and no liquid remains. Stir through the breadcrumbs, season, then tip into a large mixing bowl. Add the cooked rice, parsley and roasted squash, gently mixing to combine without crushing the cranberries too much. Divide the mixture into 4 portions and shape into large patties. Chill for 30 minutes to firm up."}, {"step": "Heat 1½ tbsp oil in a large, non-stick frying pan set over a medium-high heat. Fry the patties for about 4 minutes on each side, turning them carefully, until golden and piping hot, then remove and keep warm. Wipe out the frying pan and return to a high heat with the final ½ tbsp oil. Add the mushrooms, season and stir-fry for 2-3 minutes, until lightly browned."}, {"step": "Lightly toast the brioche buns, cut-side up, under a hot grill. Spread the base of each bun with 1 tbsp pesto, then top with a burger, the mushrooms and some salad leaves, finishing each with a bun top."}], "nutrition": {"Energy": "2,841kJ 680kcals", "Fat": "35g", "Saturated Fat": "8.6g", "Carbohydrate": "70g", "Sugars": "15g", "Protein": "16g", "Salt": "1g", "Fibre": "11g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/200930_014_CranberryBurger_r1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}