{"title": "Cranberry, hazelnut and sherry tart", "tags": null, "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT1 hourM", "total_time": "PT1 hour 25 minutes, plus coolingM", "serves": "10-12"}, "ingredients": [{"item": "500g block shortcrust pastry"}, {"item": "275g blanched hazelnuts"}, {"item": "200g unsalted butter"}, {"item": "175g golden caster sugar"}, {"item": "2 tsp vanilla bean paste or vanilla extract"}, {"item": "1 lemon, zest"}, {"item": "3 eggs, beaten"}, {"item": "4 tbsp plain flour"}, {"item": "3 tbsp sherry"}, {"item": "100g fresh or frozen cranberries"}, {"item": "3 tbsp demerara sugar"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Roll out the pastry to 0.5cm thick and use to line a 24cm fluted tart tin. Prick the base with a fork, leaving the excess pastry overhanging. Line with baking parchment, fill with baking beans and bake blind for 25 minutes. Remove the paper and beans, then bake for 10 minutes more until the tart case is cooked through, smells biscuity and is starting to brown. Trim off the excess pastry with a knife."}, {"step": "Meanwhile, put the hazelnuts on a tray and bake for 5-10 minutes until a shade darker. Leave to cool, then pulse in a food processor until finely chopped, but not a powder. Transfer to a large bowl. Put the butter, sugar, vanilla, lemon zest and a good pinch of salt in a food processor. Whizz until light and fluffy. Add to the hazelnuts with the eggs, flour and sherry. Beat until thoroughly combined."}, {"step": "Transfer the mixture to the tart shell and smooth out. Scatter over the cranberries (no need to defrost if frozen) and demerara sugar, then bake for about 25 minutes, until the tart is golden and has firmed up around the edges but retains just a little wobble towards the centre. Allow to cool completely, then remove from the tin, set on a platter and serve. If making ahead, keep chilled for up to 2 days and bring up to room temperature to serve."}], "nutrition": {"Energy": "Per serving (10) 2971kJ 715kcals", "Fat": "51g", "Saturated Fat": "18g", "Carbohydrate": "49g", "Sugars": "25g", "Protein": "11g", "Salt": "0.4g", "Fibre": "5.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cranberry-sherry-tart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}