{"title": "Creamy chicory and comté gratin", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT25M", "total_time": "PT35M", "serves": "4 as a side"}, "ingredients": [{"item": "30-40g unsalted butter"}, {"item": "4 chicory bulbs (red or white), trimmed and halved lengthways (don’t separate the leaves)"}, {"item": "2 garlic cloves, sliced"}, {"item": "½ x 15g pack oregano, leaves finely chopped, plus extra leaves to serve"}, {"item": "2 tsp wholegrain mustard"}, {"item": "100ml white wine"}, {"item": "125ml double cream"}, {"item": "40g fresh white breadcrumbs"}, {"item": "40g comté or gruyère, grated"}, {"item": "1 tbsp olive oil"}], "instructions": [{"step": "Put a large, ovenproof frying pan on a medium heat; add 30g butter. Working in batches, gently fry the chicory, cut-side down, for 3-4 minutes, until light golden. Turn over and fry for 2 more minutes, until light golden but not brown; season and transfer to a board."}, {"step": "Put the garlic and oregano in the pan with a little extra butter, if needed; fry for 1 minute, stirring. Return the chicory to the pan in a single layer. Mix the mustard into the wine; pour around the chicory, then bring to the boil. Turn down the heat; simmer for 5 minutes, until most of the liquid is gone and the chicory is tender. Preheat the grill to high."}, {"step": "Pour the cream around the chicory and let it bubble up, then season. Scatter over the breadcrumbs and grated cheese, then drizzle with the oil. Put under the grill for 4-6 minutes, until golden brown, crisp on top and oozy at the sides. Scatter with more oregano leaves before serving."}], "nutrition": {"Energy": "1,477kJ 357kcals", "Fat": "31g", "Saturated Fat": "17g", "Carbohydrate": "9g", "Sugars": "2.5g", "Protein": "5.5g", "Salt": "0.5g", "Fibre": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/20201215_JBWaitroseMag_March2021_Harvest_Recipe_CreamyChicoryAndComteGratin_BrokenInto.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}