{"title": "Creamy linguine with charred courgettes & olives", "tags": null, "planning": {"prep_time": "PT15 minutesM", "cook_time": "PT30 minutesM", "total_time": "PT45 minutesM", "serves": "4"}, "ingredients": [{"item": "300g essential Linguine, or other vegan pasta"}, {"item": "400g (about 2 medium) courgettes"}, {"item": "2 tbsp olive oil"}, {"item": "100g black olives, pitted and roughly chopped"}, {"item": "Chilli flakes, to serve (optional)"}, {"item": "For the cashew cream sauce"}, {"item": "80g cashew nuts"}, {"item": "300ml oat drink"}, {"item": "½ tsp salt"}, {"item": "1 tsp garlic granules"}, {"item": "Juice of ½ lemon"}, {"item": "½ tsp ground black pepper"}, {"item": "¼ tsp chilli powder"}], "instructions": [{"step": "Boil the cashews in water for 15 minutes. Drain and rinse under cold running water. Blend all the ingredients for the sauce together until smooth. Set aside."}, {"step": "Cook the linguine, according to the pack instructions. Meanwhile, heat a griddle pan or grill to a high heat. Finely slice the courgettes into 0.5cm strips, toss in 1 tbsp oil and a pinch of salt. Cook for about 2-3 minutes each side, until they have nice charred line marks but remain a little firm. Cool slightly, then cut into bitesize pieces."}, {"step": "When the pasta is cooked, heat a large frying pan over a medium heat and add the cashew cream. Heat gently, stirring regularly. Using tongs, add the cooked linguine to the frying pan, leaving some of its cooking water clinging to the pasta."}, {"step": "Add the chopped olives and half the grilled courgettes. Mix well. If the sauce is too thick, add some pasta cooking water to loosen. If it is too thin, leave it to thicken on a medium heat for a few minutes. Season if needed. Serve scattered with the remaining courgettes and chilli flakes if you like."}], "nutrition": {"Energy": "2,288kJ 546kcals", "Fat": "24g", "Saturated Fat": "3.8g", "Carbohydrate": "63g", "Sugars": "8.5g", "Protein": "16g", "Salt": "2g", "Fibre": "8.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Creamylinguinewithcourgettesandolives.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}