{"title": "Creamy fish pie", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT60M", "total_time": "PT1 hour 20 minutes, plus 10-15 minutes standing timeM", "serves": "8"}, "ingredients": [{"item": "2kg large, waxy potatoes, peeled and cut into 2cm cubes"}, {"item": "1kg fresh Icelandic prime cod fillets"}, {"item": "400g pack Waitrose Fruits de Mer, defrosted"}, {"item": "75g butter"}, {"item": "2 onions, finely chopped"}, {"item": "10g pack fresh lemon thyme, chopped"}, {"item": "2 x 350g tubs Waitrose Fresh Cheese Sauce"}, {"item": "170ml pot single cream"}, {"item": "50g Gruyère cheese, grated"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Add the potatoes to a large saucepan of boiling water. Return to the boil and cook for 5-7 minutes until just tender. Drain."}, {"step": "Pat the cod and seafood dry with kitchen paper. Cut the cod into chunky pieces and season lightly. Melt half the butter in a large frying pan and fry the cod in 2 batches, until opaque. Transfer to a plate, add the seafood to the pan and fry for 2-3 minutes, until the prawns turn pink and are cooked through. Transfer to the plate with the cod, pouring away any excess liquid."}, {"step": "Melt the remaining butter in the pan and fry the onions for 3-4 minutes or until softened. Stir in the thyme and remove from the heat."}, {"step": "Tip the cheese sauce into a saucepan and stir in the cream. Gently heat the sauce through. Arrange half the potato chunks in the base of a large, shallow ovenproof dish with a 3.5-4 litre capacity. Arrange the cod and seafood over the top, making sure all the ingredients are evenly distributed."}, {"step": "Pour half the cheese sauce over and scatter with the onions. Arrange the remaining potatoes over the top in an even layer, and spoon over the remaining sauce. Sprinkle with the cheese. Bake in the centre of the oven for about 45 minutes or until the surface of the pie is golden. Leave to stand for 10-15 minutes before serving. Serve with broccoli."}], "nutrition": {"Energy": "2,477kj/590kcals", "Fat": "23.1g", "Saturated Fat": "13.7g", "Carbohydrate": "51.3g", "Sugars": "5.3g", "Salt": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Creamy_fish_pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}