{"title": "Crêpes Suzette - Waitrose Cookery School", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT40M", "total_time": null, "serves": "6 pancakes"}, "ingredients": [{"item": "120g plain flour"}, {"item": "Pinch of salt"}, {"item": "1 medium egg, lightly beaten"}, {"item": "300ml milk"}, {"item": "Oil or butter, for frying"}, {"item": "20g Demerara sugar"}, {"item": "500ml orange juice"}, {"item": "4 oranges, segmented"}, {"item": "20g caster sugar"}, {"item": "15g unsalted butter, diced"}, {"item": "40ml Grand Marnier"}], "instructions": [{"step": "To begin, sift the flour and salt into a bowl. Make a well in the centre. Pour in the egg and about 50ml milk and start whisking, gradually incorporating the flour into the liquid. When you have a smooth batter in the middle, add a bit more milk. Continue until all the milk is added, all the flour incorporated and the batter is slightly thicker than single cream. Add a touch more milk if needed. Incorporating the flour gradually like this is the best way to avoid lumps. Alternatively, make the batter in a food processor."}, {"step": "Cover the batter and leave to stand for 30 minutes. This allows the starch in the batter to swell and soften, giving a lighter result. If it thickens while resting, add a little more milk to bring it back to the right consistency. The batter must be quite thin or you'll end up with thick pancakes with big holes in, as a result of not being able to swirl it around the pan quickly enough before it sets."}, {"step": "For the orange juice reduction, first make a light caramel by placing the sugar in a pan over a low to medium heat until just melted and golden. Turn up the heat and the orange juice, then leave to simmer gently for around 10-15 minutes or until reduced by half."}, {"step": "Heat a heavy-based frying or crêpe pan (about 24cm diameter) and rub with a scant amount of oil or butter to just coat the base of the pan, turning and tilting as you go. Cook for about 1 minute on each side, flipping the crêpe when it starts to bubble and brown underneath. Repeat to make 6 pancakes. Keep the crêpes warm on a plate covered with foil while you cook the remaining batter."}, {"step": "Fold each crêpe in half and then half again with 2 orange segments in between each fold."}, {"step": "For the sauce, first make a light caramel by melting the sugar and butter in a pan and then add the orange juice reduction."}, {"step": "Place the folded crêpes into the pan with the sauce and the rest of the orange segments. After 1 minute, flambé the crêpes with the Grand Marnier. Once the flame has died away, transfer to warm plates and serve immediately."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/CrepesSuzette_2048Final.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}