{"title": "Crispy beer-battered fish", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT12M", "total_time": "PT22M", "serves": "2"}, "ingredients": [{"item": "½ tsp dried active or quick yeast"}, {"item": "250ml Duchy Originals From Waitrose Organic Golden Ale"}, {"item": "150g self-raising flour"}, {"item": "1 tbsp cornflour"}, {"item": "1 tsp caster sugar"}, {"item": "½ tsp table salt"}, {"item": "Large pinch white pepper"}, {"item": "Vegetable or ground nut oil, for deep frying"}, {"item": "2 x 250g firm white fish fillets, such as cod or haddock"}, {"item": "Thick cut chips, mushy peas, lemon wedges, salt and vinegar, to serve"}], "instructions": [{"step": "To make the batter, mix the yeast and ale together in a jug and leave to stand for 10 minutes until the yeast is soft."}, {"step": "Meanwhile place the flour, cornflour, sugar, salt and pepper into a large bowl. Gradually whisk in the ale mixture until smooth. Leave the batter to stand for a further 15 minutes."}, {"step": "Heat the oil in a deep-fat fryer or large, deep pan (it should be no more than half full) to 170°C, or until a small piece of bread turns golden and sizzles in under 20 seconds."}, {"step": "One at a time, hold the fish fillets by the tail end and dip into the batter, allowing any excess to drip off. Carefully lower each fillet into the hot oil and fry for about 6 minutes or until golden and crisp and cooked through."}, {"step": "Remove with a fish slice, drain on kitchen paper and keep warm while cooking the other fillet. If you wish, drizzle any excess batter into the oil and cook for a few minutes to make some golden ‘scraps’. Serve with the chips and other accompaniments."}], "nutrition": {"Energy": "2,673kJ 634kcals", "Fat": "16.5g", "Saturated Fat": "2.8g", "Carbohydrate": "71g", "Sugars": "6.1g", "Protein": "50.3g", "Salt": "1.1g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Beer-Battered-Fish_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}