{"title": "Crispy potato and beetroot cake with sweet mustard sauce", "tags": null, "planning": {"prep_time": "PT20 minutes, plus cooling and standingM", "cook_time": "PT1 hour 45 minutesM", "total_time": null, "serves": "8"}, "ingredients": [{"item": "25g butter, cubed, plus extra for greasing"}, {"item": "2kg large Maris Piper potatoes, peeled and halved"}, {"item": "1 onion"}, {"item": "4 tbsp olive oil"}, {"item": "1 bunch (500g) beetroot, washed, trimmed and peeled"}, {"item": "100g Jarlsberg cheese, rind removed"}, {"item": "1 tbsp fresh lemon thyme leaves, plus extra to garnish"}, {"item": "4 tbsp Dijon mustard"}, {"item": "1tbsp English mustard"}, {"item": "2tbsp white wine vinegar"}, {"item": "1tbsp caster sugar"}, {"item": "3tbsp extra virgin olive oil"}, {"item": "2tbsp roughly chopped fresh dill leaves"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5.  Generously grease a 23cm loose-bottom spring-form tin with butter, line the base with baking parchment and grease that too.  Place a baking tray in the oven to heat up. Place the potatoes into a large pan of salted water and bring to the boil.  Cook for just 5 minutes then drain and leave to cool completely.  Meanwhile, using a box grater or food processor with grating attachment, coarsely grate the onion and squeeze to remove any juice.  Divide the onion evenly between 2 large mixing bowls. Coarsely grate the cooled potatoes into one bowl, tossing with the oil and some seasoning as you go.  Coarsely grate the beetroot and Jarlsberg into the other bowl and toss with the thyme and some seasoning. Scatter half of the potato mixture into the tin, without pressing it down, season, then scatter the beetroot mixture over the top, again without pressing down.  Season again then finish with the remaining potato, without pressing it down, and dot with the butter.  Cover with a generous tent of foil that doesn't touch the top.  Bake on the preheated tray for 1 hour, then remove the foil and cook for a further 30 minutes or until tender throughout and the top is crisp and golden.  Remove from the oven and leave to stand for 20 minutes.  Meanwhile, whisk the sauce ingredients together with 2 tablespoons warm water and season to taste.  Loosen the edges of the cake with a knife, then remove the tin and parchment and slide onto a serving plate.  Sprinkle with extra thyme leaves before cutting into wedges to serve, with the sauce alongside."}], "nutrition": {"Energy": "1,833kj 437kcals", "Fat": "19.9g", "Saturated Fat": "5.6g", "Carbohydrate": "53.6g", "Sugars": "10.6g", "Protein": "10.9g", "Salt": "1.5g", "Fibre": "4.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/PotatoBeetrootCake2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}