{"title": "Crumpets", "tags": null, "planning": {"prep_time": "PT25 minutes, plus provingM", "cook_time": "PT40M", "total_time": "PT65 minutes, plus provingM", "serves": "8"}, "ingredients": [{"item": "150g strong white bread flour"}, {"item": "100g plain flour"}, {"item": "1 tsp (5g) easy bake yeast"}, {"item": "1⁄2 heaped tsp caster sugar"}, {"item": "150ml whole milk"}, {"item": "40ml clarified butter (or vegetable oil)"}, {"item": "1⁄2 heaped tsp baking powder"}, {"item": "1⁄4 heaped tsp bicarbonate of soda"}, {"item": "1⁄2 heaped tsp fine salt"}], "instructions": [{"step": "Mix the flours in a large bowl, make a well in the centre and add the yeast and sugar. Warm the milk with 1 tbsp clarified butter (or oil) and 100ml water, pour into the well and leave for 2-3 minutes to let the yeast dissolve."}, {"step": "Whisk everything together to a thick batter, then clean the sides of the bowl with a spatula. Cover with cling film and set aside until it triples in volume (this will take about 2 hours; you can leave it for up to 4 hours, but don’t worry if it starts to collapse)."}, {"step": "Once the batter has proved, mix the baking powder, bicarbonate of soda and salt with another 125ml water in a small bowl. Whisk into the batter until combined, then cover with cling film and set aside for another 30-35 minutes, until doubled in size."}, {"step": "When ready to cook, grease your crumpet rings with some of the remaining clarified butter (or oil) and add to a large, flat, heavy-based non-stick frying pan, set over a medium-low heat; you’ll most likely need to cook them in batches, probably 4 at a time. Turn the heat down to its lowest setting and carefully ladle the batter into the crumpet rings, filling them just over halfway."}, {"step": "Cook for about 15 minutes, until the tops are covered with burst bubbles and start to look quite dry. Confidently flip each crumpet in its ring and cook for a final 2-3 minutes. Transfer to a wire rack, remove the rings and leave to cool. Repeat using up the remaining batter, re-greasing the rings as needed."}, {"step": "Serve the crumpets while still warm, or toast to reheat, spreading with salted butter and your choice of toppings (we love floral honey or Marmite). The crumpets are best eaten on the day of making, but they’ll keep in an airtight container for up to 3 days, or in the freezer for up to 1 month."}], "nutrition": {"Energy": "698kJ 166kcals", "Fat": "5.3g", "Saturated Fat": "3.2g", "Carbohydrate": "25.3g", "Sugars": "1.7g", "Protein": "4.2g", "Salt": "0.8g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Crumpets.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}