{"title": "Crunchy papaya salad with fiery passion fruit dressing", "tags": [{"tag": "Low Fat"}], "planning": {"prep_time": "PT10-15 minutesM", "cook_time": "PT5M", "total_time": "PT15-20 minutesM", "serves": "4"}, "ingredients": [{"item": "100g sugar snap peas"}, {"item": "200g red cabbage, very finely sliced"}, {"item": "4 salad onions, halved and thinly sliced lengthways into strips"}, {"item": "28g pack coriander"}, {"item": "25g pack Thai basil"}, {"item": "1 large papaya, halved, seeds removed, peeled and thinly sliced"}, {"item": "4 Little Gem lettuce hearts, each cut into 4 wedges"}, {"item": "For the dressing"}, {"item": "2 passion fruit"}, {"item": "1 red chilli, deseeded and finely chopped"}, {"item": "Juice 2 limes"}, {"item": "2 tsp Cooks' Ingredients Nam Pla Fish Sauce"}, {"item": "20g piece fresh ginger, finely grated"}, {"item": "50g Love Life roasted peanuts, finely chopped"}], "instructions": [{"step": "Bring a small pan of water to the boil, add the sugar snap peas and cook for 2–3 minutes until tender but still crisp. Drain and run under cold water to refresh. Drain well then halve lengthways and place in a large mixing bowl."}, {"step": "Add the red cabbage to the bowl with the salad onions. Remove the stems from the coriander, chop finely and add to the bowl, then roughly chop the leaves and add those. Pick the Thai basil leaves off the stems and gently tear with your fingers into large pieces then toss in the bowl with the other ingredients. Gently stir through the papaya."}, {"step": "Arrange the lettuce wedges on a serving platter and spoon the salad on top."}, {"step": "Halve the passion fruit and scoop out the pulp with a teaspoon into a bowl. Add the chilli, lime juice, fish sauce and ginger and mix together well. Drizzle the dressing over the salad and sprinkle over the chopped peanuts to serve."}], "nutrition": {"Energy": "603kJ 144kcals", "Fat": "7.3g", "Saturated Fat": "1.4g", "Carbohydrate": "12.7g", "Sugars": "10.1g", "Protein": "6.9g", "Salt": "0.7g", "Fibre": "4.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Crunchy-papaya-salad-with-fiery-passion-fruit-dressing.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}