{"title": "Cuban-style beef & olive stew", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 25 minutesM", "serves": "4"}, "ingredients": [{"item": "2 tbsp olive oil"}, {"item": "400g pack lean diced British beef braising steak"}, {"item": "1 large onion, finely sliced"}, {"item": "2 garlic cloves, crushed"}, {"item": "1 red pepper, deseeded and finely sliced"}, {"item": "1 tsp ground cumin"}, {"item": "½ tsp hot smoked paprika"}, {"item": "½ x 28g pack coriander, leaves whole, stalks finely chopped"}, {"item": "400g can chopped tomatoes"}, {"item": "350g can Fragata Manzanilla Olives Filled with Chorizo, drained"}, {"item": "500g cooked rice, to serve"}], "instructions": [{"step": "Preheat the oven to 160˚C, gas mark 3. Heat 1 tbsp oil in a lidded casserole dish or large ovenproof pan over a medium-high heat. Season the meat and brown on all sides for about 5 minutes. Tip into a bowl and set aside."}, {"step": "Add the remaining 1 tbsp oil to the pan and fry the onion over a medium heat for 5 minutes. Stir in the garlic and fry for 2 minutes. Add the red pepper, spices and coriander stalks; fry for 2 minutes. Return the beef to the pan then add the tomatoes. Half-fill the can with water to rinse out and add to the pan. Stir everything, season with black pepper, cover and put in the oven for 30 minutes. (Or simply tip everything into a slow cooker and set to medium for 3 hours.)"}, {"step": "Uncover the stew, stir in the olives and return to the oven for 30 minutes. (If you’re using a slow cooker, add the olives for the last hour.) Divide the rice between plates, top with the stew and scatter over the coriander leaves to serve."}], "nutrition": {"Energy": "1,831kJ 447kcals", "Fat": "17g", "Saturated Fat": "3.5g", "Carbohydrate": "45.3g", "Sugars": "7.5g", "Protein": "26.7g", "Salt": "1.77g", "Fibre": "3.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Cuban-style-beef-stew.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}