{"title": "Date and hazelnut chocolate fudge cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8-10"}, "ingredients": [{"item": "Vegetable oil, for greasing"}, {"item": "100g LOVE Life Soft Dates, chopped"}, {"item": "125ml very hot coffee, or boiling water"}, {"item": "150g caster sugar"}, {"item": "4 large eggs"}, {"item": "½ tsp salt"}, {"item": "150g unsalted butter, at room temperature"}, {"item": "150g hazelnut chocolate spread"}, {"item": "250g essential Waitrose Plain Flour"}, {"item": "2 tsp baking powder"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "For icing and middle"}, {"item": "100g butter, at room temperature"}, {"item": "100g icing sugar"}, {"item": "50g cocoa powder"}, {"item": "150g hazelnut chocolate spread"}, {"item": "80g LOVE Life Hazelnuts, toasted in a dry frying pan and roughly chopped"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line 2 loose-bottom tins, 20cm diameter, with baking paper and brush the sides with a little vegetable oil. Put the chopped dates in a heat-proof bowl and pour the coffee (or water) over them. Leave to stand for at least 30 minutes. Blitz in a food processor until you have a paste, then set aside."}, {"step": "Beat half the sugar with the eggs and salt until pale and creamy in colour. Then in a separate large bowl beat the remaining sugar with the butter until pale and fluffy."}, {"step": "Add the eggs to the butter mixture with the hazelnut chocolate spread and the date paste. Sieve the flour with baking powder and bicarbonate of soda into the mixture and, using a rubber spatula, incorporate the dry ingredients with the wet, until smooth. Spoon evenly between the 2 prepared cake tins and place in the middle of the oven for 30-35 minutes, until cooked through. Set aside to cool while you make the icing."}, {"step": "Whisk the butter until soft, then gradually whisk in the icing sugar until pale and fluffy. Add the cocoa powder and 3 tbsp boiling water and mix until you have a paste, then add the hazelnut chocolate spread and combine until smooth. Spread half of the icing for the middle of the cake and the rest for the top. Finally, scatter over the toasted choppedhazelnuts before serving."}], "nutrition": {"Energy": "2794.912kJ 668kcals", "Fat": "39.6g", "Saturated Fat": "18.1g", "Carbohydrate": "68.4g", "Sugars": "47.9g", "Salt": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/Date and hazlenut chocolate fudge cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}