{"title": "Date cake with salted honey caramel", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes, plus cooling and chillingM", "cook_time": "PT35M", "total_time": "PT1 hour 20 minutes, plus cooling and chillingM", "serves": "12-16"}, "ingredients": [{"item": "130g softened butter, plus extra for greasing"}, {"item": "330g pitted dates, roughly chopped"}, {"item": "1½ tsp bicarbonate of soda"}, {"item": "300g Tate & Lyle Light Muscovado Sugar"}, {"item": "2 eggs"}, {"item": "420g self-raising flour, sifted"}, {"item": "2 tsp vanilla extract"}, {"item": "70g Rowse Squeezy Honey"}, {"item": "1 tsp fine salt"}, {"item": "100g walnuts, toasted and roughly chopped"}, {"item": "80g caster sugar"}, {"item": "1 tbsp Rowse Squeezy Honey"}, {"item": "60ml double cream"}, {"item": "100g unsalted butter"}, {"item": "½ tsp sea salt flakes"}, {"item": "180g unsalted butter (use Lurpak for a whiter buttercream)"}, {"item": "360g icing sugar"}, {"item": "1 tbsp Rowse Squeezy Honey"}, {"item": "about 1 tbsp whole milk (if required)"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line the bases of 3 x 20cm sandwich tins. Put the dates and bicarbonate of soda in a medium bowl, then cover with 260ml boiling water."}, {"step": "As the dates soak, make the cakes. Beat together the butter and muscovado sugar using electric beaters or in a freestanding mixer, until light and fluffy. Beat in the eggs, one at a time, alternating with a few spoonfuls of the flour, followed by the vanilla extract and honey. Fold through the remaining flour, the salt and walnuts, then the dates in their liquid. Divide between the tins, then bake for 30-35 minutes, testing with a skewer; you may need to bake on 2 shelves, rotating each tin after 20 minutes. When the cakes are cooked, remove from the oven and leave to cool in their tins for 10 minutes, before turning onto wire racks to cool completely."}, {"step": "As the cakes are cooking, make the salted caramel. In a saucepan over a low heat, melt the sugar with a little water until dissolved; brush excess sugar from the sides of the pan with water to stop it crystallising. Bubble for 4-5 minutes, or until you have an amber caramel (about 170°C on a sugar thermometer). Add the honey and double cream – take care as it will splutter – followed by the butter. Bubble for a few more minutes, until it reaches 110°C. Transfer to a shallow bowl, sprinkle in the sea salt and cover the surface with cling film; chill for 45 minutes."}, {"step": "To make the buttercream, whisk the butter with electric beaters or in a freestanding mixer until light and fluffy, then gradually sift in the icing sugar, until all of it has been incorporated. Add 2 tbsp of the cooled salted caramel and the honey and continue to whisk for 2-3 minutes, until light and fluffy. Beat in about 1 tbsp whole milk, if needed, to loosen a little."}, {"step": "Place one sponge onto a board or flat plate and spread the top with 1 /3 of the buttercream, then put another sponge on top. Spread this with another 1/3 of the buttercream. Top with the final sponge and pile most of the remaining buttercream on top. Use a palette knife to spread it thinly and evenly over the sponge until it reaches the edges of the cake, then start to spread the remaining buttercream down the sides, rotating the board or plate as you go (a turntable helps). The idea is to get a slightly translucent coating all over the cake and expose some of the sponge underneath. If any buttercream remains, spread it over the top of the cake. Chill for 30 minutes."}, {"step": "Spoon the salted caramel on top of the cake, in the centre, then carefully coax it towards the edges with a palette knife (if the caramel is too set, you may need to heat it up in a small pan or microwave for 10-15 seconds). The caramel should start to drip slightly down the edges of the cake – encourage it with your knife if need be. Top with your decoration of choice (we made a walnut praline; see below)."}, {"step": "Toast 50g walnuts in a frying pan over a medium heat for 1-2 minutes, until browned in places. Add 100g caster sugar in an even layer. Cook for 2-3 minutes (gently swirl to ensure the nuts don’t burn), until the sugar has melted and turned golden brown. When all the sugar crystals have dissolved, sprinkle in ½ tsp sea salt flakes, tip onto a parchment-lined baking tray and leave to harden. Finish by chopping into rough pieces"}], "nutrition": {"Energy": "Per serving (16) 2599kJ 620kcals", "Fat": "28g", "Saturated Fat": "15g", "Carbohydrate": "84g", "Sugars": "65g", "Protein": "5.5g", "Salt": "1.1g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/Baking/Date-cake-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}