{"title": "Perfect apple pie", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT35M", "total_time": "PT60 minutes, plus cooling M", "serves": "8"}, "ingredients": [{"item": "500g essential Waitrose plain flour, plus extra for rolling"}, {"item": "250g chilled essential Waitrose butter, diced"}, {"item": "100g essential Waitrose sultanas"}, {"item": "150g golden caster sugar, plus extra for sprinkling"}, {"item": "Zest and juice of 1 lemon"}, {"item": "3–4 Bramley apples"}, {"item": "2 essential Waitrose eating apples"}, {"item": "1 tsp ground mixed spice"}, {"item": "3 tbsp essential Waitrose plain flour"}, {"item": "Milk, for brushing"}], "instructions": [{"step": "Begin by making the pastry. Sift the flour then place in a food processor. Add the butter and whizz to form crumbs. Add 4–5 tbsp cold water and pulse to form a firm pastry. Remove from the bowl, roll the pastry into a ball then wrap in clingfilm and chill for 30 minutes."}, {"step": "Meanwhile, place the sultanas, sugar and lemon zest and juice in a large bowl. Peel, core and thinly slice the apples, adding them to the bowl as each one is done. Sprinkle over the spice and flour."}, {"step": "Preheat the oven to 200ºC, gas mark 6. Roll out two-thirds of the pastry into a large round and use to line a 23–24cm pie dish, leaving any excess pastry to overhang the edge. Spoon the apple mixture into the pie dish, making sure it’s layered as compactly as possible. Dampen the edge of the pastry along the rim with milk."}, {"step": "Roll the remaining pastry into a circle large enough to cover the filling and lay on top of the pie. Using a sharp knife, trim the excess pastry away and crimp the edges to seal. Brush the pie with milk and sprinkle with a little sugar. Make a slit or two in the top then place on a baking tray and bake for 35–40 minutes until golden brown. Leave to cool for at least 45 minutes before slicing and serving with cream or custard."}], "nutrition": {"Energy": "2677.76kJ 640kcals", "Fat": "26.8g", "Saturated Fat": "16.5g", "Carbohydrate": "92g", "Sugars": "37.8g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/2012wkwe-September-rh11.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}