{"title": "Devilled crab rosti with poached eggs", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2"}, "ingredients": [{"item": "½ lemon, zested then cut into wedges"}, {"item": "400g pack Swiss-style rösti"}, {"item": "100g pack Fifty Fifty Cornish crab"}, {"item": "3 salad onions, finely sliced"}, {"item": "½ x 20g pack dill, finely chopped"}, {"item": "2½ tsp vegetable oil"}, {"item": "2 eggs"}, {"item": "250g essential cherry tomatoes, halved"}, {"item": "260g essential spinach, washed"}, {"item": "2 tbsp garlic mayonnaise"}], "instructions": [{"step": "In a large bowl, mix together the lemon zest, rösti mix, crab, salad onions and most of the dill, breaking up the potato and stirring thoroughly. Heat 1½ tsp oil in a medium non-stick frying pan. Tip the rösti mixture into the pan and press down firmly with a spatula, to make one giant rösti. Reduce the heat to medium and fry for 10 minutes. Place a large plate upside down over the pan, hold together and flip over then slide the rösti back into the pan; fry for 5 minutes, until golden. Slide onto a plate, quarter and keep warm."}, {"step": "Meanwhile, bring a pan of water to the boil and once the rösti is cooked, crack in the eggs. Simmer very gently for about 3 minutes, then remove with a slotted spoon and drain."}, {"step": "In the rösti pan, heat 1 tsp oil over a high heat. Add the tomatoes, season and toss to coat; fry for 2-3 minutes, stirring regularly, until blistered and juicy, then transfer to 2 serving plates. Turn down the heat and add the spinach; stir until wilted then add to the plates along with the rösti and poached eggs. Scatter over the remaining dill; serve with lemon wedges and the garlic mayonnaise."}], "nutrition": {"Energy": "2,012kJ 480kcals", "Fat": "21g", "Saturated Fat": "3.4g", "Carbohydrate": "41g", "Sugars": "6.8g", "Protein": "25g", "Salt": "1.7g", "Fibre": "7.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/crabrosti.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}