{"title": "Devonshire splits", "tags": null, "planning": {"prep_time": "PT25 minutes, plus proving and coolingM", "cook_time": "PT15M", "total_time": "PT40M", "serves": null}, "ingredients": [{"item": "500g strong white bread flour, plus extra for dusting"}, {"item": "½ teaspoon salt"}, {"item": "25g caster sugar"}, {"item": "10g easy-blend yeast"}, {"item": "25g unsalted butter, melted, plus extra to grease"}, {"item": "300ml hand hot milk"}, {"item": "To serve"}, {"item": "Whipped or clotted cream"}, {"item": "Strawberry or raspberry jam"}, {"item": "Icing sugar, for dusting"}], "instructions": [{"step": "Put the flour, salt, sugar and yeast in a large bowl. Add the butter and milk. Mix with a round bladed knife to make a fairly soft dough, adding a dash more hot milk or water if the dough feels dry. Turn out onto a floured surface and knead for 10 minutes to make a smooth, elastic dough. (Alternatively knead for 5 minutes using a free-standing mixer fitted with a dough hook). Place in a lightly greased bowl, cover with cling film and leave in a warm place for about 1 hour or until the dough has doubled in size."}, {"step": "Grease a large baking sheet. Punch the dough to deflate it and turn out onto a floured surface. Divide into 12 pieces and shape each into a ball. Space well apart on the baking sheet. Cover loosely with greased cling film and leave for 20 minutes. Preheat the oven to 200°C, gas mark 6."}, {"step": "Bake the buns for 10 - 15 minutes until risen and pale golden. Transfer to a wire rack to cool."}, {"step": "Make a deep diagonal slit through the top of each bun. Ease open with a knife and fill with the cream and jam. Serve dusted with icing sugar."}], "nutrition": {"Energy": "1104.576kJ 264kcals", "Fat": "8.7g", "Saturated Fat": "5.2g", "Carbohydrate": "40.1g", "Sugars": "9g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/2012-april-sm-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}