{"title": "Dhruv Baker's Cauliflower cheese with walnuts and cumin", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8"}, "ingredients": [{"item": "568ml whole milk"}, {"item": "½ onion, studded with 6 cloves"}, {"item": "2 bay leaves"}, {"item": "10 black peppercorns"}, {"item": "1 cauliflower, cut into florets"}, {"item": "50g unsalted butter"}, {"item": "½ x tsp cumin seeds"}, {"item": "50g plain flour"}, {"item": "100ml soured cream"}, {"item": "75g grated Cheddar"}, {"item": "½ x125g pack Cooks Ingredients breadcrumbs (dried)"}, {"item": "25g walnuts, whizzed in a food processor"}], "instructions": [{"step": "Preheat the oven to 200C, gas mark 6. Heat the milk gently in a saucepan with the clove studded onion, bay leaves and peppercorns. Take off the heat when it starts to simmer. Strain."}, {"step": "Bring a large pan of salted water to the boil then add the cauliflower and cook for 5 minutes.  Drain well and set aside in the colander to drain off any excess water."}, {"step": "In another medium sized saucepan melt the butter and when foaming add the cumin seeds and stir for a minute then add the flour stirring continuously.  When the mixture takes on a golden colour and starts to smell nutty add the milk 1-2 ladles at a time (the milk should still be hot at this point).  Once you have a smooth paste you can add the milk more quickly.  If the mixture is a bit thick you can add some more milk."}, {"step": "When all the milk is added, stir in 50g of the cheese and the soured cream. Season to taste"}, {"step": "Place the cauliflower florets into a 28-30cm rectangular oven-proof dish and pour over the cheese and cumin sauce."}, {"step": "Mix the breadcrumbs, walnuts and remaining 25g cheese together then sprinkle over the top of the mixture and bake in the preheated oven for 20 minutes or till the top is bubbling and golden brown."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/Col cheese.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}