{"title": "Donna Hay's beef & caramelised onion pies", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 tbsp olive oil, plus extra for brushing"}, {"item": "2 onions, sliced"}, {"item": "1 tbsp tarragon leaves"}, {"item": "250ml beer or lager"}, {"item": "50g soft dark brown sugar"}, {"item": "1 tbsp Dijon mustard"}, {"item": "Sea salt and freshly cracked black pepper"}, {"item": "4 x 220g lean fillet steaks"}, {"item": "3 x 320g packs Jus-Rol All Butter Puff Pastry Sheets"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "1 tbsp milk"}, {"item": "Serve with tomato relish, such as Waitrose Tomato Chutney"}], "instructions": [{"step": "Preheat oven to 180°C, gas mark 4. Heat the oil in a large non-stick frying pan over a low heat, add the onions and tarragon, and cook for 15-20 minutes or until golden."}, {"step": "Increase heat to high. Add the beer and sugar, and cook for another 10 minutes or until thick and caramelised. Stir through the mustard, salt and pepper. Set aside to cool and refrigerate until ready to use."}, {"step": "Heat a large non-stick frying pan over high heat. Brush the steaks with oil and sprinkle with salt and pepper. Cook for 6-8 minutes, browning on all sides. Refrigerate until completely cool."}, {"step": "Cut 4 x 14cm pastry rounds for the base and 4 x 17cm rounds for the tops. Place the steaks in the middle of each pastry base and top with caramelised onion. Lightly beat the egg with the milk and brush around the edges of the pastry. Top with the remaining pastry rounds and press gently around the edges to seal. Trim any excess pastry with a sharp knife, brush with egg wash and bake for 20-25 minutes or until golden. Serve with the tomato chutney."}, {"step": "© Donna Hay 2015"}], "nutrition": {"Energy": "5,046kJ 1,209kcals", "Fat": "74.8g", "Saturated Fat": "32.6g", "Carbohydrate": "78.4g", "Sugars": "19.6g", "Protein": "55.6g", "Salt": "2.7g", "Fibre": "3.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/Donna-Hay-beef-onion-pies-WR-WK-300715.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}