{"title": "Double chocolate brownies", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "20 squares"}, "ingredients": [{"item": "225g slightly salted butter, plus extra to grease"}, {"item": "200g Waitrose Continental Plain Chocolate, broken into pieces"}, {"item": "4 medium eggs"}, {"item": "325g light muscovado sugar"}, {"item": "100g plain flour"}, {"item": "2 tbsp cocoa powder"}, {"item": "200g Waitrose Belgian White Chocolate, chopped into small pieces"}], "instructions": [{"step": "Preheat the oven to 180oC, gas mark 4. Grease a small roasting tin measuring about 26x22cm or similar. Cut a large rectangle of greaseproof paper and press it into the tin, snipping the paper at the corners so it fits quite neatly. Grease the paper."}, {"step": "Put the plain chocolate in a heatproof bowl. Cut the butter into large pieces and place on top. Melt, either in the microwave for short spurts on medium, or by resting the bowl over a saucepan of gently simmering water, making sure the base of the bowl doesn’t touch the water. Stir regularly until smooth then remove from the heat and leave to cool for a few minutes."}, {"step": "Whisk the eggs and sugar in a bowl with an electric mixer for about"}, {"step": "minutes until pale and foamy. Stir in the melted chocolate and butter mixture. Sift the flour and cocoa powder into the bowl and gently stir in using a large metal spoon. Stir in the white chocolate and turn into the tin."}, {"step": "Bake for about 30 minutes or until a sugary, cracked crust has formed. It should wobble very slightly when the tin is shaken. Leave to cool completely in the tin. Serve cut into small squares."}], "nutrition": {"Energy": "0.0kJ 312kcals", "Fat": "18.7g", "Saturated Fat": "11.3g", "Carbohydrate": "31.7g", "Sugars": "26.4g", "Protein": "4.1g", "Salt": "0.3g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/d/Double-Chocolate-Brownies_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}