{"title": "Easter egg bourbon biscuits", "tags": null, "planning": {"prep_time": "PT30 minutes, plus chilling and meltingM", "cook_time": "PT30M", "total_time": null, "serves": "6-10 (depending on the size of your biscuit cutters)"}, "ingredients": [{"item": "120g unsalted butter, softened"}, {"item": "100g caster sugar"}, {"item": "2 tbsp golden syrup"}, {"item": "2 tbsp double cream"}, {"item": "220g plain flour"}, {"item": "3 tbsp cocoa powder"}, {"item": "1⁄2 tsp bicarbonate of soda"}, {"item": "50g unsalted butter, softened"}, {"item": "100g icing sugar"}, {"item": "1 tbsp cocoa powder, plus extra for dusting"}, {"item": "1 tbsp double cream"}, {"item": "50g milk chocolate, chopped"}], "instructions": [{"step": "For the biscuits, whizz the butter and sugar in a food processor until smooth. Whizz in the syrup and cream, then the flour, cocoa, bicarbonate of soda and a large pinch of salt until smooth. Scrape into 2 balls, flatten and wrap in cling film; chill for 1 hour."}, {"step": "Preheat the oven to 170 ̊C, gas mark 3. Roll 1 piece of dough out between 2 sheets of baking parchment to about 0.3cm thick. With an egg-shaped cutter, cut 12-20 biscuits. Put on a parchment-lined tray; bake for 14 minutes. Cool on the tray for 5 minutes, then transfer to a wire rack to cool completely. Repeat with the remaining dough, re-rolling any trimmings."}, {"step": "Once the biscuits are cool, beat together the butter, icing sugar, cocoa and cream for the filling with a pinch of salt. Use to sandwich together the biscuits."}, {"step": "To decorate, seal the chocolate in a Waitrose tie-closure frozen food bag. Put in a bowl, pour over just-boiled water and leave for 10 minutes, until melted. Meanwhile, dust the biscuits with cocoa. Lift the bag out of the water and massage so the chocolate is evenly melted, then snip off the very tip and use to decorate the biscuits."}], "nutrition": {"Energy": "1,946kj 465kcals", "Fat": "24.2g", "Saturated Fat": "15.3g", "Carbohydrate": "57.1g", "Sugars": "35.1g", "Protein": "4.7g", "Salt": "0.4g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/EasterBaking2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}