{"title": "Easter egg biscuits", "tags": null, "planning": {"prep_time": "PT1 hour, plus chilling and settingM", "cook_time": "PT15M", "total_time": null, "serves": "30"}, "ingredients": [{"item": "75g unsalted butter, at room temperature"}, {"item": "80g caster sugar"}, {"item": "1 large egg"}, {"item": "2 tbsp golden syrup"}, {"item": "265g self-raising flour, plus extra for dusting"}, {"item": "1 lemon, zest"}, {"item": "1 orange, zest"}, {"item": "1kg royal icing sugar"}, {"item": "blue, pink and yellow food colouring"}], "instructions": [{"step": "Cream together the butter and sugar with electric beaters (or in a freestanding mixer) for 1 minute. Beat together the egg and golden syrup, then beat into the creamed butter. Sift in the flour, add the zests and beat until it comes together to form a dough."}, {"step": "Roll out onto a lightly floured surface to around 0.75cm thickness. Cut out the biscuits using 6cm and 7.5cm egg-shaped cutters. Put on parchment-lined baking sheets about 3cm apart; chill for 20 minutes."}, {"step": "Preheat the oven to 180°C, gas mark 4. Bake for 12-15 minutes, until golden. Rest for 2 minutes on the sheets, then cool fully on a wire rack."}, {"step": "To decorate, make the royal icing according to pack instructions. Transfer 3 tbsp icing to a bowl and add about 1⁄2 tsp water, until it is of piping consistency. Cover with cling film and set aside."}, {"step": "Divide the remaining icing between 3 bowls and add a separate food colouring to each. Then add a little more water to each bowl, 1⁄2 tsp at a time, until the icings are of piping consistency."}, {"step": "Put 1⁄2 of the blue icing in a small, disposable piping bag; repeat with the pink and yellow icings. Cover the remaining icing with cling film; set aside. Cut a small hole at the end of each piping bag and, taking care not to use all of each icing, pipe a thin outline around each biscuit so you have 10 blue, 10 pink and 10 yellow outlines. Set aside for 15 minutes."}, {"step": "Now you want to spread a slightly looser icing inside the outlines. Add drops of water to the coloured icings in the bowls to thin them (aim for the consistency of runny custard). Use a teaspoon to gently spoon on the icings and nudge towards the outline edges. Pop any air bubbles with a cocktail stick and leave to set completely (about 2 hours)."}, {"step": "Put the reserved white icing in a piping bag. Use this and the leftover coloured icings in the piping bags to decorate the biscuits. Leave your Easter egg biscuits to set for at least 1 hour before serving."}], "nutrition": {"Energy": "743kJ 176kcals", "Fat": "2.4g", "Saturated Fat": "1.4g", "Carbohydrate": "37.4g", "Sugars": "30.5g", "Protein": "1.1g", "Salt": "0.1g", "Fibre": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Easter egg biscuits - online.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}