{"title": "Edamame and sourdough salad with berry vinaigrette", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT10M", "total_time": "PT30M", "serves": "4"}, "ingredients": [{"item": "50g walnuts"}, {"item": "3 tbsp rice vinegar"}, {"item": "200g blackberries"}, {"item": "1 tbsp clear honey"}, {"item": "3 tbsp extra virgin olive oil, plus extra for drizzling"}, {"item": "200g frozen edamame beans"}, {"item": "2 thick slices sourdough bread"}, {"item": "1 garlic clove"}, {"item": "235g pack pak choi, thinly sliced"}, {"item": "½ red onion, thinly sliced"}, {"item": "25g pack flat leaf parsley, leaves roughly chopped"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. Put the walnuts on a tray and roast for 4-6 minutes until a shade darker and aromatic. Set aside to cool then roughly chop. For the dressing, put the vinegar and 150g blackberries in a food processor and whizz until mostly smooth. Strain through a sieve into a bowl, pressing out as much juice as possible. Discard the pulp. Whisk in the honey and oil until fully incorporated; season."}, {"step": "Cook the edamame beans in a pan of boiling salted water for 5 minutes. Drain, drizzle with a little olive oil and season. Toast the sourdough, then rub the garlic clove over the crispy surface, almost grating it into the toast. Drizzle generously with olive oil and season. Tear or cut the bread into small pieces."}, {"step": "To serve, combine the pak choi, red onion, parsley, edamame beans and remaining 50g blackberries; season. Arrange on a large serving platter. Drizzle over ½ the blackberry dressing (store the remainder in the fridge for up to 3 days for another salad). Just before serving, toss the salad and dressing together, then scatter over the walnuts and torn bread."}], "nutrition": {"Energy": "1,681kJ 403kcals", "Fat": "21g", "Saturated Fat": "2.5g", "Carbohydrate": "34g", "Sugars": "11g", "Protein": "13g", "Salt": "0.7g", "Fibre": "9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Edamame-and-sourdough-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}