{"title": "Edd Kimber's Carrot cake with mascarpone frosting", "tags": null, "planning": {"prep_time": "PT40 plus coolingM", "cook_time": "PT40M", "total_time": null, "serves": "12 - 14"}, "ingredients": [{"item": "300g coarsely grated carrot (about 4 large carrots)"}, {"item": "150g sultanas"}, {"item": "280g plain flour"}, {"item": "2 tsp bicarbonate of soda"}, {"item": "½ tsp salt"}, {"item": "1 tbsp ground cinnamon"}, {"item": "1 tsp ground nutmeg"}, {"item": "2 tsp ground ginger"}, {"item": "4 large eggs"}, {"item": "200g caster sugar"}, {"item": "200g soft light brown sugar"}, {"item": "250ml light olive oil"}, {"item": "1 large orange, zest"}, {"item": "Mascarpone frosting"}, {"item": "250g unsalted butter, at room temperature, plus extra for greasing"}, {"item": "250g icing sugar, sifted"}, {"item": "2 tsp vanilla bean paste"}, {"item": "100g mascarpone"}, {"item": "200g cream cheese"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4; lightly grease 2 deep 20cm cake tins and line the bases with baking parchment. To make the cakes, put the grated carrot in a bowl with the sultanas; set aside. In a large bowl, mix together the flour, bicarbonate of soda, salt and spices. In another bowl, using a balloon whisk, whisk together the eggs, sugars and olive oil until evenly combined. Pour the egg mixture into the flour mixture and whisk together lightly until just combined. Add the carrot mixture and the orange zest, then stir gently to combine. Divide the batter evenly between the prepared tins and bake for 30-40 minutes, until a skewer inserted into the centres of the cakes comes out clean. Leave to cool in the tins for 10 minutes before inverting onto a wire rack to cool completely."}, {"step": "To make the frosting, put the butter in a large bowl and, using electric beaters, beat for about 5 minutes, until smooth and silky. Slowly incorporate the icing sugar and once combined, beat on high speed for about 5 minutes, until light and fluffy. Add the vanilla bean paste, mascarpone and cream cheese and beat together briefly for 2-3 minutes, until just combined (don’t beat the cheese for too long, otherwise it will start to break down"}, {"step": "and the frosting will be too loose)."}, {"step": "To decorate, use a large serrated knife to slice each cake carefully through the middle into 2 (see tip on page 107). Scrape the buttercream into a piping bag fitted with a plain round piping tip, about 1cm wide. Put one of the bottom layers onto a flat plate or cake stand. Pipe peaks of the frosting around the edge of the cake, then repeat in the middle of the cake in concentric circles. Repeat with the remaining cake layers. This is best served on the day it is made."}], "nutrition": {"Energy": "2,788kj 668kcals", "Fat": "40.3g", "Saturated Fat": "17.2g", "Carbohydrate": "70.6g", "Sugars": "55.9g", "Protein": "5.7g", "Salt": "0.8g", "Fibre": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Edd_Kimber_Carrotcake2048px.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}