{"title": "Edd Kimber's nutty butterscotch cake", "tags": null, "planning": {"prep_time": "PT40 minutes, plus chillingM", "cook_time": "PT35M", "total_time": "PT75 minutes, plus chillingM", "serves": "12 - 14"}, "ingredients": [{"item": "200g unsalted butter, diced, plus extra for greasing"}, {"item": "2 tbsp cocoa powder"}, {"item": "200g dark chocolate (60-70% cocoa solids), roughly chopped"}, {"item": "300g light soft brown sugar"}, {"item": "4 large eggs"}, {"item": "175g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "75g salted peanuts"}, {"item": "80g unsalted butter"}, {"item": "120g dark soft brown sugar"}, {"item": "1⁄2 tsp flaked sea salt"}, {"item": "120ml double cream"}, {"item": "1 1⁄2 tsp vanilla bean paste"}, {"item": "3 large egg whites"}, {"item": "240g caster sugar"}, {"item": "1 tsp vanilla bean paste"}, {"item": "360g unsalted butter, diced and at room temperature"}, {"item": "3 tbsp Horlicks"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4; lightly grease 3 x 20cm cake tins and line the bases with baking parchment. For the butterscotch sauce, heat the butter, sugar and salt in a pan over a medium-high heat for 5 minutes, until melted and bubbling. Take off the heat, add the cream and vanilla, return to the heat and cook for 2 minutes. Pour into a bowl; set aside to cool to room temperature."}, {"step": "To make the cake, put the cocoa powder in a small bowl and pour over 100ml boiling water, mixing together; set aside to cool. Put the butter and chocolate in a heatproof bowl; set over a pan of simmering water and stir occasionally, until melted. Take off the heat and allow to cool slightly. Put the sugar and eggs in a separate large bowl and, using electric beaters, whisk for about 4-5 minutes, until pale and thickened. Continuing to whisk on a medium speed, beat in the chocolate mix, then the flour and baking powder, until just combined. Finish by beating in the cocoa mixture. Divide the mixture equally between the prepared tins and bake for 20-25 minutes, or until a skewer inserted into the centres of the cakes comes out clean. Leave to cool in the tins for 10 minutes before inverting onto a wire rack to cool completely."}, {"step": "To make the buttercream, put the egg whites, sugar and vanilla bean paste in a large, heatproof bowl and place over a pan of simmering water. Whisk the mixture together lightly until the sugar has dissolved and the whites are warm – to test this, dip two fingers into the whites and rub together; if you can feel sugar grains it needs more time. Remove the bowl from the heat and use electric beaters to whisk until a thick glossy meringue has been formed and the meringue is cool. Continuing to whisk, add the butter a piece at a time. Once it’s been added, you should have a silky smooth buttercream. If not, continue to mix until the texture changes. Add the Horlicks and mix until combined."}, {"step": "To decorate the cake, set aside 1/3 of the peanuts and roughly chop the rest. Place the first sponge layer onto a cake turntable or stand and spread with a thin layer of the buttercream. Drizzle over about 1 tbsp butterscotch sauce and 1⁄2 the chopped peanuts. Repeat with the second sponge layer and finish by placing the final sponge on top. Scrape the remaining buttercream on top of the cake and carefully spread until it starts to peak over the sides. Carefully work the buttercream over the edge to cover the sides of the cake. Once covered, hold an offset spatula against the side of the cake and carefully turn the cake, smoothing out the buttercream so you have a straight, smooth edge. If any of the buttercream is peeking over the sides of the cake, carefully drag it onto the top of the cake, then roughly smooth the top (don’t worry if it’s not perfect as it will be covered later). Put the iced cake and covered butterscotch sauce in the fridge for 1 hour."}, {"step": "To finish, remove the cake and butterscotch sauce from the fridge and very carefully spread the sauce over the top of the cake, teasing it over the sides of the cake in places and letting it run down the sides. Sprinkle the reserved peanuts around the edge of the cake and allow to come to room temperature before serving."}], "nutrition": {"Energy": "3,188kJ 766kcals", "Fat": "52.3g", "Saturated Fat": "31.5g", "Carbohydrate": "66.5g", "Sugars": "54.2g", "Protein": "7.2g", "Salt": "0.7g", "Fibre": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/20150727_Waitrose_Cover_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}