{"title": "Egg-free chocolate cupcakes", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT20M", "total_time": "PT50M", "serves": "12"}, "ingredients": [{"item": "100ml soy milk alternative (or milk or another milk alternative)"}, {"item": "1½ tsp apple cider vinegar (or distilled white vinegar or lemon juice)"}, {"item": "170g light brown muscovado sugar (or caster sugar, but it won’t be as fudgy)"}, {"item": "110ml sunflower oil"}, {"item": "1 tsp vanilla extract or vanilla bean paste (optional)"}, {"item": "90g soy yogurt alternative (or dairy yogurt or another yogurt alternative)"}, {"item": "150g self-raising flour"}, {"item": "60g cocoa powder"}, {"item": "1 tsp baking powder"}, {"item": "½ tsp salt"}, {"item": "For the topping"}, {"item": "200g unsalted butter, softened (or vegan spread)"}, {"item": "1 tsp vanilla extract"}, {"item": "400g icing sugar, sifted"}, {"item": "1-2 tbsp soy milk alternative (or milk or another milk alternative)"}, {"item": "100g dark dairy-free chocolate, melted and cooled"}, {"item": "Sprinkles, chocolate curls, or berries, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and line a 12-hole muffin tin with muffin cases. Stir together the milk and vinegar in a jug – the milk should curdle slightly. Set aside."}, {"step": "In a large bowl, whisk together the sugar, oil and vanilla extract, then whisk in the yogurt alternative, making sure to combine all the sugar. Add the curdled milk and mix."}, {"step": "In another large bowl, sift together the flour, cocoa powder, baking powder and salt. Gradually whisk the wet ingredients into the dry until smooth, but be careful not to overmix."}, {"step": "Divide the batter evenly between the cases and bake for 15-20 minutes, until well risen and a skewer inserted into the centre of a cake comes out almost clean. It should still be a little paste-like, but not wet/glistening – slightly underbaked makes for a fudgier cake!"}, {"step": "Leave the cakes to cool on a wire rack while you make the frosting. Beat the butter and vanilla in a stand mixer on high speed, until pale and whipped. Add the icing sugar in two batches, beating until light and fluffy. Loosen the frosting with milk and mix again, then pour in the chocolate and stir through."}, {"step": "Spread the frosting onto the cakes with a palette knife. Or pipe in a circular motion from the outside of the cake inwards, in one continuous motion, to create a whipped top. Decorate with toppings of your choice or leave plain. The cakes will keep in an airtight box for up to 2 days, or freeze for up to 1 month."}], "nutrition": {"Energy": "2,133kJ 510kcals", "Fat": "28g", "Saturated Fat": "12g", "Carbohydrate": "59g", "Sugars": "49g", "Protein": "4.2g", "Salt": "0.4g", "Fibre": "2.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/cupcake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}