{"title": "Emma Gardner's Osterfladen (Swiss Easter tart)", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes, plus cooling, chilling and restingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 45 minutes, plus cooling, chilling and restingM", "serves": "8"}, "ingredients": [{"item": "370ml whole milk"}, {"item": "70g short grain rice"}, {"item": "60g caster sugar"}, {"item": "50g ground almonds"}, {"item": "50g double cream"}, {"item": "1 lemon, zest"}, {"item": "2 eggs, separated"}, {"item": "2 tbsp raspberry jam"}, {"item": "160g plain flour, plus extra for dusting"}, {"item": "½ tsp caster sugar"}, {"item": "1/4 tsp fine sea salt"}, {"item": "100g unsalted butter, cubed and chilled"}, {"item": "2 tbsp whole milk"}], "instructions": [{"step": "In a saucepan, bring the milk to the boil with a pinch of salt. Add the rice and simmer gently, stirring often, until the mixture has thickened – about 25 minutes. Scrape into a bowl and cool, before chilling completely."}, {"step": "For the pastry, sieve the flour, sugar and salt into a bowl. Rub in the butter until it resembles wet sand, then mix in the milk with a cutlery knife. On a work surface, flatten the dough with the palm of your hand and fold in half. Repeat, flattening again into a disc, and wrap in cling film; chill for at least 30 minutes."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Roll out the pastry on a well-floured surface to about 0.3cm thick, large enough to line a 23cm fluted tart case. Place the tin on a baking sheet and then line with the pastry, pressing into the corners and sides. Trim any excess from the edges and chill for 20 minutes more."}, {"step": "Prick the pastry base with a fork, then line with parchment and baking beans. Bake for 15 minutes, remove the parchment and beans, then return to the oven for 5 minutes more; set aside to cool."}, {"step": "Beat the sugar, ground almonds, cream, lemon zest and egg yolks into the rice. In a separate bowl, whisk the egg whites to stiff peaks, mixing 1/3 into the rice mixture to loosen it, before folding in the rest."}, {"step": "Spread the jam over the tart base and spoon the rice filling on top. Bake for 30-35 minutes, until golden brown, puffy and set. Remove from the tin and cool on a wire rack. Serve, at room temperature or chilled, dusted with icing sugar, if liked."}], "nutrition": {"Energy": "1,544kJ 369kcals", "Fat": "21g", "Saturated Fat": "10.7g", "Carbohydrate": "37.5g", "Sugars": "14.6g", "Protein": "7.6g", "Salt": "0.3g", "Fibre": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Waitrose-Kitchen-12-01-157011_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}