{"title": "Empanadas with potato, cheese & chorizo", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT25M", "total_time": "PT55M", "serves": "6"}, "ingredients": [{"item": "280g King Edward potatoes, peeled and diced"}, {"item": "2 Clarence Court Burford Browns Eggs"}, {"item": "½ x 200g pack Unearthed Smoked Cooking Chorizo"}, {"item": "50g Waitrose 1 Keen’s Mature Farmhouse Cheddar, cubed"}, {"item": "½ x 25g pack fresh parsley, chopped"}, {"item": "500g pack shortcrust pastry"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Place the potatoes in a pan of cold water, bring them to the boil and simmer for 10-15 minutes until tender, then drain thoroughly. Roughly mash the potatoes in a bowl, and season with sea salt and black pepper."}, {"step": "Meanwhile, place 1 of the eggs in a separate pan and bring to the boil for about 10 minutes, then run under cold water and peel and chop."}, {"step": "Remove the skin from the chorizo and tear into the mashed potato. Add in the cubes of Cheddar, chopped egg and parsley."}, {"step": "Lightly flour a work surface and roll out the pastry to a thickness of 0.5cm. Using a 14cm cutter or bowl as a guide, cut 6 circles from the pastry (rerolling the trimmings). Wet the edges of the pastry with a little water, divide the chorizo filling between the circles, placing it in the middle of the pastry disc and folding over, crimping to seal."}, {"step": "Place the empanadas on a baking tray lined with baking parchment, brush with the remaining egg (beaten) and bake in the oven for 25 minutes until golden and crisp. Serve warm with a cold beer."}], "nutrition": {"Energy": "2,041kJ 489kcals", "Fat": "28.7g", "Saturated Fat": "16.9g", "Carbohydrate": "43.3g", "Sugars": "1g", "Protein": "14.3g", "Salt": "0.8g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Waitrose-Weekend_Wk319_WkEnd_Sat-Lunch_Empanadas-Potato-Cheese-&-Chorizo.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}