{"title": "Essential apple & sultana cider cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT60M", "total_time": "PT75M", "serves": "12"}, "ingredients": [{"item": "100g Essential Sultanas"}, {"item": "100ml medium sweet cider, such as Waitrose Low Alcohol Cider"}, {"item": "225g Essential Plain Flour"}, {"item": "1 tsp baking powder"}, {"item": "1 tsp ground cinnamon"}, {"item": "225g golden caster sugar"}, {"item": "225g Essential Unsalted Dairy Butter, softened"}, {"item": "2 Essential Free Range Eggs"}, {"item": "6 Essential British Seasonal Apples, 5 peeled and cored, 1 kept whole"}, {"item": "1 tbsp Essential Pure Clear Honey"}], "instructions": [{"step": "Put the sultanas in a bowl with 3 tbsp of the cider and set aside. Heat the oven to 180°C, gas mark 4. Grease and line a 23cm round loose-bottomed cake tin. Tie a thick band of brown paper around the outside of the tin and secure it with string (to stop the cake edge burning)."}, {"step": "Sift together the flour, baking powder and cinnamon. In a separate, large mixing bowl, place the sugar and butter then beat with a handheld electric mixer for 1 minute until pale and creamy. Add the eggs 1 at a time and beat in for 1 minute along with the remaining cider."}, {"step": "Quarter, core and slice the whole apple and cut the 5 others into 1cm pieces. Fold the apple pieces, sultanas and juices into the egg mixture then the flour mixture. Stir well then spoon into the tin. Arrange the apple slices on top of the cake mixture and bake for 1 hour, covering with foil once it is browned on top. Bake until a skewer comes out clean when inserted into the cake centre."}, {"step": "Remove from the tin, brush with the honey and leave to cool. Serve just warm with clotted cream for pudding, or leave to cool completely for afternoon tea."}], "nutrition": {"Energy": "1,534kJ 366kcals", "Fat": "17.1g", "Saturated Fat": "10.6g", "Carbohydrate": "49.4g", "Sugars": "34.8g", "Protein": "3.6g", "Salt": "0.2g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/a/Apple,Sultana&CiderCake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}