{"title": "Fairtrade mocha loaf cake", "tags": [{"tag": "Vegetarian"}, {"tag": "Fairtrade"}], "planning": {"prep_time": "PT15M", "cook_time": "PT70M", "total_time": "PT1 hour 25 minutesM", "serves": "10"}, "ingredients": [{"item": "130g butter, at room temperature"}, {"item": "130g Waitrose Fairtrade Light Brown Soft Sugar"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs, at room temperature"}, {"item": "100g plain flour"}, {"item": "40g Green & Black’s Fairtrade Organic Cocoa powder"}, {"item": "1 tsp baking powder"}, {"item": "75ml natural yogurt"}, {"item": "1 tbsp milk"}, {"item": "1 heaped tsp Clipper Super Special Fairtrade Organic Coffee granules, dissolved in 1 tbsp boiling water"}, {"item": "150ml Tate & Lyle Fairtrade Icing Sugar"}, {"item": "1 tbsp Clipper Super Special Fairtrade Organic Coffee granules, dissolved in 2 tbsp boiling water"}], "instructions": [{"step": "Grease and line a 900g-1kg loaf tin with baking parchment, and preheat the oven to 160°C, gas mark 3. Cream together the soft butter and sugar with an electric hand mixer until light and fluffy, and then beat in the eggs one at a time."}, {"step": "Combine the flour, cocoa powder and baking powder in a small bowl, and then add half of this dry mix to the creamed butter and sugar. Mix well to combine, and then stir in the yogurt, milk and coffee."}, {"step": "Add the remaining dry mix and beat well until the mixture is smooth. Then spoon it into the prepared tin, smooth the top and bake in the oven for an hour, or until a skewer inserted into the centre comes out clean. If it isn’t quite done, return to the oven for a further 5-10 minutes. Allow the cake to cool in the tin for 15 minutes before transferring to a cooling rack."}, {"step": "To make the icing, gradually mix together the icing sugar with the coffee to form a thick paste. Spread the icing over the top of the warm cake, encouraging it to drip down the edges. Dust with cocoa powder when the icing has set."}], "nutrition": {"Energy": "1,212kJ 289kcals", "Fat": "13.4g", "Saturated Fat": "7.7g", "Carbohydrate": "38g", "Sugars": "29.5g", "Protein": "4.1g", "Salt": "0.5g", "Fibre": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/WRWK100316-mocha-loaf.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}