{"title": "Fairtrade banoffee cupcakes", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT25M", "total_time": "PT45M", "serves": "12"}, "ingredients": [{"item": "2 ripe Fairtrade bananas"}, {"item": "125g butter, at room temperature"}, {"item": "120g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "2 large eggs"}, {"item": "½ tsp salt"}, {"item": "150g essential Waitrose Plain Flour"}, {"item": "2 tsp baking powder"}, {"item": "1 tsp cinnamon"}, {"item": "100g unsalted butter, softened"}, {"item": "300g icing sugar"}, {"item": "100g Bonne Maman Confiture de Caramel"}, {"item": "50g Cooks' Ingredients Fudge Chunks"}, {"item": "½ banana, cut into 12 thin slices"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line your muffin tin with cupcake cases."}, {"step": "Mash the bananas until very soft and set aside. Beat the butter and half the sugar for at least 4 minutes with an electric hand whisk. Add the mashed bananas and vanilla extract. In a separate bowl, whisk the eggs with the remaining sugar and the salt until pale and fluffy. Combine the egg mixture with the buttery banana mixture, then sieve over the flour, baking powder and cinnamon in batches, whisking between additions. Spoon the mixture evenly into the cupcake cases and bake in the middle of the oven for 25 minutes until they feel spongy and the tops are golden brown. Cool on a wire rack."}, {"step": "Meanwhile, make the toffee buttercream. Whisk the butter until creamy and light, then gradually whisk in the icing sugar. Add 1-2 tbsp water, 1 tbsp at a time, if the mixture looks too dry. Top each cupcake with buttercream."}, {"step": "Warm the Confiture de Caramel in a pan, until it’s runny. Using a spoon, swirl over the buttercream icing and sprinkle over the fudge chunks. Finally, arrange slices of banana into the icing. Serve immediately, as the banana slices will brown when exposed to the air."}], "nutrition": {"Energy": "1744.728kJ 417kcals", "Fat": "17.9g", "Saturated Fat": "10.9g", "Carbohydrate": "60.5g", "Sugars": "49.9g", "Salt": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/FBC.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}