{"title": "Farmhouse salad with ham, soft-boiled eggs, gruyère cheese and home-made salad cream", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT15M", "cook_time": "PT10M", "total_time": "PT25M", "serves": "6"}, "ingredients": [{"item": "5 eggs"}, {"item": "3-4 romaine lettuces"}, {"item": "200g gruyère"}, {"item": "240g Waitrose Cooks’ Ingredients pulled ham hock"}, {"item": "handful salad cress"}, {"item": "1 tsp English mustard"}, {"item": "1 egg yolk"}, {"item": "125ml vegetable oil"}, {"item": "60ml evaporated milk"}, {"item": "50ml olive oil"}, {"item": "2 tbsp malt vinegar"}, {"item": "½ tsp caster sugar"}, {"item": "ground white pepper, to taste"}], "instructions": [{"step": "For the salad cream, put the mustard and egg yolk in the small bowl of a food processor with a pinch of salt. Start the motor and slowly pour in the vegetable oil; the mixture will emulsify and thicken as you pour. Next add the evaporated milk, then the olive oil and vinegar; it should form a thick, creamy consistency. Season with the sugar, plus salt and ground white pepper to taste."}, {"step": "For the salad, bring a large pan of water to the boil, then add the eggs. Cook for 6-7 minutes, then lift out and plunge into iced water to stop the cooking. Peel and cut into quarters."}, {"step": "Remove any shrivelled outer layers from the lettuce and cut the heads into quarters lengthways. Remove the hard outer rind of the gruyère, then cut into fine 6cm sticks."}, {"step": "Arrange the lettuce on a platter, then flake the ham over the top and scatter over the eggs. Season and dress with generous amounts of salad cream, scattering the cheese and cress on top."}], "nutrition": {"Energy": "2,215kJ 535kcals", "Fat": "46.5g", "Saturated Fat": "11.7g", "Carbohydrate": "3.4g", "Sugars": "3.4g", "Protein": "25.7g", "Salt": "1.7g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/MPW-farmhouse-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}