{"title": "Fast Roast Pork with Rosemary and Caramelised Apples", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT30 minutes, plus restingM", "total_time": "PT35 to 40 minutes, plus restingM", "serves": "6"}, "ingredients": [{"item": "2\t thick British pork tenderloins (350g each after trimming)"}, {"item": "2\t garlic cloves, thinly sliced"}, {"item": "1 tbsp \tfresh rosemary leaves"}, {"item": "40g\t butter"}, {"item": "1½ tbsp \tcider vinegar"}, {"item": "1\t small onion, finely chopped"}, {"item": "3\t granny Smith apples, skins on, cored and cut into 6 wedges each"}, {"item": "1 tbsp \tdemerara sugar"}, {"item": "225ml \tstrong dry cider"}, {"item": "2 tbsp\t half-fat crème fraîche"}], "instructions": [{"step": "You will need a flameproof baking tray measuring 28cm x 40cm, lightly buttered.  Preheat the oven to 230°C/gas 8. First of all, using a small, sharp knife, make little slits all over the pork and push the slivers of garlic into them, turning the fillet over so the garlic is in on both sides. Next, place the rosemary leaves in a mortar and bruise them with a pestle to release their fragrant oil, then chop them very finely.  Now melt the butter and combine it with the cider vinegar, then brush the meat with some of this mixture, sprinkle with half the rosemary and season with salt and pepper. Scatter the onion over the buttered baking tray and place the pork on top. All this can be prepared in advance, then covered with clingfilm.  When you want to cook the roast, prepare the apples by tossing them with the remaining cider vinegar and butter mixture, then arrange them all around the pork on the baking tray and sprinkle with the sugar and the rest of the rosemary. Place the baking tray in the oven on a high shelf and roast for 25–30 minutes (this will depend on the thickness of the pork), until the pork is cooked and there are no pink juices.  After that, remove the baking tray from the oven and transfer the pork and apples to a hot serving dish, cover with foil and keep warm. Meanwhile, pour a little of the cider on to the tray, over the heat, to loosen the onions and juices from it, then pour into a saucepan over a medium heat, add the rest of the cider and let it bubble and reduce by about a third – this will take about 5 minutes. Then whisk in the crème fraîche, let it bubble a bit more and add some seasoning.  After the pork has rested for about 10 minutes, transfer it to a board and carve it into thick slices, then return them to the serving plate to rejoin the apples. Pour the sauce over and serve as soon as possible. Roast potatoes are particularly good with this."}], "nutrition": {"Energy": "1075.288kJ 257.0kcal", "Fat": "12.0g", "Saturated Fat": "6.0g", "Sugars": "9.0g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/0811081-r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}