{"title": "Feta-whipped sweet potatoes with kale and walnut pesto", "tags": null, "planning": {"prep_time": "PT20 minutes plus coolingM", "cook_time": "PT105M", "total_time": null, "serves": "2"}, "ingredients": [{"item": "3 sweet potatoes (350g)"}, {"item": "200g kale, stems discarded and leaves torn"}, {"item": "15g walnut halves"}, {"item": "3 garlic cloves, unpeeled"}, {"item": "11⁄2 tbsp extra virgin olive oil"}, {"item": "1⁄2 lemon, zest and juice"}, {"item": "50g essential Waitrose Greek light salad cheese, crumbled"}, {"item": "small handful mint leaves, shredded"}, {"item": "25g pack basil, leaves picked"}], "instructions": [{"step": "Preheat the oven to 200 ̊C, gas mark 6. Pierce the sweet potatoes all over with a fork. Bake for about 1 hour 30 minutes, until the centres are soft, then set aside."}, {"step": "Lower the oven to 160 ̊C, gas mark 2. Toss the kale, walnuts and whole garlic cloves with 1 tbsp oil; roast for 10-12 minutes, until crisp."}, {"step": "Once the potatoes are cool enough to handle, halve them and scoop out the middles, keeping the skin intact (leave a little flesh in the shells so that they hold their shape). Beat the flesh with the remaining 1⁄2 tbsp oil, a squeeze of lemon juice and most of the salad cheese; season. Pile back into 4 of the halved sweet potato skins (discard the other two) and scatter over the remaining cheese. Pop back in the oven to warm through."}, {"step": "Squeeze the garlic cloves out of their skins into the small bowl of a food processor. Add the kale and walnuts, mint and basil, and pulse until roughly chopped. Stir through the lemon zest, season, then scatter over the sweet potatoes and serve."}], "nutrition": {"Energy": "2,087Kj 497Kcal", "Fat": "20.6g", "Saturated Fat": "4.7g", "Carbohydrate": "65g", "Sugars": "34g", "Protein": "12.9g", "Salt": "1g", "Fibre": "9.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/sweet potato.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}