{"title": "Fig & pistachio upside-down cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT1 hourM", "total_time": "PT1 hour 20 minutes, plus coolingM", "serves": null}, "ingredients": [{"item": "230g unsalted butter, at room temperature, plus extra for greasing"}, {"item": "50ml orange juice"}, {"item": "300g golden caster sugar"}, {"item": "3-4 figs"}, {"item": "200g pistachio kernels"}, {"item": "3 large eggs"}, {"item": "100g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "1 tsp rose water"}, {"item": "1 tbsp dried rose petals"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease a loaf tin and line with baking parchment. Cut 30g butter into cubes and put in a small pan over a low-medium heat to melt. Add the orange juice and 100g golden caster sugar, stirring it all together. Gently bring to the boil, swirling to mix it – do not stir – then leave to simmer for 5-6 minutes until it becomes a golden syrup. Pour into the bottom of the lined tin. Trim the figs, cut into 0.5cm slices and line the bottom of the tin with them, overlapping them slightly and going up the sides a little if possible, so all the syrup is completely covered."}, {"step": "Put the pistachios in a food processor and whizz until finely ground. Cut the remaining 200g butter into cubes and add to the processor with the eggs, flour, baking powder, rose water, remaining 200g sugar and a pinch of fine sea salt. Whizz until it all comes together smoothly, then spoon into the cake tin, over the sliced fruit. Put on a baking tray and bake in the middle of the oven for 45-50 minutes (covering loosely with foil after 30 minutes if it browns too fast), until golden and cooked through; a skewer inserted into the middle should come out clean. Leave to cool in the tin for 10 minutes, then gently turn out onto a cooling rack. Peel off the parchment and leave to cool almost completely. Sprinkle over the rose petals and serve, with crème fraîche if liked."}], "nutrition": {"Energy": "2,031kJ 488kcals", "Fat": "32g", "Saturated Fat": "14g", "Carbohydrate": "41g", "Sugars": "33g", "Protein": "7.9g", "Salt": "0.3g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/200624_016_PistachioFigCake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}