{"title": "Fig and cranberry hot cross buns with maple bacon butter", "tags": null, "planning": {"prep_time": "PT30 minutes, plus rising and coolingM", "cook_time": "PT30M", "total_time": "PT1 hour, plus rising and coolingM", "serves": "18"}, "ingredients": [{"item": "250ml whole milk"}, {"item": "30g unsalted butter"}, {"item": "½ tsp vanilla extract"}, {"item": "500g strong white bread flour, plus extra for dusting"}, {"item": "½ tsp salt"}, {"item": "2 tsp mixed spice"}, {"item": "1 tsp ground cinnamon"}, {"item": "½ tsp ground cardamom (finely crushed seeds from about 6 pods)"}, {"item": "50g caster sugar"}, {"item": "1 orange, zest"}, {"item": "7g sachet easy bake yeast"}, {"item": "1 large egg, lightly beaten"}, {"item": "75g dried figs, roughly chopped"}, {"item": "75g dried cranberries"}, {"item": "50g plain flour"}, {"item": "1 egg, lightly beaten"}, {"item": "2 rashers streaky bacon"}, {"item": "125g salted butter, very soft"}, {"item": "2 tbsp maple syrup"}], "instructions": [{"step": "For the dough, pour the milk into a small saucepan and add the butter and vanilla. Heat gently until the butter melts and the milk is warm. Meanwhile, mix the fl our, salt, spices, sugar and orange zest together in a large bowl, then make a well in the centre and add the yeast. Pour the warm milk into the well and leave to stand for 5 minutes to let the yeast dissolve. Add the beaten egg, then mix together to form a rough dough. Knead for about 10-15 minutes or until the dough is smooth and elastic. Press the dough into a fl at round and top with the dried fruit. Fold the dough over to encase the fruit and knead for a couple of minutes, until the fruit is evenly distributed. Put the dough in a lightly greased bowl, cover with cling film and set aside until doubled in size – about 1 hour."}, {"step": "Once risen, tip the dough onto the work surface and divide into 18 equal portions, rolling into balls. Arrange the buns in 2 circles (6 in the central circle and 12 in the outer circle) on a large, parchment-lined baking tray, leaving a little space between each ball, and a hole of about 10cm diameter in the middle. Lightly cover the buns with cling fi lm and set aside again until almost doubled in size – about 30 minutes."}, {"step": "Preheat the oven to 190˚C, gas mark 5. To make the crosses, put the flour in a small bowl and mix in about 5 tbsp water, 1 tbsp at a time, until a thick paste is formed. Spoon the paste into a disposable piping bag and snip off the end. Brush the buns with the beaten egg and pipe a cross onto each bun. Bake for 15-20 minutes or until golden. Put on a wire rack to cool slightly."}, {"step": "While the buns are baking, make the butter. Grill the bacon until crisp, then cool and finely chop. Add to the butter with the maple syrup and beat together until combined. Glaze the buns with a little warm, watered-down apricot jam, if liked. Serve warm or at room temperature, split open and spread generously with the maple bacon butter."}], "nutrition": {"Energy": "Per buttered bun 1037kJ 247kcals", "Fat": "9.6g", "Saturated Fat": "5.5g", "Carbohydrate": "34.5g", "Sugars": "10.9g", "Protein": "5.6g", "Salt": "0.4g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/hot-cross-buns.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}