{"title": "Fillet Steak and Roasted Shallots with Wild Mushroom Madeira", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "2"}, "ingredients": [{"item": "5 large shallots"}, {"item": "2 tbsp olive oil"}, {"item": "2 x 150g Waitrose British Beef Fillet Steaks"}, {"item": "Knob of butter"}, {"item": "120g pack Waitrose Wild and Exotic Mushroom Selection, ripped or sliced if large"}, {"item": "75g Crimini mushrooms, halved"}, {"item": "2 tbsp Madeira"}, {"item": "2 tbsp crème fraîche"}, {"item": "Salt and freshly ground black pepper"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Trim 4 of the shallots, but do not peel them. Make cuts, as if slicing into quarters, from the tops almost down to the roots, but keep them whole. Peel and finely chop the remaining shallot and reserve. Toss the whole shallots in 1 tbsp olive oil and seasoning. Put in a small, shallow ovenproof dish and bake for 25-30 minutes until tender.  Meanwhile, cook the steaks. Season on both sides, then heat the remaining oil and the knob of butter in a frying pan until foaming. Add the steaks and fry over a fairly high heat until the undersides are browned, about 3 minutes. Turn the steaks and fry for a further 3-4 minutes (this will give you medium steaks _ cook for 1-2 minutes longer if you prefer them well done). Remove the steaks from the pan, place on a serving plate and keep warm.  Add the reserved chopped shallot to the pan and fry gently for 2-3 minutes, until softened. Add the mushrooms and fry briefly until they start to soften. Pour in the Madeira, add the seasoning and allow to bubble for a couple of minutes. Add the crème fraîche and stir into the sauce until it is melted and bubbling.  Place the steaks on warmed plates, pour the mushroom sauce over and serve the shallots on the side, with a green vegetable and new potatoes."}], "nutrition": {"Energy": "1690.336kJ 404.0kcal", "Fat": "36.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/0302r03.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}