{"title": "Flourless chocolate ‘cloud’ cake with whipped cream & raspberries", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT20 minutes + coolingM", "cook_time": "PT35M", "total_time": "PT55 minutes + coolingM", "serves": "10"}, "ingredients": [{"item": "125g unsalted butter, plus extra for greasing"}, {"item": "200g dark chocolate, chopped into smallish chunks"}, {"item": "1 tbsp instant coffee"}, {"item": "6 British Blacktail Medium Free Range Eggs"}, {"item": "175g golden caster sugar"}, {"item": "3 tbsp cocoa powder"}, {"item": "170ml tub double cream"}, {"item": "1 tsp vanilla bean paste"}, {"item": "150g raspberries"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and lightly grease and line the base of a 20cm loose-bottomed or springform cake tin with baking parchment. Place the butter, chocolate and coffee in a heatproof bowl and set over a pan of barely simmering water, stirring occasionally until combined and melted. Remove from the heat and set aside."}, {"step": "Separate the egg whites and yolks into two large mixing bowls. Using electric beaters, whisk the egg whites to soft peaks. Add the sugar to the egg yolks and whisk (there’s no need to clean the beaters in between) for a couple of minutes until light and voluminous."}, {"step": "Stir the melted chocolate mixture into the egg yolks until combined, then stir in the cocoa powder. Fold in half the egg whites first, then continue with the remainder, trying to lose as little air as possible but making sure it’s all incorporated. Tip the mixture into the cake tin and bake for 35 minutes until risen and cracked on top."}, {"step": "Cool in the tin for 10 minutes, then remove the sides of the tin and leave to cool completely to room temperature, during which time it will sink in the middle. When ready to serve, whisk the cream and vanilla paste to soft peaks. Pile into the middle of the cake and top with the raspberries."}], "nutrition": {"Energy": "1,732kJ 417kcals", "Fat": "30g", "Saturated Fat": "18g", "Carbohydrate": "26g", "Sugars": "24g", "Protein": "8.1g", "Salt": "0.1g", "Fibre": "4.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/Waitrose-Weekend_WK456_WKend-Menu_Flourless-Chocolate-Cloud-Cake-Cream-&-Raspberries.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}