{"title": "Flourless chocolate praline cake", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT1 hourM", "total_time": "PT1 hour 30 minutes, plus coolingM", "serves": "8-10"}, "ingredients": [{"item": "175g unsalted butter, softened, plus extra for greasing"}, {"item": "100g whole blanched hazelnuts"}, {"item": "175g caster sugar"}, {"item": "200g dark chocolate (70% cocoa), chopped"}, {"item": "5 eggs, separated"}, {"item": "½ tsp salt"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease a 23cm cake tin and line with baking parchment. Put the hazelnuts in a roasting tray and roast for 10 minutes until golden. Set aside and, once cool, blitz in a food processor with 25g sugar until finely ground. Meanwhile, melt the chocolate in a bowl set over a pan of barely simmering water."}, {"step": "Using electric beaters, cream the butter and 100g sugar in a bowl for 5 minutes, until pale and fluffy. Beat in the egg yolks one at a time, then the melted chocolate and salt. Fold through the ground hazelnuts."}, {"step": "Reduce the oven to 160˚C, gas mark 2. In a separate bowl, whisk the egg whites to stiff peaks. Whisk in the remaining 50g sugar until stiff and glossy. Stir 1/3 the egg white into the chocolate mixture to loosen, then carefully fold in the remaining egg white, a third at a time, trying to retain as much air as possible. Carefully tip into the tin, gently smooth the top and bake for 50-55 minutes until just set."}, {"step": "Cool in the tin for 20 minutes, then remove the sides (leave the base on) and cool completely on a wire rack."}, {"step": "Slice and serve, with hot chocolate sauce and Chantilly cream, if liked."}], "nutrition": {"Energy": "780kJs 429kcals", "Fat": "33g", "Saturated Fat": "16.1g", "Carbohydrate": "25.8g", "Sugars": "24.2g", "Protein": "7.1g", "Salt": "0.4g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/Choc-Cake-cl.up_SS_EXTENDED_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}