{"title": "Flourless chocolate cloud cake", "tags": null, "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT35M", "total_time": null, "serves": "10-12"}, "ingredients": [{"item": "250g salted butter, plus extra for greasing"}, {"item": "250g dark chocolate, chopped"}, {"item": "1 tbsp espresso coffee powder"}, {"item": "6 large eggs, separated"}, {"item": "250g caster sugar"}, {"item": "60g cocoa powder, sifted, plus extra for dusting"}, {"item": "300g pack frozen summer fruits"}, {"item": "200ml crème fraîche"}, {"item": "mint leaves, to serve"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and line a 23cm springform cake tin. Put the chocolate and butter in a heatproof bowl over a pan of just-boiled water. Once nearly all melted, stir until smooth. Mix the coffee powder with 50ml boiled water. Set both aside to cool a little."}, {"step": "Using electric beaters, whisk the egg yolks with the sugar in a large bowl for 3 minutes, until pale and thick. Stir in the chocolate mixture, coffee and the cocoa powder. Whisk the egg whites with clean electric beaters in a separate bowl until they form stiff peaks. Stir a dollop of the egg white into the chocolate mixture to loosen it, then carefully fold in the rest. Pour into the cake tin, level out, then bake for 35-40 minutes until risen, cracked and with a very slight wobble in the centre. Leave the cake to cool in the tin on a wire rack. It will sink in the middle."}, {"step": "While the cake is cooling, put the summer fruits in a small pan over a low heat and cook for 7-8 minutes until warmed through but still holding their shape. Leave to cool. When ready to serve, dollop the crème fraîche onto the centre of the cake. Top with the berries and scatter a few mint leaves over the top."}], "nutrition": {"Energy": "Per serving (12) 2059kJ 496kcals", "Fat": "37g", "Saturated Fat": "22g", "Carbohydrate": "33g", "Sugars": "28g", "Protein": "7.9g", "Salt": "0.6g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/Flourless-chocolate-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}