{"title": "Fougasse", "tags": null, "planning": {"prep_time": "PT25 minutes, plus overnight resting, proving and coolingM", "cook_time": "PT20M", "total_time": "PT45 minutes, plus overnight resting, proving and coolingM", "serves": "1 fougasse (serves 6-8)"}, "ingredients": [{"item": "200g strong white bread flour"}, {"item": "1 tsp fine salt"}, {"item": "½ tsp dried active yeast"}, {"item": "1 tbsp honey"}, {"item": "50g roughly chopped sun-dried tomatoes, plus 3-4 tbsp of their oil"}, {"item": "50g pitted black olives, roughly chopped"}, {"item": "75g gruyère cheese, coarsely grated"}, {"item": "1 tsp dried thyme"}, {"item": "75g strong white bread flour"}, {"item": "pinch easy bake yeast"}], "instructions": [{"step": "The night before, prepare the poolish. Beat the fl our and yeast with 75ml hot water. Scrape down the sides, cover with cling fi lm and set aside at room temperature for 8-16 hours."}, {"step": "The next day, mix the fl our, salt and yeast, then slowly incorporate the poolish, honey and 80ml hot water until you have a smooth and slightly sticky dough."}, {"step": "Use some of the sun-dried tomato oil to coat your hands and lightly grease the work surface, then vigorously knead the dough for 1 minute. Rest for 10 minutes. Knead again with well-oiled hands for 1 minute; rest for 10 minutes more."}, {"step": "Press the dough out as fl at as you can; tip the tomatoes, olives, gruyère and thyme into the middle. Fold up and knead for 2-4 minutes, until everything is evenly dispersed throughout the dough. Transfer to a bowl, cover loosely with cling fi lm and leave to rise for 1 hour, until doubled in size."}, {"step": "Generously fl our a large fl at baking sheet (upturn a rimmed one if need be). Stretch out the dough in a large leaf shape, about 2cm thick. Use a sharp, fl oured knife to make a slash down the centre, then slash 3 times either side, to make a leaf, pulling the dough apart to open up the holes. Cover with oiled cling fi lm and leave to rise for 1 hour."}, {"step": "Preheat the oven to 200˚C, gas mark 6. Carefully stretch out the dough to redefi ne the shape. Bake for 12 minutes, then slide off the baking sheet and cook on an oven rack for 3-5 minutes. Cool on a wire rack before serving."}], "nutrition": {"Energy": "996kJ 237kcals", "Fat": "10.1g", "Saturated Fat": "2.8g", "Carbohydrate": "29.6g", "Sugars": "3.8g", "Protein": "7g", "Salt": "1.1g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/Fougasse-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}