{"title": "Fresh strawberry & vanilla New York-style cheesecake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8-12"}, "ingredients": [{"item": "125g McVitie’s Hobnobs biscuits or Waitrose Vanilla Viennese Swirls"}, {"item": "125g Seriously Gingery All Butter Dark Chocolate & Ginger Biscuits"}, {"item": "25g butter, melted"}, {"item": "600g cream cheese"}, {"item": "75g caster sugar"}, {"item": "4 large essential Waitrose Free Range Eggs"}, {"item": "3 tsp vanilla extract"}, {"item": "300g fresh strawberries, hulled and quartered"}, {"item": "1 tbsp icing sugar"}, {"item": "Few sprigs fresh mint, finely chopped"}, {"item": "170ml tub soured cream"}], "instructions": [{"step": "Preheat the oven to 160˚C, gas mark 2. Line the base of a 23cm springform loose-bottomed cake tin with parchment paper. Place the biscuits in a food processor and whizz until fine crumbs. Tip into a bowl, add the melted butter and mix well. Press the biscuits into the base of the tin and place in the fridge to chill."}, {"step": "Beat together the cream cheese and sugar with an electric hand whisk until smooth then carefully add the eggs one at a time, with the vanilla extract, until well mixed – be careful not to over whisk. Pour the mixture onto the chilled biscuit base and bake in the middle of the oven for 50 minutes until just set. Turn off the heat and leave the cake to cool in the oven with the door open."}, {"step": "Meanwhile, place the strawberries in a bowl with the icing sugar and mint and toss together well."}, {"step": "When the cheesecake is completely cooled, spoon the soured cream over the top and spread to give a thin layer then decorate with the fresh, minted strawberries."}], "nutrition": {"Energy": "1991.584kJ 476kcals", "Fat": "34.9g", "Saturated Fat": "22.7g", "Carbohydrate": "30.9g", "Sugars": "23.5g", "Salt": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/SUNSTRAW.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}