{"title": "Fruity Earl Grey tea loaf", "tags": null, "planning": {"prep_time": "PT10 minutesM", "cook_time": "PT1 hour 5 minutesM", "total_time": "PT1 hour and 15 minutesM", "serves": "10"}, "ingredients": [{"item": "2 x Twinings Earl Grey Tea Bags"}, {"item": "250g Waitrose Dried Vine Fruit Mix or Sweet & Tangy Fruit Mix"}, {"item": "60g dark brown muscovado sugar"}, {"item": "275g plain flour"}, {"item": "2 1/2 tsp baking powder"}, {"item": "1 tsp ground mixed spice"}, {"item": "1/4 t sp salt"}, {"item": "2 oranges, 1 finely grated into a zest, 1 kept for decorating"}, {"item": "2 Waitrose British Blacktail Large Free Range Eggs, beaten"}, {"item": "50g granulated sugar"}], "instructions": [{"step": "Grease and line a 900g loaf tin and preheat the oven to 180°C, gas mark 4."}, {"step": "Place the tea bags in a medium-sized saucepan and pour over 300ml just-boiled water. Turn on the heat and simmer for 2 minutes then lift out and discard the tea bags. Stir in the fruit and muscovado sugar and simmer for another 1 minute then transfer to a large, heatproof mixing bowl."}, {"step": "In a separate bowl, stir together the flour, baking powder, mixed spice, salt and grated orange zest."}, {"step": "Stir the eggs into the cooling tea mix followed by the dry ingredients. Spoon into the prepared tin and bake for 1 hour (until a skewer inserted in the centre comes out clean)."}, {"step": "About 20 minutes before the end of baking time, pare the rind of the reserved orange and cut into thin strips. Heat 25g of the granulated sugar in a small saucepan with the juice of ½ the orange; stir until dissolved. Add the orange strips, leave to cool slightly, then stir in the remaining 25g sugar. Spoon over the cake while still warm in the tin then leave to cool before slicing to serve."}], "nutrition": {"Energy": "1,010kJ 238kcals", "Fat": "1.9g", "Saturated Fat": "0.5g", "Carbohydrate": "50.4g", "Sugars": "29g", "Protein": "4.9g", "Salt": "0.5g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/FruityEarlGreyTeaLoaf.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}