{"title": "Fruit tartlets", "tags": null, "planning": {"prep_time": "PT1 hour, plus resting, cooling and chillingM", "cook_time": "PT35M", "total_time": null, "serves": "8"}, "ingredients": [{"item": "600g mixed summer berries (strawberries hulled and sliced)"}, {"item": "2 tbsp apricot conserve"}, {"item": "100g unsalted butter, chilled"}, {"item": "250g plain flour, plus extra for dusting"}, {"item": "1⁄2 tsp fine salt"}, {"item": "100g golden caster sugar"}, {"item": "3 eggs (1 whole and 2 separated)"}, {"item": "4 egg yolks"}, {"item": "90g golden caster sugar"}, {"item": "11⁄2 tbsp plain flour"}, {"item": "300ml whole milk"}, {"item": "1 vanilla pod, seeds scraped out (or 2 tsp vanilla bean paste)"}, {"item": "170ml double cream, chilled"}], "instructions": [{"step": "Remove the butter from the fridge 5 minutes before making the pastry. Sift the flour and salt into a large bowl and make a well in the centre. Cube the butter and add to the bowl with the sugar, whole egg and 2 egg yolks. Using your fingertips, gently rub everything together until it naturally clumps and forms a rough dough (or pulse in a food processor). Knead briefly on a lightly floured surface until smooth (don’t overwork), then wrap in baking parchment and flatten into a disc. Chill for at least 1 hour."}, {"step": "For the crème pâtissière, whisk together the egg yolks, sugar and flour in a large bowl with a pinch of salt, until pale and thick. Gently heat the milk, vanilla pod and seeds (or bean paste) to almost boiling. Pour over the egg yolks, whisking constantly, until smooth. Return to the pan and cook over a low-medium heat, whisking constantly for about 10 minutes, until thickened, then remove and discard the vanilla pod. Spread over a plate, cover the surface with cling film, cool and chill."}, {"step": "Divide the pastry into 8 equal pieces. Briefly knead a piece to make it pliable and roll into a circle about the thickness of a £1 coin and large enough to line a 9cm loose-bottomed tartlet case. Carefully line a pastry case, pressing into the corners and sides. Trim off the excess pastry, then gently press up the rim so it's just higher than the sides of the tin. Prick the base with a fork and put on a large baking tray. Repeat until all the cases are lined; chill for at least 30 minutes."}, {"step": "Preheat the oven to 190 ̊C, gas mark 5. Bake the cases on the middle shelf for about 15 minutes, rotating the tray halfway, until golden. Cool for 2-3 minutes and then, holding each case in a tea towel, trim the sides flush by running a small serrated knife along the top of the tin. Remove the cases from the tins and place upside down on the baking sheet. Lightly beat 1 of the reserved egg whites and use to brush over the outer sides and bases of the pastry cases, so they turn golden when returned to the oven. Bake for 3-4 minutes, or until the sides and bases are golden. Set on a wire rack to cool completely."}, {"step": "Whip the cream to soft peaks, then fold into the chilled crème pâtissière, until evenly incorporated. Spoon among the cooled tart cases and arrange the berries on top. Press the apricot conserve through a sieve into a small saucepan. Add 1⁄2 tbsp water and gently heat, stirring until warm and smooth. Use a pastry brush to dab the warm glaze over the fruit and cool for a few minutes before serving."}], "nutrition": {"Energy": "2,224kj 531kcal", "Fat": "27.8g", "Saturated Fat": "15.6g", "Carbohydrate": "61.4g", "Sugars": "34.8g", "Protein": "8.9g", "Salt": "0.4g", "Fibre": "2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/fruit tarts.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}