{"title": "Full English breakfast bake", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 35 minutesM", "serves": "8"}, "ingredients": [{"item": "450g chestnut mushrooms, cut into small wedges"}, {"item": "400g cherry tomatoes, halved"}, {"item": "227g pack Macsween Black Pudding, halved lengthways"}, {"item": "4 tbsp vegetable oil"}, {"item": "10 rashers smoked streaky bacon"}, {"item": "300g Rankin Selection Irish Brown Soda Bread"}, {"item": "150-200ml semi-skimmed milk"}, {"item": "6 eggs"}, {"item": "100ml double cream"}, {"item": "100g mature cheddar, coarsely grated"}, {"item": "6 salad onions, finely sliced"}], "instructions": [{"step": "Preheat the oven to 220˚C, gas mark 7. Put the mushrooms, tomatoes and black pudding in a roasting tin in a single layer; season and drizzle over 2 tbsp oil. Lay the bacon on top, drizzle over another 1 tbsp oil and cook for 35-40 minutes, until the bacon is crisp and everything else has browned. Check halfway through cooking and keep an eye on the bacon towards the end."}, {"step": "Meanwhile, toast the soda bread in a toaster until light golden, then cut into 2cm pieces. Once the roasting tin ingredients are cooked, carefully pour any excess liquid from the tin into a measuring jug. Top up the liquid with milk to reach 300ml, then whisk in the eggs and cream. Season and stir in the cheese and salad onions."}, {"step": "Reduce the oven to 180˚C, gas mark 4. Grease a medium baking dish (about 20cm x 30cm) with the remaining 1 tbsp oil. Add the mushrooms, tomatoes and black pudding, broken into chunks, followed by the toast pieces. Chop the bacon into short lengths and scatter over the top, then pour over the egg mixture."}, {"step": "You can chill the dish overnight at this stage, if you’re making ahead of time. Bake for 25-30 minutes, until just set (it should have a very slight wobble in the centre). Serve straight away with some roasted tomatoes and your choice of condiments, if liked."}], "nutrition": {"Energy": "2,016kJ 484kcals", "Fat": "32g", "Saturated Fat": "12g", "Carbohydrate": "26g", "Sugars": "6.7g", "Protein": "22g", "Salt": "2.1g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/f/Full-English-breakfast-bake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}