{"title": "Game Pie", "tags": null, "planning": {"prep_time": "PT1 hour 40 minutes, plus 24 hours chillingM", "cook_time": "PT45M", "total_time": "PT2.3 hours to 2.4 hours, plus 24 hours chillingM", "serves": "8"}, "ingredients": [{"item": "600g game casserole meat or any boneless meat from pheasant, partridge, pigeon or duck, cut into bite-size pieces"}, {"item": "200g Venison shoulder meat, cubed"}, {"item": "2 tbsp plain flour"}, {"item": "2 tbsp dripping"}, {"item": "2 onions, peeled and chopped"}, {"item": "2 garlic cloves, peeled and chopped"}, {"item": "200g smoked lardons"}, {"item": "200g mushrooms, sliced"}, {"item": "75g dried wild mushrooms, soaked in 150ml warm water"}, {"item": "200g chestnuts, peeled and sliced"}, {"item": "250ml chicken stock"}, {"item": "375ml red wine"}, {"item": "1 bouquet garni"}, {"item": "1 tbsp redcurrant jelly"}, {"item": "1 egg"}, {"item": "1 tbsp milk for beating with an egg"}, {"item": "350g puff pastry"}], "instructions": [{"step": "Toss the game meat and venison in seasoned flour. Melt the dripping in a large, ovenproof casserole, then add the floured  meat and brown on all sides. Remove from the pan and set aside. Add the onions, garlic and lardons; sauté until lightly  coloured. Add the mushrooms, drained wild mushrooms (reserve their soaking water) and chestnuts; sauté for  a further  5 minutes. Add the stock, wine, water from the wild mushrooms, bouquet garni, redcurrant jelly and meat. Bring to a  simmer, cover and cook gently for about 1 hour until the meat is tender. Allow to cool, and chill for 24 hours.  Preheat the oven to 220°C/gas 7. Transfer the meat mixture to a deep, 30cm x 20cm pie dish. Place a pie funnel in the  centre. Roll out the pastry to the thickness of a £1 coin - about 3mm. Brush the top lip of the pie dish with water  and press on a 2cm strip of pastry. Brush with water, then  lift the rolled pastry and lay it carefully over the pie dish.  Press the edges to seal, make a hole in the centre around the pie funnel and trim the excess. Brush the surface with the  egg wash. Cut out some decorative shapes from the pastry trimmings; arrange these on the surface, then glaze them.  Put the pie in the oven and bake for 40-45 minutes until the pastry is golden and the pie is cooked through."}], "nutrition": {"Energy": "2773.992kJ 663.0kcal", "Fat": "37.1g", "Saturated Fat": "13.1g", "Sugars": "7.7g", "Salt": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/0712080-r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}