{"title": "Game pie", "tags": null, "planning": {"prep_time": "PT1 hour 15 minutesM", "cook_time": "PT2 hours 30 minutesM", "total_time": "PT3 hours 45 minutesM", "serves": "8"}, "ingredients": [{"item": "2 tbsp vegetable oil"}, {"item": "4 x 250g packs game casserole, cut into even-sized pieces"}, {"item": "200g smoked bacon lardons"}, {"item": "8 bay leaves"}, {"item": "20g pack thyme"}, {"item": "25g pack flat leaf parsley, leaves roughly chopped, stalks whole"}, {"item": "50g unsalted butter"}, {"item": "1 large swede, peeled and cut into 3cm chunks"}, {"item": "400g shallots, peeled but with root left intact"}, {"item": "6 allspice berries"}, {"item": "4 cloves"}, {"item": "1 tsp ground ginger"}, {"item": "3 tbsp plain flour"}, {"item": "1 tbsp tomato purée"}, {"item": "330ml bottle pale ale"}, {"item": "500ml fresh chicken stock"}, {"item": "150g unsalted butter, chilled"}, {"item": "150g lard, chilled"}, {"item": "300g plain flour, plus extra for dusting"}, {"item": "1/2 tsp sea salt"}, {"item": "1 egg, lightly beaten, to glaze"}], "instructions": [{"step": "Start with the pastry. Cut 75g butter and 75g lard into cubes (keep the rest chilled) and gently rub into the flour and salt. Gradually pour in 75ml ice-cold water until it just comes together, add a little more water if it feels too dry. Knead briefly on a lightly floured surface until you have a rough dough. Flatten into a 2cm-thick square, wrap tightly in baking parchment and chill for 30 minutes."}, {"step": "While the pastry chills, start the stew. Heat 1 tbsp oil in a large, deep casserole over a medium-high heat. Pat the game pieces dry on kitchen paper, season and sear in batches, for 4-5 minutes, until browned all over; remove and set aside. Add the remaining 1 tbsp oil to the pan with the bacon, cook rapidly to boil off any excess liquid, then fry the lardons for 6-8 minutes, until crisp. Tie the bay leaves, thyme and parsley stalks together with kitchen string and add to the pan with the butter, swede and shallots; season. Cook for 10-12 minutes, until just golden."}, {"step": "Finely grind the allspice and cloves in a pestle and mortar and add to the pan with the ginger, flour and seared game. Cook for 3-4 minutes, stirring constantly, then add the tomato purée and ale. Bring to the boil, then simmer until reduced by 1⁄2. Add the stock and enough water (about 150ml) to just cover the ingredients. Season, cover, and simmer gently for 1 hour 30 minutes, stirring occasionally."}, {"step": "Take the pastry out of the fridge and, on a well-floured surface, roll it out to a long rectangle, about 18cm x 50cm; keep the edges as straight as possible. Slice 1⁄2 the remaining butter and lard into thin shards and dot all over the top 2/3 of the dough. Fold the unbuttered bottom 1/3 up to cover the central 1/3, then fold down the top 1/3 to encase the butter. Seal the edges, pressing them with a rolling pin and give the dough a 90 ̊ turn; it should look like a closed book."}, {"step": "Press along the dough to elongate it, then roll out again to a long rectangle shape. Dot with the remaining butter and lard as before, repeating the folds. Seal the edges, wrap in the parchment and chill for 30 minutes. Repeat the rolling and folding 4 more times. Wrap the dough up again and chill for at least 30 minutes more."}, {"step": "Uncover the casserole and simmer for a final 30-45 minutes, until the meat is tender and coated in a thick sauce. Season and transfer to a pie dish – a large 1.5-litre dish or 8 x 200ml dishes will work; discard the woody herbs and allow to cool completely. Stir in the parsley leaves. The filling and unrolled pastry can now be covered and chilled for up to 3 days (or frozen for up to 3 months)."}, {"step": "Preheat the oven to 220 ̊C, gas mark 7. Roll the pastry out on a floured work surface so that it is large enough to cover the filled pie dishes with plenty overhanging; reroll as needed. Cut holes in the pie centres to let steam escape."}, {"step": "Brush the rims of the dishes with the egg, cut 1.5cm-wide strips from the excess pastry and secure to the rim. Brush with more egg wash (add a pie funnel now, if using), then lay over the main piece of pastry. Trim any overhang, crimp the edges and egg wash the top. Decorate using the back of a knife or with pastry trimmings, if liked. Bake for 30 minutes, until golden and piping hot; cover with foil if it starts to brown too quickly."}], "nutrition": {"Energy": "3,935kJ 945kcals", "Fat": "64.3g", "Saturated Fat": "28.1g", "Carbohydrate": "40.5g", "Sugars": "5.7g", "Protein": "51g", "Salt": "1.5g", "Fibre": "3.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/WKGame_Pies_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}