{"title": "Giant chocolate marshmallows", "tags": null, "planning": {"prep_time": "PT40 minutes, plus settingM", "cook_time": "PT10M", "total_time": "PT50 minutes, plus settingM", "serves": "12"}, "ingredients": [{"item": "250g golden caster sugar"}, {"item": "1 tbsp liquid glucose"}, {"item": "50g dark chocolate (70% cocoa)"}, {"item": "5 gelatine leaves (we used Costa)"}, {"item": "3 egg whites"}, {"item": "½ tsp salt"}, {"item": "1 tsp vanilla extract"}, {"item": "4 tbsp icing sugar"}, {"item": "2 tbsp cornflour"}, {"item": "2 tbsp cocoa powder"}], "instructions": [{"step": "Line a 900g loaf tin with parchment paper. Put the sugar, glucose and 150ml warm water in a pan. Dissolve the sugar over a low heat; brush the sides of the pan with water to stop it crystallising. Leave the syrup to simmer until it reaches 125˚C (hard ball stage) on a sugar thermometer; don’t stir. If you don’t have a thermometer, spoon a little syrup into a glass of cold water; if it sets immediately, then it’s at the correct temperature."}, {"step": "Meanwhile, melt the chocolate in a bowl set over a pan of barely simmering water; set aside to cool briefly. Separate the gelatine leaves and leave to soak in cold water for 5 minutes."}, {"step": "Just before the sugar syrup comes to temperature, use electric beaters or a freestanding mixer to whisk the egg whites and salt to stiff peaks in a large bowl. Put a tea towel under the bowl to secure it, then quickly and carefully pour the hot syrup down the inside of the bowl, whisking continuously. One at a time, squeeze the excess water from the gelatine leaves, then beat into the hot meringue. Keep beating until completelycool; about 10 minutes. Beat in the vanillauntil combined, then gently stir through the melted chocolate with a spatula until just rippled. Pour into the loaf tin and leave to set for at least 3 hours."}, {"step": "Sift the icing sugar, cornflour and cocoa powder onto a clean baking tray. Tip in the marshmallow; remove the parchment and coat with the sugar mixture. Cut the marshmallow into 12 large, even pieces and dust again. They will keep for up to 3 days, stored in an airtight container."}], "nutrition": {"Energy": "691kJ/163kcals", "Fat": "1.9g", "Saturated Fat": "1.1g", "Carbohydrate": "33.9g", "Sugars": "29.9g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Marshv1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}