{"title": "Gingerbread loaf cake with sticky orange ginger glaze", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": null, "total_time": "PT45M", "serves": "1 loaf"}, "ingredients": [{"item": "150g self-raising flour"}, {"item": "1 tbsp ground ginger"}, {"item": "½ tsp ground cinnamon"}, {"item": "½ tsp mixed spice"}, {"item": "175ml whole milk"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "85g golden syrup"}, {"item": "40g black treacle"}, {"item": "85g dark brown soft sugar"}, {"item": "75g unsalted butter"}, {"item": "1 British Blacktail Free Range medium egg"}, {"item": "30g crystallised stem ginger + 15g for garnish, chopped"}, {"item": "50g icing sugar, sifted"}, {"item": "½ orange"}, {"item": "¼ tsp ground ginger"}], "instructions": [{"step": "Preheat the oven to 170 ̊C, gas mark 3; grease and line a 900ml loaf tin. Combine the flour, ginger, cinnamon and mixed spices in a bowl and then, in a separate bowl, mix together the milk and bicarbonate of soda and set aside."}, {"step": "Place the golden syrup, black treacle, sugar and butter into a heavy based saucepan and heat on low until the butter has melted, stirring occasionally- be careful not to let the mixture boil at this stage. Pour the mixture into a large mixing bowl and stir in the egg and 30g stem ginger."}, {"step": "Add the dry ingredients and mix quickly to combine, then add the milk mixture and gently mix to emulsify. Pour into the loaf tin and bake on the middle shelf of the oven for 40-45 minutes, or until a skewer comes out clean. Check the colour of the cake after 30 minutes - if it’s getting dark quickly then cover with foil for the remainder of the cooking time. Cool inside the tin for 15 minutes then turn out onto a wire rack to cool completely."}, {"step": "To make the glaze, combine the icing sugar with 1 tbsp orange juice and the ground ginger (peel a few strips of zest with a vegetable peeler first to use as garnish). Add a little more orange juice if necessary to achieve a drizzle consistency. Drizzle the glaze over the cooled loaf then scatter with remaining chopped crystallised ginger and shredded orange zest."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Gingerbread loaf cake with sticky orange ginger glaze.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}