{"title": "Ginger chicken noodle soup", "tags": null, "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT3 hours 15 minutesM", "total_time": "PT3 hours 40 minutes, plus coolingM", "serves": "6"}, "ingredients": [{"item": "1 whole chicken, about 1.5kg"}, {"item": "500g chicken wings"}, {"item": "1 large onion, unpeeled and halved"}, {"item": "1 carrot, halved"}, {"item": "1 celery stalk, halved"}, {"item": "6 black peppercorns"}, {"item": "2 star anise"}, {"item": "75g fresh root ginger, sliced"}, {"item": "2 tsp salt"}, {"item": "2 tsp light brown soft sugar"}, {"item": "300g shiitake mushrooms, stems trimmed and larger ones sliced or halved"}, {"item": "200g frozen soya beans"}, {"item": "90g pack baby pak choi"}, {"item": "2 tbsp soya sauce"}, {"item": "1 tbsp shaoxing rice wine"}, {"item": "1 tbsp mirin"}, {"item": "250g pack dried fine egg noodles"}, {"item": "1 tsp toasted sesame oil"}, {"item": "1 lime, juice, plus extra wedges to serve"}, {"item": "2 salad onions, finely sliced"}, {"item": "1 red chilli, finely sliced"}, {"item": "Selected stores"}], "instructions": [{"step": "Put all the broth ingredients in a large stock pot or casserole. Cover them with cold water (about 3 litres) and place over a high heat. Bring to a simmer, skim any scum off the surface, then turn to the lowest heat and simmer as gently as possible (you want a few small bubbles coming up occasionally) for 35 minutes. Lift the chicken out and carefully cut away the breast meat (use a chopping board placed inside a baking tray to catch any escaping juices); cool the breasts, then chill until needed. Return the carcass to the pot and continue to simmer gently for 2 hours. Skim off any scum that rises to the surface throughout."}, {"step": "Leave to cool for 30 minutes, then lift out the remaining chicken. Strain the liquid into a large, clean pan, through a fine sieve lined with a double layer of kitchen paper; you should have about 1.5 litres. Discard the wings and aromatics. Place the pan over a high heat and bubble vigorously for 20 minutes to reduce; you should be left with about 1.25 litres. Meanwhile, shred all the dark meat from the carcass, discarding the skin and bones, then slice the breasts; set all aside."}, {"step": "Add the mushrooms to the stock and simmer for 5 minutes, then add the shredded dark chicken meat, soya beans, pak choi, soy sauce, shaoxing and mirin. Simmer gently for another 3-5 minutes. Meanwhile, cook the noodles according to pack instructions, then drain, rinse in cold water and toss with the sesame oil."}, {"step": "Squeeze the lime juice into the broth and check the seasoning, adding more soy sauce, lime or a pinch of sugar, if needed. Divide the noodles and chicken breast between 6 bowls and ladle over the broth, shredded chicken and vegetables, garnishing with the salad onions and chilli."}], "nutrition": {"Energy": "2,078kJ 494kcals", "Fat": "13.1g", "Saturated Fat": "3.3g", "Carbohydrate": "41g", "Sugars": "5.5g", "Protein": "48g", "Salt": "2.4g", "Fibre": "5.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Ginger-chicken-noodle-soup.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}