{"title": "Glazed roast chicken with fennel, chilli, tomato & potato stuffing", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6"}, "ingredients": [{"item": "2kg whole extra large chicken"}, {"item": "3 tbsp extra virgin olive oil, plus extra for greasing"}, {"item": "375g waxy potatoes"}, {"item": "1 onion, finely chopped"}, {"item": "1 stick celery, diced"}, {"item": "½-1 tsp chilli flakes"}, {"item": "1 tsp fennel seeds"}, {"item": "2 cloves garlic, grated to a purée"}, {"item": "75g sun-dried tomatoes, roughly chopped"}, {"item": "Leaves from 5 sprigs oregano, chopped"}, {"item": "Grated zest of ½ unwaxed lemon"}, {"item": "300ml dry white wine"}, {"item": "For the glaze"}, {"item": "1 tsp fennel seeds, bashed in a mortar"}, {"item": "½-1 tsp chilli flakes"}, {"item": "2 tbsp honey"}, {"item": "Juice of ½ lemon"}], "instructions": [{"step": "Preheat the oven to 190ºC, gas mark 5 and take the chicken out of the fridge for 30 minutes to come up to room temperature. After"}, {"step": "minutes, remove the string from the chicken and release the legs, season, then cook in a snug roasting tin for 1 hour 20 minutes."}, {"step": "Add the olive oil to a frying pan and chop the potatoes into small cubes and add to the pan. Sauté over a medium heat – lower it as the potatoes start to soften – for about 5-6 minutes, until tender (but retaining bite) and pale gold. Add the onion and celery and cook for 2-3 minutes until they’re soft, then add the spices and garlic and cook for another 2 minutes. Scrape into a bowl and add the tomatoes, oregano and lemon zest. Mix together and season. Spoon into a shallow ovenproof dish and cover with foil."}, {"step": "Mix the glaze ingredients. When the chicken has been roasting for 1 hour 20 minutes, remove the roasting tin from the oven. Spoon the glaze over the bird, then add the wine to the tin and return the chicken to the oven for a further 20-30 minutes or until thoroughly cooked, the juices run clear and there is no pink meat. Put the covered stuffing on the shelf below the chicken and cook for 25-30 minutes, or until piping hot and the potatoes tender. Move the chicken to a warm platter, keep covered for 10 minutes."}, {"step": "Drain the juices from the tin into a jug and throw in a handful of ice cubes – this drives the fat to the surface so you can see it clearly and spoon it off. Bring the juices to the boil back in the roasting tin or saucepan and boil until it has a good flavour (it doesn’t have to be thick). Serve the chicken and stuffing with the reduced cooking juices."}], "nutrition": {"Energy": "2,546kJ 611kcals", "Fat": "35g", "Saturated Fat": "8.1g", "Carbohydrate": "20g", "Sugars": "8.4", "Protein": "42g", "Salt": "0.8g", "Fibre": "4.2"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Glazedroastchicken.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}