{"title": "Gluten-free & dairy-free chocolate cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "one cake (10–12 slices)"}, "ingredients": [{"item": "150g dairy-free margarine, diced, plus extra for greasing"}, {"item": "200g dairy-free dark chocolate, 70% cocoa solids, chopped or broken into pieces"}, {"item": "175g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "4 large eggs"}, {"item": "100g Dove’s Farm Gluten-Free Plain White Flour Blend"}, {"item": "½ tsp xanthan gum"}, {"item": "2 tsp gluten-free baking powder"}, {"item": "Raspberries and strawberries, to decorate"}, {"item": "200g dairy-free dark chocolate, 70% cocoa solids, chopped or broken into pieces"}, {"item": "200ml dairy-free cream"}, {"item": "1 tsp vanilla extract"}], "instructions": [{"step": "Preheat the oven to 180°C/gas 4 or 160°C/gas 3 for a fan-assisted oven. Lightly grease a 20cm/8in round springform cake tin with dairy-free margarine and line the base with baking parchment. Put the chocolate in a large heatproof bowl and rest it over a pan of gently simmering water, making sure that the bottom of the bowl does not touch the water. Heat, stirring occasionally, until the chocolate has melted."}, {"step": "Put the dairy-free margarine and sugar in a large mixing bowl and, using an electric mixer, beat together until light and fluffy. Beat in the vanilla extract, then gradually beat in the eggs, one at a time, until well mixed. Using a large spoon, carefully fold in the melted chocolate."}, {"step": "Sift the white flour blend into a separate large bowl. Add the xanthan gum and baking powder and mix together. Using a large metal spoon, fold the flour mixture into the egg mixture. Mix well, but take care not to overmix, then pour into the prepared tin and level the surface with the back of a spoon."}, {"step": "Bake for about 45 minutes until firm to the touch and a skewer inserted in the centre comes out clean. Remove from the oven and leave to cool in the tin for 5 minutes. Turn out of the tin, transfer to a wire rack and leave to cool completely."}, {"step": "To make the chocolate ganache icing, put the chocolate in a large heatproof bowl and rest it over a pan of gently simmering water, making sure that the bottom of the bowl does not touch the water. Heat, stirring occasionally, until the chocolate has melted. Heat the dairy-free cream in a saucepan over a low heat until hot but not boiling. Add the vanilla extract, then add to the melted chocolate and, using a wooden spoon, stir in until smooth and thick. Leave to cool for 10 minutes, then spread or pour the ganache over the top of the cake."}, {"step": "Wash and dry some raspberries and strawberries, cut the strawberries in half and place on top of the cake for decoration."}, {"step": "Adapted from Simply gluten-free & dairy free by Grace Cheetham"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/GFchoccake_400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}