{"title": "Gluten-free pistachio pancakes with vanilla-cardamom strawberries", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT40M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "100g mixed seeds"}, {"item": "100g pistachios"}, {"item": "100g gluten free rolled porridge oats"}, {"item": "420ml Rachel’s Organic Greek Style Natural Set Yogurt"}, {"item": "150ml semi-skimmed milk"}, {"item": "3 eggs"}, {"item": "1 tsp baking powder"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "2 tsp vegetable oil"}, {"item": "275g pack Waitrose & Partners Strawberries, hulled and halved (quartered if large)"}, {"item": "1 vanilla pod (or 1 tsp vanilla bean paste), split and seeds scraped out"}, {"item": "6 cardamom pods, bashed"}, {"item": "60g orange blossom honey, plus extra to serve"}, {"item": "1 lemon, pared zest, juice of all"}], "instructions": [{"step": "Put all the ingredients for the strawberries into a small pan over a low-medium heat and bring to a simmer. Cook gently for 8-10 minutes until the strawberries are softened but still holding their shape, then set aside."}, {"step": "Meanwhile, pulse the seeds and pistachios in the small bowl of a food processor, until roughly chopped. Reserve 50g, then whizz the rest with the porridge oats until finely ground. Tip into a large bowl and stir in 300ml yogurt, the milk, eggs, baking powder and bicarbonate of soda."}, {"step": "Heat 1 tsp oil in a heavy- based frying pan and, once hot, add 2 heaped dessert spoons of batter per pancake (you should be able to make 3-4 at a time, being careful not to overfill the pan). Reduce the heat to medium and cook for 4-5 minutes, until bubbles appear and the tops of the pancakes start to set. Flip and cook for 3-4 minutes, until browned and set. Keep warm and repeat with the remaining batter. Serve with a dollop of the remaining yogurt, the strawberries (avoid the whole spices), and the reserved seeds and nuts scattered over."}], "nutrition": {"Energy": "2,856kJ 685kcals", "Fat": "43g", "Saturated Fat": "11g", "Carbohydrate": "45g", "Sugars": "25g", "Protein": "25g", "Salt": "0.94g", "Fibre": "6.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Gluten-free-pistacho-pancakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}