{"title": "Gluten & dairy free bread", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT35M", "cook_time": "PT35M", "total_time": "PT1 hour 10 minutesM", "serves": "2 loaves"}, "ingredients": [{"item": "2 tsp Doves Farm Quick Yeast"}, {"item": "1 tsp caster sugar"}, {"item": "265g Doves Farm Free From Gluten White Bread Flour"}, {"item": "75g cornflour"}, {"item": "30g Polenta Valsugana, plus extra for dusting"}, {"item": "1 tbsp Doves Farm Free From Gluten Xanthan Gum"}, {"item": "40g Waitrose Love Life Golden Linseeds"}, {"item": "75g natural coconut yogurt"}, {"item": "1 tbsp olive oil"}], "instructions": [{"step": "Stir the yeast and caster sugar into 280ml lukewarm water then set aside for 5 minutes."}, {"step": "Meanwhile, place the flour, cornflour, polenta, xanthan gum, linseeds, 1 tsp fine salt and the yogurt in a food mixer fitted with a paddle. Turn the machine to a low setting and slowly pour in the yeast mixture. Increase the speed and continue to mix for a further 3-4 minutes to make a soft and sticky dough (it’s a much wetter dough at this stage compared to regular bread dough)."}, {"step": "Preheat the oven to 190°C, gas mark 5. Dust the work surface and your hands with a little polenta and divide the dough into 2 equal pieces. Shape each half into a neat oval and place onto a dusted tray. Brush the tops with a little more oil and dust lightly with polenta. Cover with a clean tea towel and set aside in a warm place for 30 minutes until slightly risen."}, {"step": "Bake for 35-40 minutes until the loaves are risen, golden brown and feel hollow when tapped. Leave to cool completely on wire racks before slicing."}], "nutrition": {"Energy": "602kJ 143kcals", "Fat": "4g", "Saturated Fat": "1.4g", "Carbohydrate": "21.8g", "Sugars": "0.5g", "Protein": "4.9g", "Salt": "0.4g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/WRWK23062016-gluten-dairy-free-bread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}