{"title": "Seeded beer bread", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT15 minutes + provingM", "cook_time": "PT30–40 minuteM", "total_time": null, "serves": "1 loaf"}, "ingredients": [{"item": "250ml Celia Organic Gluten Free Czech Lager"}, {"item": "7g Dove’s Quick Yeast"}, {"item": "500g Dove’s Gluten Free White Bread Flour, plus more for kneading"}, {"item": "1 tsp salt"}, {"item": "1 tbsp caster sugar"}, {"item": "75g Waitrose Mixed Seeds, plus 1 tbsp for topping"}, {"item": "4 tbsp Linwoods Shelled Hemp"}, {"item": "2 Waitrose British Blacktail Medium Free Range Eggs"}, {"item": "Juice of 1 lemon"}, {"item": "3 tbsp olive oil, plus extra for greasing"}], "instructions": [{"step": "In a saucepan, heat the gluten-free beer until just warm. Add the yeast and set aside for 3-4 minutes or until it starts to froth."}, {"step": "Put the dry ingredients into a bowl. In a jug, whisk together the eggs, lemon juice and olive oil, then stir into the dry mix. Add the beer and yeast mix and stir together. Transfer to a well-floured surface and knead for 2-3 minutes or until the dough is smooth. The dough will be tacky so knead with lightly oiled hands if necessary."}, {"step": "Shape the dough into a round and transfer to a lightly oiled baking tray. Sprinkle over the remaining 1 tbsp seeds and cover with cling film. Allow to rise for 1 hour."}, {"step": "Heat the oven to 200ºC, gas mark 6, and once the dough has risen make a shallow cross on top with a sharp knife. Slide a baking tray containing 4-5 ice cubes into the bottom of the oven. Put the bread tray into the top of the oven and bake for 30-40 minutes until golden."}, {"step": "Remove and check the loaf is cooked by tapping the bottom; it should sound hollow. Transfer to a cooling rack and allow to cool completely before slicing. Eat within 3 days."}], "nutrition": {"Energy": "1,177kJ 280kcals", "Fat": "9.9g", "Saturated Fat": "1.5g", "Carbohydrate": "39g", "Sugars": "2.3g", "Protein": "6.6g", "Salt": "0.7g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/WRWK17052018_BeerBread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}