{"title": "Gnocchi with roasted romano peppers, aubergine, chilli and rocket", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT30M", "total_time": "PT55M", "serves": "4"}, "ingredients": [{"item": "4 romano peppers, halved and deseeded"}, {"item": "2½ tbsp extra virgin olive oil"}, {"item": "2 garlic cloves, unpeeled and bashed"}, {"item": "1 large aubergine (about 300g), cubed"}, {"item": "handful basil leaves"}, {"item": "1 red chilli, deseeded"}, {"item": "50g grana padano, grated"}, {"item": "500g pack essential Waitrose fresh gnocchi"}, {"item": "40g wild rocket"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Toss the peppers in 1 tsp olive oil, season and arrange skin-side up on a baking tray with the garlic. Brush a second baking tray with 2 tsp oil, then add the aubergine; season. Put both trays in the oven to roast for 20-25 minutes (peppers on the top shelf ), turning the aubergine occasionally. Meanwhile, put the basil leaves, chilli and most of the grated cheese into a food processor, then whizz until the mixture resembles breadcrumbs."}, {"step": "Remove the vegetables from the oven, then carefully peel and discard the skin from the peppers and garlic cloves (allow to cool slightly fi rst, if necessary). Add the roasted garlic and half the peppers to the food processor with the remaining 1½ tbsp oil; whizz to a semi-smooth paste and season. Tip into a large pan with the aubergine. Cut the remaining peppers into strips and add to the pan."}, {"step": "Bring a large saucepan of salted water to the boil, add the gnocchi and cook for 2 minutes. Meanwhile, gently heat the pepper and aubergine sauce. Drain the cooked gnocchi, then tip into the sauce, tossing through. Divide between plates, piling the rocket alongside and scattering over the remaining cheese."}], "nutrition": {"Energy": "1,582kJ 377kcals", "Fat": "13g", "Saturated Fat": "4g", "Carbohydrate": "48g", "Sugars": "6.6g", "Protein": "12g", "Salt": "0.9g", "Fibre": "8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Gnocchi-with-roasted-romano-peppers.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}