{"title": "Gnudi with tomato sauce", "tags": null, "planning": {"prep_time": "PT25 minutes, plus chillingM", "cook_time": "PT25M", "total_time": "PT50 minutes, plus chillingM", "serves": "4"}, "ingredients": [{"item": "250g ricotta cheese"}, {"item": "75g parmigiano reggiano, finely grated"}, {"item": "¼ whole nutmeg, grated"}, {"item": "300g semolina"}, {"item": "extra virgin olive oil, to serve"}, {"item": "2 tbsp extra virgin olive oil"}, {"item": "4 garlic cloves, peeled"}, {"item": "1 large carrot, roughly chopped"}, {"item": "1 large onion, roughly chopped"}, {"item": "2 celery stalks roughly chopped"}, {"item": "½ x 25g pack basil, leaves and stalks separated"}, {"item": "½ x 25g pack parsley, leaves and stalks separated"}, {"item": "½ x 20g pack rosemary"}, {"item": "3 bay leaves"}, {"item": "400g can plum tomatoes"}, {"item": "½ tsp pure clear honey"}], "instructions": [{"step": "Start the gnudi the day before. Briefly drain the ricotta in a sieve, then mix with the parmigianoreggiano and nutmeg in a bowl; season with salt, if needed. Spread ½ the semolina over a baking tray. Dust your hands with a little of the remaining semolina and shape the ricotta mixture into 20 small balls (about 2.5cm in diameter); add them to the tray as you go. Scatter over the remaining semolina, making sure the balls are evenly coated. Chill, uncovered, for at least 8 hours or ideally 24 hours, gently turning the gnudi in the semolina every now and then. (The gnudi can be prepared up to 3 days in advance)."}, {"step": "For the sauce, heat the oil in a pan and cook the garlic cloves over a medium heat for 2-3 minutes, until golden. Add the vegetables and cook until starting to soften – about 5-7 minutes. Throw in the herbs (reserve some of the soft leaves to garnish) and cook for 2 minutes. Tip in the tomatoes, breaking them up slightly, then half-fill the can with water and add to the pan. Simmer briskly for 10-12 minutes, until thickened. Sieve into a clean pan, pushing as much tomato through as possible; season and stir in the honey. Simmer gently for a few minutes more to thicken, if needed."}, {"step": "To cook the gnudi, carefully lower them into a pan of salted boiling water; you may need to do this in batches. Simmer briskly for 2-3 minutes, until they rise to the surface. Transfer to plates with a slotted spoon; allow 5 per person. Spoon over the sauce, scatter with the reserved herbs and finish with a splash more oil."}], "nutrition": {"Energy": "2,400kJ 571kcals", "Fat": "21.9g", "Saturated Fat": "9.8g", "Carbohydrate": "71.9g", "Sugars": "11.5g", "Protein": "21.6g", "Salt": "0.7g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/This-Month-We-Love_-Waitrose-Kitchen-124619_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}