{"title": "Goat's cheese, apple & beetroot salad", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT15M", "total_time": "PT30M", "serves": "2"}, "ingredients": [{"item": "60g fresh breadcrumbs"}, {"item": "6g caraway seeds"}, {"item": "25g flour"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "2 x 100g Waitrose Chèvre Blanc cheese"}, {"item": "Oil to shallow fry"}, {"item": "2 cooked and peeled beetroot, roughly sliced into quarters"}, {"item": "1 eating apple, such as Braeburn, cored and sliced roughly into thin slices"}, {"item": "1 tbsp cider vinegar"}, {"item": "2 tbsp rapeseed oil"}, {"item": "Small handful pea shoots"}, {"item": "40g walnuts, roughly chopped"}], "instructions": [{"step": "Tip the breadcrumbs into a bowl and stir in the caraway seeds. Then sift the flour into a second bowl. Finally crack the eggs into a third bowl and beat them."}, {"step": "Unwrap the cheese and, taking one at a time, drop it into the flour, then into the eggs and finally into the breadcrumbs. Dip the cheese into the egg for a second dunk and then finish with a second coating of crumbs. Then repeat with the second cheese."}, {"step": "Pour about ½ cm depth of oil into a small frying pan over a medium-high heat. When hot, carefully lay the crumbed cheeses into the oil and cook for about 3 minutes each side, or until the crumbs are nicely browned and crisp. Tip the pan a little to help pool the oil and fry the sides of the cheese."}, {"step": "Remove the fried cheese and place on a piece of clean kitchen roll to drain any excess oil."}, {"step": "Quickly toss together the cut beetroot, apple, cider vinegar and rapeseed oil, and divide between 2 plates. Top each with a few pea shoots and chopped walnuts, then add the cheese and drizzle with the dressing."}], "nutrition": {"Energy": "3,680kJ 885kcals", "Fat": "65.1g", "Saturated Fat": "21.2g", "Carbohydrate": "39.2g", "Sugars": "17g", "Protein": "35.6g", "Salt": "2.4g", "Fibre": "5.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/WRWK-14042016-beetroot-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}