{"title": "Gochujang pork-stuffed cabbage leaves with smashed cucumber", "tags": null, "planning": {"prep_time": "PT35M", "cook_time": "PT30M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "12 savoy cabbages leaves, the biggest you can find"}, {"item": "500g essential Waitrose pork mince"}, {"item": "2 tbsp Waitrose Cooks’"}, {"item": "gochujang paste"}, {"item": "bunch essential Waitrose salad onions, finely sliced"}, {"item": "50g fresh root ginger, finely grated"}, {"item": "4 garlic cloves, crushed"}, {"item": "2 tbsp Chinese rice vinegar (or use sherry vinegar)"}, {"item": "2 tsp reduced-salt soy sauce"}, {"item": "2 tsp sesame oil"}, {"item": "1 essential Waitrose cucumber"}, {"item": "1 tsp essential Waitrose clear honey"}, {"item": "1 red chilli, finely sliced"}], "instructions": [{"step": "Cut the toughest part of the rib out of the cabbage leaves, finely chop the ribs and put in a large bowl. Cook the leaves in boiling water for 2-3 minutes until soft, then refresh in a bowl of ice-cold water until cool. Drain carefully and spread out on kitchen paper."}, {"step": "Mix the mince with the cabbage ribs, gochujang, white part of the salad onions, ginger, 3⁄4 of the garlic, 1 tbsp rice vinegar and 1 tsp each soy and sesame oil. Fry off a pinch to taste; season if needed."}, {"step": "Divide the pork between the cabbage leaves. Fold in the sides, then tightly roll up to encase the filling; place seam-side down on a tray. Steam, in batches, for 6-8 minutes, until piping hot in the centre."}, {"step": "Meanwhile, bash the cucumber with a rolling pin until cracked all over. Roughly chop, tossing in a bowl with the honey and remaining garlic, 1 tsp each soy and sesame oil and 1 tbsp rice vinegar. Serve alongside the stuffed cabbage parcels, with some steamed rice, if liked, scattering over the chilli and green salad onion tops."}], "nutrition": {"Energy": "1,234Kj 294Kcal", "Fat": "13.4g", "Saturated Fat": "4.7g", "Carbohydrate": "15.8g", "Sugars": "12.4g", "Protein": "27.6g", "Salt": "1.2g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Pork-stuffed cabbage leaves.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}