{"title": "Golden kiwi & coconut upside-down cakes", "tags": null, "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT20M", "total_time": "PT45 minutes, plus coolingM", "serves": "12"}, "ingredients": [{"item": "75g unsalted butter, softened, plus extra for greasing"}, {"item": "115g light brown muscovado sugar, plus 3 tbsp for sprinkling"}, {"item": "3 Waitrose 1 Perfectly Ripe Golden Kiwis"}, {"item": "160ml can coconut cream"}, {"item": "1 lime, zest, plus extra to serve (optional)"}, {"item": "2 large British Blacktail Free Range Eggs"}, {"item": "50g desiccated coconut"}, {"item": "175g self-raising flour"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Liberally grease a 12-hole muffin tin and sprinkle the extra 3 tbsp sugar between the holes. Trim the ends off the kiwi fruit, then remove the skin with a vegetable peeler. Cut each fruit into 4 slices widthways and sit a slice inside each muffin hole."}, {"step": "In a mixing bowl, cream the butter and sugar using electric beaters until light, about 3-4 minutes. Beat in the coconut cream and lime zest, then beat in the eggs, one at a time. Beat in the desiccated coconut and flour to make a smooth batter."}, {"step": "Divide the batter between the muffin holes and bake for 20 minutes. Cool for 10 minutes, then run a knife around the sides of the cakes to loosen and turn out onto a chopping board. Carefully ease out any pieces of kiwi that have stuck to the tin and place them back on top of the cakes. Scatter with extra lime zest, if liked. Lovely served warm with a dollop of coconut yogurt or ice cream, if liked, or cooled to room temperature and served with tea."}], "nutrition": {"Energy": "Per cake 937kJ 232kcals", "Fat": "11.9g", "Saturated Fat": "8.4g", "Carbohydrate": "26.9g", "Sugars": "15g", "Protein": "3.6g", "Salt": "0.28g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/k/Kiwi-cakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}