{"title": "Gooey chocolate orange puddings with a 'Cream Egg' filling", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25 minutes + chillingM", "cook_time": "PT15M", "total_time": "PT40 minutes + chillingM", "serves": "6"}, "ingredients": [{"item": "200g pack Waitrose Belgian White Chocolate, broken into pieces"}, {"item": "6 tsp orange curd"}, {"item": "65g unsalted butter, very soft, plus extra for greasing"}, {"item": "250g Waitrose Continental Plain Chocolate, broken into pieces"}, {"item": "65g light muscovado sugar"}, {"item": "Finely grated zest of 1 orange"}, {"item": "4 medium Waitrose British Blacktail Eggs"}, {"item": "50g plain flour"}, {"item": "Cocoa powder, for dusting"}, {"item": "Chocolate mini eggs, to decorate"}], "instructions": [{"step": "Melt the white chocolate in a bowl resting over a saucepan of gently simmering water, making sure the base of the bowl is not in contact with the water. Place 6 double-thickness paper fairy cake cases on a plate and spoon two-thirds of the chocolate into the cases. Make a dip in the centre of each with the back of a teaspoon and fill with 1 tsp of orange curd. Freeze for 10 minutes to firm up, leaving the remaining chocolate over the pan of hot water. Spoon this into the cases to cover the orange curd and return to the freezer while making the puddings."}, {"step": "Preheat the oven to 180°C, gas mark 4. Grease 6 x 175–200ml individual metal pudding tins. Melt the plain chocolate as above. Beat together the butter, sugar, orange zest, eggs and flour using a hand-held electric whisk. Beat in the melted plain chocolate."}, {"step": "Spoon two-thirds of the mixture into the tins. Unwrap the frozen white chocolate shapes and press one down into each of the puddings. Spoon the remaining pudding mixture on top and level the surface. Place on a baking sheet and bake for 15 minutes. Remove from the oven, loosen the edges with a knife and leave to stand for 5 minutes."}, {"step": "Invert the puddings onto serving plates and shake them gently to loosen. Lift away the moulds and arrange a few mini eggs on each before dusting with cocoa powder to serve."}], "nutrition": {"Energy": "2,978kJ 714kcal", "Fat": "44.7g", "Saturated Fat": "26.8g", "Carbohydrate": "65.7g", "Sugars": "54.8g", "Protein": "12.2g", "Salt": "0.3g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Gooey chocolate orange puddings.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}