{"title": "Gooseberry and Elderflower filled Victoria Sandwich", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT20-25 minutes, plus coolingM", "total_time": "PT35-40 minutes, plus coolingM", "serves": "8"}, "ingredients": [{"item": "225g unsalted butter, softened"}, {"item": "200g caster sugar"}, {"item": "4 medium eggs"}, {"item": "225g Waitrose Superfine Self Raising Flour"}, {"item": "4 tbsp Waitrose Elderflower Cordial"}, {"item": "For the filling"}, {"item": "142ml pot double cream"}, {"item": "2 tbsp Waitrose Elderflower Cordial"}, {"item": "5 tbsp Wilkin & Sons Ltd Tiptree Green Gooseberry Conserve"}, {"item": "Caster or icing sugar, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and place a shelf in the centre of the oven. Butter 2 x 20cm shallow round cake tins and line the bases with baking parchment. In a large bowl, beat the butter and sugar with an electric hand whisk until pale and fluffy. Add the eggs, 1 at a time, beating well after each addition, then add the elderflower cordial. Sift in the flour and, using a large metal spoon, gently fold together until just combined. The mixture should drop off the end of the spoon when tapped - add a little milk if it is too thick.  Spoon the mixture into the tins. Level the tops with the back of the spoon then place on the centre shelf of the oven and bake for 20-25 minutes, until springy to the touch.  Allow the cakes to stand in the tins for 5 minutes, then turn out onto a wire rack and leave to cool. Peel off and discard the baking parchment.  To serve, whip the cream until it forms soft peaks then stir in the elderflower cordial. Spread the surface of 1 of the cooled cakes with gooseberry conserve and spoon over the whipped cream. Sandwich the cakes together and dust with a little caster or icing sugar."}], "nutrition": {"Energy": "2615.0kJ 625.0kcal", "Fat": "39.5g", "Saturated Fat": "23.3g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/0505ss18-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}