{"title": "Chicken, leek & dill filo pie", "tags": null, "planning": {"prep_time": "PT40M", "cook_time": "PT50M", "total_time": "PT90M", "serves": "6"}, "ingredients": [{"item": "650g spinach, well washed and coarse stems removed"}, {"item": "3 large leeks (400g pack)"}, {"item": "20g dill, leaves only, chopped"}, {"item": "2 tbsp extra virgin olive oil"}, {"item": "75g grated pecorino (or Parmigiano Reggiano)"}, {"item": "250g ricotta"}, {"item": "150g feta, crumbled"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "270g pack filo pastry"}, {"item": "50g butter, melted"}, {"item": "300g cooked chicken, torn into pieces and seasoned"}], "instructions": [{"step": "Put the spinach into a large saucepan – it may need two batches – with about 5 tbsps water. Cover with a lid, set over a medium heat and allow to wilt, turning the spinach over every so often. Keep a close eye on it. It will take 4-6 minutes to cook. Drain and leave until cool."}, {"step": "Cut the tips and the base off the leeks and remove any discoloured or coarse outer leaves. Cut in half lengthways, then into 2-3cm lengths. Put the leeks in a saucepan with the olive oil and sauté over a low heat, stirring frequently, for about 4 minutes. Add salt and pepper, about 3 tbsps water and cover the pan. Allow the leeks to sweat until soft but still keeping their shape. Turn the heat up and drive off any excess moisture if the mixture is very wet."}, {"step": "Taking handfuls of the spinach, squeeze the moisture out of it (you can use your fists or put it between plates). Chop the spinach and add it to the leeks, along with the dill. Season well. In a separate bowl, mix together the pecorino, ricotta, feta and eggs. Season well."}, {"step": "Preheat the oven to 190°C, gas mark 5 and put a baking sheet in to heat up. Use a little butter to grease a 20-23cm cake tin (a spring form one is best). Keep the filo sheets under a tea towel. Line the tin with sheets of filo, arranging them like the spokes of a wheel and letting the ends hang over the edge of the tin. Brush every sheet with butter as you layer them. Use two-thirds of the sheets to line the tin."}, {"step": "Arrange half the vegetables over the bottom of the tin, then put the chicken on top of them. Spread the cheese mixture over, then spoon on the rest of the vegetables. Pull the ends of the filo up to cover the top of the pie, again brushing the undersides with butter. Use the rest of the sheets to cover the top, tucking the ends in down the sides and brushing them with butter. Don’t worry at all if it looks messy – once filo is baked it always looks good."}, {"step": "Slide the pie onto the hot baking sheet in the oven and bake for 45 minutes. If the top is getting too dark in colour, cover it with foil – it will take 45 minutes for the egg and cheese layer to set. Allow to cool for at least 10 minutes when it comes out of the oven – it needs to settle. Unclasp the sides of the tin and slide the pie onto a serving plate."}], "nutrition": {"Energy": "2,199kJ 526kcals", "Fat": "29g", "Saturated Fat": "15g", "Carbohydrate": "30g", "Sugars": "5.1g", "Protein": "35g", "Salt": "2.7g", "Fibre": "3.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/Greek chicken, leek & dill pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}