{"title": "Hand-raised pork pies", "tags": null, "planning": {"prep_time": "PT1 hour 15 minutes, plus cooling and chillingM", "cook_time": "PT45 minutesM", "total_time": null, "serves": "6 large pies"}, "ingredients": [{"item": "4 pork shoulder steaks (about 700g), cut into 1cm dice"}, {"item": "500g piece pork belly, skin removed and cut into 1cm dice"}, {"item": "1 1⁄2 tbsp fine salt"}, {"item": "vegetable oil, for greasing"}, {"item": "1 egg, beaten"}, {"item": "800g plain flour, plus  extra for dusting"}, {"item": "1 1⁄2 tsp fine salt"}, {"item": "320g lard"}, {"item": "200g smoked bacon  lardons"}, {"item": "500ml fresh chicken stock"}, {"item": "4 bay leaves"}, {"item": "3 sheets fine-leaf gelatine"}], "instructions": [{"step": "Preheat the oven to 200 ̊C, gas mark 6. Mix the diced pork shoulder and belly in a large bowl and season with the salt and plenty of black pepper. Divide into 6 rough balls (about 170-180g each) and space out on a baking tray; set aside."}, {"step": "For the pastry, mix the flour and salt in a large mixing bowl. Put the lard in a small pan with 240ml water and gradually bring to the boil. Quickly pour over the flour, mixing it with a wooden spoon until mostly incorporated. Knead the dough in the bowl for a few minutes, until smooth (take care as it’ll be warm). Transfer to a clean work surface, divide into 6 even pieces (about 230g each) and cover each with cling film."}, {"step": "Dust the work surface with flour. Take one ball of dough; tear off 1/3 (about 70g) for the lid and re-cover with the cling film. Press and flatten out the remaining dough on the work surface into an even round. Grease the base and sides of a jam jar or pint glass (about 7.5cm in diameter) and cover with cling film. Shape the dough around the base, pressing it evenly up the sides, rotating as you go, until it’s about 8cm tall."}, {"step": "Chill for 3-5 minutes; the pastry needs to firm up a little but not dry out. Carefully remove the jar or glass and cling film, easing the pastry off the sides first (don’t worry if it flops a little). Compact one of the balls of pork and put in the case; turn in your hands so the pastry sets around the sides – pinch it up a little, if needed, so it’s higher than the filling."}, {"step": "Roll the pastry reserved for the lid to a rough circle, slightly larger than the top of the pie. Lay over the top of the base and pinch firmly to seal to the sides; crimp with your fingertips, if liked. Cup the pie with both hands and press the sides gently upwards to help retain the shape. Transfer to a parchment-lined baking sheet and cut a 1cm hole in the top of the pie. Repeat with the remaining dough and pork to make 6 pies."}, {"step": "Glaze the pies all over with the beaten egg; bake for 25 minutes, until starting to turn golden. Remove, brush with more egg and bake, with the tray rotated, for a final 15 minutes, or until deep golden. Transfer to a wire rack to cool completely; chill."}, {"step": "For the jelly, cook the lardons in a small pan set over a medium-high heat until crisp (about 4-6 minutes). Add the stock and bay, and boil rapidly until reduced to about 300ml; strain into a jug (top up with water, if needed). Meanwhile, soak the gelatine in cold water for 5 minutes, until softened. Squeeze out the excess water, then stir into the hot stock. Cool completely, then chill for 10 minutes (reheat and chill again, if it sets)."}, {"step": "Place the pies on a wire rack over a baking tray. Carefully pour the chilled stock into the pie holes, letting it settle each time before adding more. Fill each pie as much as you can and don’t worry if they leak a little. Chill for at least another hour, until the jelly has set. Serve at room temperature with English mustard or piccalilli, if liked. The pies will keep in the fridge for up to 3 days (or can be frozen for up to 3 months)."}], "nutrition": {"Energy": "2,962Kj 709Kcal", "Fat": "41.7g", "Saturated Fat": "16.2g", "Carbohydrate": "51.9g", "Sugars": "1.2g", "Protein": "31.6g", "Salt": "3.7g", "Fibre": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Pork pie online.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}