{"title": "Hasselback spiced squash with coconut flatbreads & toasted seeds", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25M", "cook_time": "PT1M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 small butternut squash"}, {"item": "2 tbsp coconut oil"}, {"item": "1¼ tbsp Cooks’ Ingredients Smokey Steak Rub"}, {"item": "10g pack fresh bay leaves"}, {"item": "350g self-raising flour, plus extra for dusting"}, {"item": "1 tsp sea salt flakes"}, {"item": "350g Greek yogurt"}, {"item": "½ x 28g pack coriander, leaves and stems separated and finely chopped"}, {"item": "2 tsp Cooks’ Homebaking Coconut Natural Flavour"}, {"item": "50g mixed seeds"}], "instructions": [{"step": "Preheat the oven to 200ºC, gas mark 6. Halve the squash lengthways, then peel and remove the seeds using a spoon. Place one half of squash cut-side down on a board. Lay some chopsticks either side as a guide, then cut down using a sharp knife at 2mm intervals, stopping when you reach the chopsticks"}, {"step": "so as not to cut all the way through. Repeat with all the halves."}, {"step": "Place on a baking sheet, rub over the coconut oil and scatter with 1 tbsp of the rub. Push the bay leaves in and around the squash. Roast for 1 hour until caramelised and soft."}, {"step": "Meanwhile, make the flatbreads. Place the flour and salt in a large bowl, stir in the yogurt, coriander stems and the coconut flavouring. Bring together with a fork then knead gently with your hands on a lightly floured surface until the dough comes together."}, {"step": "Divide into 8 balls and roll each one out to 2mm thick using a rolling pin. Warm a non-stick frying pan over a high heat and cook each flatbread without oil for 1 minute on each side, followed by a further 30 seconds on each side, until puffed and golden. Set aside in a clean tea towel to keep warm while you cook the rest."}, {"step": "Toss the seeds in the remaining rub, scatter over a baking sheet and toast in the oven for 5-7 minutes until golden. Serve the butternut drizzled with any cooking juices, sprinkled with the coriander leaves and toasted seeds and with the flat breads alongside. Delicious with a green salad with bitter leaves."}], "nutrition": {"Energy": "2,846kJ 677kcals", "Fat": "19.9g", "Saturated Fat": "10.4g", "Carbohydrate": "94g", "Sugars": "17.6g", "Protein": "23.9g", "Salt": "2.8g", "Fibre": "10.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/WRWK11012018_Hassleback-Spiced-Squash-Coconut-Flatbreads.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}