{"title": "Hazelnut and raspberry croissants", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT35M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "80g blanched hazelnuts"}, {"item": "40g unsalted butter, softened"}, {"item": "40g caster sugar"}, {"item": "1 egg"}, {"item": "1 small orange, zest"}, {"item": "4 Waitrose & Partners LoveLife Butter Croissants"}, {"item": "150g pack Waitrose & Partners Raspberries"}, {"item": "½ tbsp lemon juice"}, {"item": "½ tbsp icing sugar, plus extra to dust"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Roast the hazelnuts on a baking tray for 12-15 minutes, until golden brown, then set aside to cool. Roughly chop 10g of the toasted nuts. Pulse the remainder in the small bowl of a food processor until finely ground, then tip into a bowl. Put the butter, caster sugar, egg and orange zest in the processor and whizz until combined, then pulse in the finely ground nuts."}, {"step": "Halve the croissants lengthways, then spread 2 tsp hazelnut frangipane onto each of the top halves and scatter with the chopped nuts. Divide the rest between the bottom halves, then add 4 raspberries to each. Press the tops back onto the bases. Line a baking tray with parchment, add the croissants and bake for 15-18 minutes until golden brown. Leave to cool for 5 minutes."}, {"step": "Meanwhile, heat the remaining raspberries in a small pan with the lemon juice and icing sugar, until their juices are released. Press through a fine sieve set over a bowl, then discard the seeds. Dust the croissants with icing sugar and serve with the raspberry coulis for drizzling."}], "nutrition": {"Energy": "1,908kJ 458kcals", "Fat": "29g", "Saturated Fat": "11g", "Carbohydrate": "35g", "Sugars": "16g", "Protein": "9.6g", "Salt": "0.41g", "Fibre": "6.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Hazelnut-and-raspberry-croissants.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}