{"title": "Hazelnut crêpes with caramelised bananas", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT15M", "total_time": "PT35 minutesM", "serves": "8"}, "ingredients": [{"item": "300g pack Doves Farm Freee Free From Pancake Mix"}, {"item": "750ml Alpro Hazelnut"}, {"item": "2 tbsp sunflower oil, plus extra for frying"}, {"item": "200g vegan dark chocolate, cut into small pieces"}, {"item": "2 tbsp golden syrup"}, {"item": "8 Waitrose Duchy Organic Bananas, cut in half widthways and lengthways"}, {"item": "3-4 tbsp Billington’s Golden Caster Sugar"}, {"item": "75g blanched hazelnuts, toasted and roughly chopped"}], "instructions": [{"step": "Empty the pancake mix into a large jug, add 650ml of the hazelnut drink and the oil, and whisk to combine. Lightly oil a 22cm nonstick frying pan and warm over a high heat. Add just enough batter to coat the base of the pan and cook for 1-2 minutes on each side until golden. Repeat to make 8 crêpes, adding more oil to the pan as needed."}, {"step": "Keep warm."}, {"step": "Meanwhile, to make the chocolate sauce, place the chocolate, syrup and remaining hazelnut drink into a heatproof bowl, place the bowl over a pan of barely simmering water (making sure the bowl doesn’t touch the water) and warm very gently until the chocolate has melted. Stir to combine and keep warm until serving."}, {"step": "Wipe out the frying pan. Sprinkle the cut side of the bananas with the sugar. Warm the pan over a medium heat. Add the bananas in two batches, cut-side down and cook for 1-2 minutes until golden, then turn over and cook for another minute. Keep warm."}, {"step": "Fill the crêpes with the bananas and fold in half. Divide between 8 plates and drizzle with the chocolate sauce and sprinkle with the hazelnuts. Serve with the remaining warm sauce for spooning over."}], "nutrition": {"Energy": "2,081kJ 497kcals", "Fat": "24g", "Saturated Fat": "8.1g", "Carbohydrate": "62g", "Sugars": "41g", "Protein": "6.8g", "Salt": "0.4g", "Fibre": "3.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Hazelnutcrepeswithcaramelisedbananas.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}