{"title": "Hazelnut & chocolate profiteroles", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus cooling and chillingM", "cook_time": "PT35 minutesM", "total_time": "PT55 minutes, plus cooling and chillingM", "serves": "About 40"}, "ingredients": [{"item": "85g unsalted butter"}, {"item": "100g caster sugar, plus 1 tbsp"}, {"item": "120g plain flour, sieved"}, {"item": "3 essential Waitrose Free Range Eggs, beaten"}, {"item": "100g chopped hazelnuts"}, {"item": "125g mascarpone"}, {"item": "150ml double cream"}, {"item": "Finely grated zest 1 orange"}, {"item": "50g cocoa powder"}, {"item": "150g golden syrup"}, {"item": "100g plain chocolate, finely chopped"}, {"item": "25g unsalted butter"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6 and line 2 baking sheets with baking parchment. Heat the butter in a medium pan with 200ml cold water, 1 tbsp sugar and a pinch of salt, until the butter has melted. Bring to a simmer, then remove from the heat and tip in the flour. Beat quickly with a wooden spoon until the flour is incorporated then return to the heat. Cook, stirring constantly, for 3-4 minutes until it forms a smooth ball and pulls away cleanly from the sides of the pan. Transfer to a bowl and leave to cool slightly."}, {"step": "Tip the dough into an electric mixer and beat in the eggs until smooth and shiny. Transfer to a piping bag fitted with a 1cm plain nozzle. Pipe 40 small balls of the mixture onto the lined trays and smooth the top of each with a wet finger. Bake for 15 minutes then turn the oven down to 160°C, gas mark 3 and cook for a further 20 minutes until golden brown and crisp. Transfer to a wire rack to cool."}, {"step": "Meanwhile, make the filling. Heat the 100g sugar in a large, heavy-based frying pan until completely melted and golden in colour. Tip in the hazelnuts, stir until evenly coated then pour onto a baking sheet lined with baking parchment and leave to cool. Once the caramel has cooled, break into pieces with a rolling pin and set aside 2 tbsp of the mixture for later. Put the remaining caramel into a food processor and blitz to a ground praline — this should take around 3-4 minutes. Beat the ground praline and mascarpone together until smooth, then whip the cream before folding into the mascarpone mix with the orange zest. Chill."}, {"step": "For the chocolate sauce, whisk the cocoa powder, golden syrup and a pinch of salt together with 250ml cold water in a small pan until smooth then bring to the boil. Reduce the heat to a simmer and cook for 3 minutes, whisking constantly, until smooth and glossy. Remove from the heat and whisk in the chocolate and butter until smooth."}, {"step": "Transfer the filling to a piping bag fitted with a small round nozzle and, making a small opening in each profiterole, fill with the cream mixture. Top with the warm chocolate sauce, sprinkle with the reserved praline and serve."}], "nutrition": {"Energy": "2690.312kJ 643kcals", "Fat": "45.1g", "Saturated Fat": "23.8g", "Carbohydrate": "50g", "Sugars": "36g", "Salt": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Hazelnut-and-chocolate-profiteroles-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}