{"title": "Herb & spice roast leg of lamb", "tags": null, "planning": {"prep_time": "PT15 minutes, plus marinating and restingM", "cook_time": "PT3½ hoursM", "total_time": "PT3 hours 45 minutes, plus marinating and restingM", "serves": "6, with leftovers"}, "ingredients": [{"item": "6 cloves garlic, roughly chopped"}, {"item": "1 tbsp cumin seeds, lightly crushed"}, {"item": "1 tbsp fennel seeds, lightly crushed"}, {"item": "50g fresh flat-leaf parsley, thick stalks removed"}, {"item": "10g fresh lemon thyme, thick stalks removed"}, {"item": "10g fresh mint"}, {"item": "100ml olive oil"}, {"item": "3 tbsp white wine vinegar"}, {"item": "4 tbsp light brown muscovado sugar"}, {"item": "2kg whole leg of lamb, part-boned"}, {"item": "450ml lamb or chicken stock"}], "instructions": [{"step": "Put the garlic, cumin and fennel seeds, parsley, thyme, mint, olive oil, vinegar and sugar in a food processor and blitz until the herbs are finely chopped. Make plenty of deep cuts into the lamb with a sharp knife and place in a non-metallic dish. Spread some of the marinade into the cavity of the lamb and spread the remainder all over the surface of the meat. Cover loosely and chill for at least 6 hours, preferably 24 hours. Remove from the fridge 30 minutes before cooking."}, {"step": "Preheat the oven to 220°C, gas mark 7. Transfer the lamb, with any of the herb marinade poured over, to a roasting tin and pour in the stock. Cover loosely with foil and roast for 30 minutes. Reduce the oven temperature to 180°C, gas mark 4, uncover the lamb (reserving the foil) and cook for a further 3 hours until the meat is very tender (see tip, below). Re-cover the lamb with the foil if it starts to over-brown during cooking."}, {"step": "Let the meat rest in a warm place, loosely covered, for 30 minutes. Transfer to a serving platter. Skim off any excess fat from the pan juices, reheat and pour into a jug. Serve with the lamb, thickly sliced."}], "nutrition": {"Energy": "2125.472kJ 508kcals", "Fat": "31.7g", "Saturated Fat": "8.3g", "Carbohydrate": "11.9g", "Sugars": "10.8g", "Salt": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/herb-leg-of-lamb_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}