{"title": "Heston's rich chilli con carne with spiced butter", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "For the chilli"}, {"item": "6 tbsp olive oil"}, {"item": "450g Aberdeen Angus minced beef (10% fat)"}, {"item": "1 large onion, diced"}, {"item": "2 whole star anise"}, {"item": "3 cloves garlic, peeled and crushed"}, {"item": "1 green chilli, deseeded and diced"}, {"item": "2 tbsp tomato purée"}, {"item": "Half a bottle red wine (375ml)"}, {"item": "400g can chopped tomatoes"}, {"item": "500ml beef stock"}, {"item": "400g can red kidney beans, drained and rinsed"}, {"item": "230g jar Fragata Pimiento Piquillo peppers, drained and roughly chopped"}, {"item": "For the spiced butter"}, {"item": "2 tbsp olive oil"}, {"item": "1½ tsp ground cumin"}, {"item": "1 tsp chilli powder"}, {"item": "1½ tsp smoked paprika"}, {"item": "1 tsp tomato ketchup"}, {"item": "½ tsp Worcestershire sauce"}, {"item": "½ tsp Marmite"}, {"item": "125g butter, softened to room temperature"}, {"item": "To serve"}, {"item": "100g soured cream"}, {"item": "60g Cheddar cheese, grated"}, {"item": "Grated zest and juice of 3 limes"}], "instructions": [{"step": "Start by making the spiced butter. Heat the olive oil in a frying pan and lightly fry the cumin and chilli powder for approximately 1½ minutes. Pour into a bowl and add the rest of the spiced butter ingredients; mix together and once cool, place in the fridge until needed. Add 3 tbsp olive oil to a large sauce pan and heat over a high heat until smoking hot. Add the mince, in batches if necessary, and cook until evenly browned. Remove and drain the meat. Add a little water to the same pan to deglaze it and tip the water and bits in with the drained meat so none of the flavour is lost. Turn the heat down to medium and add the remaining olive oil. Add the onions and star anise and cook until the onions begin to colour, then add the garlic and green chilli and cook for another 5 minutes. Add the tomato purée, stir and cook for another 5 minutesuntil everything turns a brick red colour. Add the browned mince and juices, pour in the red wine and allow to reduce by two-thirds. Add the tomatoes and stock and simmer over a low heat for at least 1 hour or until it has reduced to a thick sauce consistency. Fold the beans and chopped red peppers into the chilli and simmer until they are heated through. Stir in 2½ tbsp of the spiced butter for mild-medium heat (or more if you like it hotter). Remove the star anise. Season with salt and freshly cracked black pepper and serve with rice."}, {"step": "Heston recommends Put the remaining spiced butter, the lime zest and juice into three separate bowls on the table alongside the cheese and soured cream, so everyone can add their own seasonings to their portion of chilli. Copyright © Heston Blumenthal 2010"}], "nutrition": {"Energy": "3129.632kJ 748.0kcal", "Fat": "44.7g", "Saturated Fat": "14.3g", "Sugars": "25.1g", "Salt": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/201011Hestonr32.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}