{"title": "Heston's pork shoulder sliders", "tags": null, "planning": {"prep_time": "PT15 minutes plus chillingM", "cook_time": "PT25M", "total_time": "PT35 minutes plus chillingM", "serves": "12"}, "ingredients": [{"item": "For the sweetcorn salsa"}, {"item": "1 sweetcorn on the cob"}, {"item": "½ green chilli, chopped"}, {"item": "2g fresh coriander leaves, finely sliced"}, {"item": "2g fresh mint leaves, finely sliced"}, {"item": "1 tomato, deseeded and diced"}, {"item": "2 tsp olive oil"}, {"item": "Zest and juice of ½ lemon"}, {"item": "30g sweetcorn purée (home-made) or tinned creamed style corn"}, {"item": "For the pickled cucumber"}, {"item": "1 cucumber, peeled"}, {"item": "50g caster sugar"}, {"item": "100ml white wine vinegar"}, {"item": "10g fresh dill"}, {"item": "450g Heston from Waitrose Spruce-Smoked Pork Shoulder with Mesquite Rub"}, {"item": "12 Waitrose Assorted Mini Rolls"}], "instructions": [{"step": "For the sweetcorn salsa, place the corn on the cob on the barbecue and rotate until cooked and most sides charred (approximately 5 minutes). Using a sharp knife, remove the kernels. Place the kernels in a bowl and add the chilli, coriander, mint, tomato, olive oil, lemon zest, lemon juice, sweetcorn purée (or creamed style corn), mix well and season with salt and freshly ground black pepper. Reserve in a sealed container in the fridge."}, {"step": "To make the pickled cucumbers, slice the cucumber lengthways down the middle then slice very thinly on a mandolin or in a food processor. Bring the sugar, vinegar and 150ml cold tap water to the boil in a small saucepan over a medium heat. Allow to cool. Mix the sliced cucumber and pickling liquid in a container, add the dill, cover and allow to marinate in the fridge for at least 30 minutes. Drain the cucumber."}, {"step": "Cook the pork shoulder according to pack instructions. In the meantime, slice the rolls in half and place them on the barbecue to lightly toast. Once the pork is ready, using 2 forks, pull the meat apart, mix with the barbecue sauce (from the pork shoulder) and separate into 12 portions. Place each portion in the roll. Serve with the salsa and the pickled cucumber."}], "nutrition": {"Energy": "903.744kJ 216kcals", "Fat": "8.4g", "Saturated Fat": "2.8g", "Carbohydrate": "21.4g", "Sugars": "3.8g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/2013wked-August-r4Hestonsliders.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}