{"title": "Heston's goat's cheese tart", "tags": null, "planning": {"prep_time": "PT85M", "cook_time": "PT20M", "total_time": "PT1 hour 45 minutesM", "serves": null}, "ingredients": [{"item": "For the onion compote"}, {"item": "25g unsalted butter"}, {"item": "200g onion, peeled and finely sliced"}, {"item": "1 clove garlic, peeled and finely chopped"}, {"item": "2 sprigs of thyme, leaves picked"}, {"item": "1 star anise"}, {"item": "3 slices Heston from Waitrose Alderwood Smoked Streaky Bacon, cut into lardons"}, {"item": "10g dry Madeira"}, {"item": "40g white wine"}, {"item": "10g white wine vinegar"}, {"item": "Ground nut oil"}, {"item": "Salt and black pepper"}, {"item": "For the pastry tart"}, {"item": "½ x 430g pack (215g) frozen Cook’s Ingredients Puff Pastry Sheets, defrosted"}, {"item": "1 Waitrose British Blacktail Egg, beaten with a pinch of salt for a wash"}, {"item": "To serve"}, {"item": "40g goat’s cheese"}, {"item": "Marmite (optional)"}, {"item": "40g white wine vinegar"}, {"item": "40g Dijon or wholegrain mustard"}, {"item": "120g groundnut oil"}, {"item": "30g mixed salad leaves"}, {"item": "10 Peppadew piquante peppers, mild, cut into quarters"}], "instructions": [{"step": "For the onion compote, melt the butter in a large saucepan over a low medium heat, add the onion, garlic, thyme leaves and star anise. Cook for 1 hour, stirring occasionally until well caramelised and dark in colour. If the onions start to catch on the bottom of the pan, add a little water and stir more frequently."}, {"step": "Meanwhile, coat the bottom of a frying pan with a thin layer of oil and place over a medium heat. Add the bacon lardons and cook for 4-5 minutes until the bacon is soft and beginning to colour. Drain the bacon on kitchen paper and set aside. Deglaze the pan (with the onion compote) with the Madeira, white wine and white wine vinegar, and cook for a further 5 minutes. Add the bacon and season with salt and freshly ground black pepper. Remove the star anise and allow to cool."}, {"step": "Preheat the oven to 190°C, gas mark 5. Unroll the pastry and cut out 4 circles using a 9.5cm cutter and place 2 on a baking tray, brush with egg approximately 2cm from the edge. Using a smaller 8.5cm cutter, cut a disc out from the centre of the remaining 2 discs, and discard the centres. Place the pastry rings on top of the circles on the tray and bake for 12 minutes or until fully cooked and golden brown. Remove from the oven and place on a cooling rack until completely cool."}, {"step": "Spoon 40g of the onion compote inside each of the cooked pastry tarts, then crumble 20g of goats cheese into each with an optional few drops of Marmite, if using. Return the tart to the preheated oven for 8-10 minutes."}, {"step": "Meanwhile, prepare the vinaigrette by mixing the vinegar and mustard in a bowl, add the oil and whisking continuously. Mix some of the vinaigrette with the mixed salad leaves, add the peppers and season. Divide the mixed salad in half and place on a plate next to the warm onion and goat’s cheese tarts."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/2014wked-Jan-r2hestontart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}