{"title": "Heston's olive oil and raspberry cakes", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "12"}, "ingredients": [{"item": "For the syrup"}, {"item": "100g caster sugar"}, {"item": "Peel of 3 lemons, blanched twice, pith removed and finely sliced"}, {"item": "For the cakes"}, {"item": "360g plain flour"}, {"item": "1½ tsp baking powder"}, {"item": "3g sea salt"}, {"item": "Zest of 2 lemons, plus 1 tbsp juice"}, {"item": "225g granulated sugar"}, {"item": "4 large Waitrose British Blacktail Free Range Eggs"}, {"item": "3 tbsp whole milk"}, {"item": "110g unsalted butter melted and at room temperature"}, {"item": "160g extra virgin olive oil"}, {"item": "250g fresh raspberries"}, {"item": "For the meringue"}, {"item": "150g caster sugar"}, {"item": "15g glucose syrup"}, {"item": "2 large Waitrose British Blacktail Free Range Egg whites"}, {"item": "Freeze dried raspberries"}], "instructions": [{"step": "To make the lemon syrup, place the sugar and 80g water into a pan and heat to 103˚C (using a sugar thermometer), add the blanched lemon and simmer until al dente. Strain and discard the peel."}, {"step": "Preheat oven to 180˚C, gas mark 4. Sift together the flour with the baking powder and salt into a bowl, and set aside. In the bowl of an electric mixer combine the lemon zest and the sugar, (so the sugar absorbs as much of the zest as possible). Then add the 4 whole eggs to the sugar and whisk on medium speed for about 3-4minutes."}, {"step": "With the mixer on its lowest speed, beat in the milk then the flour mix, lemon juice, melted butter and olive oil. Beat until blended."}, {"step": "Pipe half the batter into 12 loaf cases or rectangular moulds (approximately 8 x 3cm). Place the raspberries in the centre of the batter, 3 per mould. Cover with the rest of the batter. Bake in the preheated oven for 25 minutes, then cool."}, {"step": "Meanwhile, to make the meringue, place 30ml water, the caster sugar and glucose syrup in a pan and bring to the boil, skimming away any froth and brushing the pan with a wet brush to avoid sugar crystals."}, {"step": "Whisk the egg whites to a soft peak. When the sugar syrup reaches 115˚C, remove from heat and slowly add to the egg whites until fully incorporated. Continue to whisk until the bowl is cold to touch."}, {"step": "When the cakes are ready, take out and spread with a little lemon syrup. Allow to cool completely and using a piping bag, pipe the meringue in mounds on top. Sprinkle with the freeze dried raspberries."}], "nutrition": {"Energy": "2,103kj/502kcals", "Fat": "22.7g", "Saturated Fat": "7.5g", "Carbohydrate": "67.8g", "Sugars": "44.2g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Heston's-olive-oil-and-raspberry-cakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}