{"title": "Heston’s eggs Benedict", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "2"}, "ingredients": [{"item": "150g organic white wine vinegar"}, {"item": "1 Waitrose Duchy Organic Shallot, peeled and finely sliced"}, {"item": "6 white peppercorns, bashed"}, {"item": "200g Waitrose Duchy Organic English Salted Butter, cubed"}, {"item": "2 large Waitrose Duchy Organic British Free Range Egg yolks"}, {"item": "¼ tsp juice of Waitrose Duchy Organic Lemon"}, {"item": "Freshly ground white pepper"}, {"item": "1 tsp salt"}, {"item": "4 large Waitrose Duchy Organic British Free Range Eggs"}, {"item": "2 Waitrose Duchy Organic Wholemeal Muffins"}, {"item": "Butter, for spreading"}, {"item": "1 tbsp chopped parsley"}], "instructions": [{"step": "First make a reduction as a base for the hollandaise. Place the vinegar, shallot and peppercorns in a pan over a medium-low heat, and reduce by two-thirds, until approximately 50g of liquid remains. Allow to cool completely. Strain through a sieve and discard the shallot and peppercorns."}, {"step": "To make a beurre noisette, put the butter in a small pan over a medium heat. Allow to simmer until brown in colour and nutty in aroma. Strain through a sieve lined with a coffee filter, then reserve."}, {"step": "Place the egg yolks in a bowl and add 10g of the cold vinegar reduction and 30g water. Put the bowl over a pan of simmering water. Whisk the yolks until they begin to thicken, ensuring they don’t reach a temperature higher than 65°C. Slowly add the warm beurre noisette, whisking continuously. When fully incorporated, add the lemon juice and season with salt (if needed) and freshly ground white pepper."}, {"step": "To poach the eggs, fill a large saucepan with 15-20cm deep water then add the salt. Place a plate upside-down in the bottom of the pan, then put the pan over a medium heat and bring the water up to 80°C. Check the temperature using a thermometer. One at a time, crack each egg into a ramekin dish and pour it into a slotted spoon with small holes. Let any watery white drain for 1 minute."}, {"step": "Lower the slotted spoon into the warm water and slide the spoon out. Allow to poach for 4 minutes. Toast and butter the muffins. Remove the eggs with the slotted spoon and pat with kitchen paper to remove any excess water. Season with salt. Serve on the toasted muffins with the hollandaise spooned over and sprinkle with parsley."}], "nutrition": {"Energy": "4,708kJ 1,138kcals", "Fat": "103.2g", "Saturated Fat": "58.1g", "Carbohydrate": "27.4g", "Sugars": "8.2g", "Protein": "24.9g", "Salt": "3.8g", "Fibre": "7.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/WRWK270717-Heston-eggs-benedict.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}