{"title": "Heston's Slow-cooked pork belly", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "3"}, "ingredients": [{"item": "500g pork belly"}, {"item": "Salt, for sprinkling"}, {"item": "3 carrots, peeled and halved lengthways"}, {"item": "1 parsnip, peeled and halved lengthways"}, {"item": "1 onion, peeled and halved"}, {"item": "½ turnip, peeled"}, {"item": "½ garlic bulb"}, {"item": "1 litre chicken stock"}, {"item": "½ bunch sage"}, {"item": "1 tablespoon vegetable oil or rapeseed oil"}, {"item": "Curly Kale and apple sauce, for serving"}], "instructions": [{"step": "Preheat the oven to 95°C or gas mark ¼. Using a very sharp knife, carefully remove the top skin of the pork belly, trying to keep it intact. Place the skin on a cooling rack and sprinkle with salt. Place the pork belly in a large casserole dish with a lid, then add the carrots, parsnip, onion, turnip and garlic, and pour over the chicken stock. Place over a medium heat until the liquid begins to simmer, cover, then place in the oven. Put the cooling rack on top of a baking tray and place in the oven. Cook for 9 hours at 95°C or 8 hours at gas mark ¼. With 30 minutes of the cooking time left, add the sage to the casserole and return to the oven for the final 30 minutes. Remove the casserole and the skin from the oven and increase the temperature to 200°C, gas mark 6. Take the pork belly out of the braising liquid and strain the vegetables, reserving the liquid. Mash the vegetables with a potato masher and keep warm. Pour the braising liquid into a saucepan and place over a high heat to reduce by half. Season with salt and pepper and keep warm. In the meantime, put the cooling rack with the crackling back in the oven for 5 minutes or until the skin has puffed up. When ready to eat, heat the oil in a frying pan until smoking hot then place the pork belly, skinned side down, and allow to colour for 30 seconds. Serve with the mashed vegetables and a piece of the crispy skin. Copyright © Heston Blumenthal 2010"}], "nutrition": {"Energy": "2527.136kJ 604.0kcal", "Fat": "36.5g", "Saturated Fat": "10.5g", "Sugars": "12.6g", "Salt": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/201010Hestonr28.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}