{"title": "Heston's Roast leg of lamb", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8"}, "ingredients": [{"item": "1.8 –2.2kg whole leg of lamb"}, {"item": "Sea salt"}, {"item": "3 tbsp groundnut oil"}, {"item": "12 anchovies in extra virgin olive oil, drained and sliced in half lengthways"}, {"item": "6 garlic cloves, peeled and halved (germ removed)"}, {"item": "20g pack fresh rosemary (7–8 sprigs)"}, {"item": "100ml dry white wine"}, {"item": "500g Heston from Waitrose Chicken Stock"}, {"item": "1 tbsp wholegrain mustard"}], "instructions": [{"step": "Season the lamb with salt. Heat the oil in a heavy frying pan over a high heat. When the oil is smoking hot, sear the lamb until golden brown on all sides. Remove from the pan and place on a board."}, {"step": "Using a sharp knife, cut slits in the surface of the lamb at regular intervals. Use a small spoon to enlarge the holes and stuff them with the anchovies, garlic and half the rosemary."}, {"step": "Place the remaining sprigs of rosemary in the bottom of a roasting tin and place the lamb on top. Pour 150ml water into the bottom of the pan and cook as recommended on the packaging (25 minutes per 500g plus 25 minutes for medium), or to your liking. When cooked, remove the lamb from the oven, wrap it in foil and allow to rest for at least 30 minutes."}, {"step": "While the meat is resting, make the sauce. Place the roasting tin over a medium-high heat, allow the lamb juices to come to a boil then reduce by half. Add the wine and use a spatula to scrape all the delicious bits from the bottom of the pan. Allow the liquid to reduce by half. Add the chicken stock and, again, reduce by half."}, {"step": "Pour off the excess fat then strain the liquid through a fine sieve into a bowl. Stir in the wholegrain mustard then pour into a warm jug to serve with the lamb."}], "nutrition": {"Energy": "1761.464kJ 421kcals", "Fat": "24.5g", "Saturated Fat": "8.1g", "Carbohydrate": "1.2g", "Sugars": "0.4g", "Salt": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/2013wkwe-March-r5e.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}