{"title": "Heston's Easter pomme purée", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 tsp salt"}, {"item": "1kg red potatoes, such as Desiree or Mozart, peeled"}, {"item": "300g unsalted butter, diced"}, {"item": "240g whole milk, warm"}, {"item": "Salt and white pepper"}, {"item": "1 cucumber, peeled"}, {"item": "40ml white wine vinegar"}, {"item": "4 mint leaves"}], "instructions": [{"step": "Fill a large saucepan with water and sprinkle in 1 tsp of salt and place over a medium heat. Allow the temperature to reach 72ºC. In the meantime, cut the potatoes into evenly sized pieces. Add the potatoes to the warm water and allow the temperature to reach 72ºC once again. Hold the temperature for 30 minutes."}, {"step": "After 30 minutes, drain the potatoes and rinse them under cold running water."}, {"step": "Bring another saucepan with water and the rest of the salt to a boil. Add the potatoes and cook for 15-18 minutes or until extremely soft and falling apart. Drain the potatoes and return them to the pan on low heat to dry out any excess moisture."}, {"step": "Put the potatoes through a ricer into a bowl with the butter. Mix together. Put this mixture through a fine sieve. Add the warm milk and season with salt and freshly ground white pepper."}, {"step": "To finish, cut the cucumber into quarters. Remove the seeds and place the cucumber quarters on kitchen paper, allowing any excess moisture to drain off."}, {"step": "In the meantime, place a non-stick pan over medium-high heat. Fry the cucumber on 2 sides until charred. Remove from the pan and cut into small cubes."}, {"step": "Place the cucumber cubes in a bowl, add the vinegar and allow to stand for 2 minutes. In the meantime, roll the mint leaves together and finely slice them. Remove the cucumber from the vinegar onto kitchen paper. Place in a small bowl and add the sliced mint. Fold the minty cucumber cubes through the warm pomme purée just before serving."}], "nutrition": {"Energy": "3,333kJ 803kcals", "Fat": "64.9g", "Saturated Fat": "42g", "Carbohydrate": "46.7g", "Sugars": "5.2g", "Protein": "8.1g", "Salt": "1.4g", "Fibre": "3.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/pomme_Waitrose-Weekend-252_Hestons-Easter_Pomme-Puree128011.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}