{"title": "Heston's cinnamon roll monkey bread", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes + provingM", "cook_time": "PT45M", "total_time": "PT1h 30minutes + provingM", "serves": "3"}, "ingredients": [{"item": "For the dough"}, {"item": "120g warm, whole milk"}, {"item": "25g white caster sugar"}, {"item": "1 tsp dry yeast"}, {"item": "30g unsalted butter"}, {"item": "½ Waitrose British Blacktail Free Range Egg yolk"}, {"item": "½ tsp vanilla extract"}, {"item": "210g plain flour"}, {"item": "Pinch of salt"}, {"item": "For the caramel"}, {"item": "200g sugar"}, {"item": "75g The English Provender Co"}, {"item": "Bramley Apple Sauce with Calvados, plus extra to serve"}, {"item": "For the cinnamon butter"}, {"item": "80g softened butter"}, {"item": "100g granulated sugar"}, {"item": "6g (1 tbsp) ground cinnamon"}, {"item": "To finish"}, {"item": "15g Chopped pecans"}, {"item": "50g melted butter"}], "instructions": [{"step": "To make the dough, place the warm milk in a bowl with the sugar and yeast. Allow to stand for 5 minutes, before adding the butter, egg yolk and vanilla and stir to combine. Place the flour and pinch of salt in a large bowl, pour in the milk mixture and using a spatula mix together until well combined."}, {"step": "Using a mixer fitted with a dough hook, knead the dough for 7–8 minutes or until soft and sticky to the touch. Place the dough in a lightly oiled bowl and cover with clingfilm and allow to stand at room temperature for 1 hour. Using the palm of your hand press down on the surface of the dough to release the gases formed during fermentation and shape into a ball. Place the dough again into the bowl, cover and place in the fridge to prove for 4 hours."}, {"step": "In the meantime, to make the caramel, place the sugar in a pan. Cook on high heat until a caramel is formed, regularly brushing the sides of the pan with water. This will ensure that the sugar at the edge doesn't burn. Remove the pan from the heat and stir in the apple sauce."}, {"step": "To make the cinnamon butter, place the butter, sugar and cinnamon into a bowl and stir with a spatula until combined. Reserve."}, {"step": "Brush the inside of two 9cm ramekins with a little melted butter. Add 2 tbsp of the caramel to the bottom, reserving a little to pour over at the end. Sprinkle over some of the chopped pecans and allow to cool completely."}, {"step": "Preheat the oven to 180ºC, gas mark 4. To finish, divide the dough into 2 halves, lightly flour a surface and using a rolling pin, roll the dough into a rectangle with a thickness of approximately 0.5cm. Spread the cinnamon butter mix on the surface of the dough and begin to roll inwards from the longest side of the dough. Once completely rolled, placed in the fridge for 10 minutes. Cut the dough into 3cm pieces and stand them inside of the ramekin on top of the caramel, approximately 4–5 pieces per ramekin. Leave in a warm place and prove for a further 20minutes. Then bake in the preheated oven for 30 minutes. Once baked, remove from the oven and turnover onto a plate. Serve topped with an extra spoonful of the apple sauce."}], "nutrition": {"Energy": "3,756kj/895kcals", "Fat": "37g", "Saturated Fat": "21g", "Carbohydrate": "130.5g", "Sugars": "76.8g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Hestons_cinnaroll_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}