{"title": "Heston's scotch eggs", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": null}, "ingredients": [{"item": "10 medium eggs"}, {"item": "450g Waitrose Premium Pork Sausagemeat Stuffing or 6 Waitrose Gourmet Pork Sausages, skins removed"}, {"item": "1 heaped tsp thyme leaves (approximately ¼ packet)"}, {"item": "45g French’s mustard"}, {"item": "½ level tsp cayenne pepper"}, {"item": "Seasoning"}, {"item": "1 packet of chives, chopped"}, {"item": "Plain flour"}, {"item": "50ml milk"}, {"item": "125g Cooks’ Ingredients Breadcrumbs"}, {"item": "Ground nut oil, for frying"}], "instructions": [{"step": "Preheat the oven to 190c, gas mark 5. Place 8 eggs in a large pan with enough cold water to cover them by 2cm and place over a high heat. As soon as the water starts to simmer, set a timer for 1 minute 45 seconds exactly. While the eggs are cooking, fill a bowl with cold water and ice and after the exact time has elapsed, take the eggs out of the saucepan and plunge them into the water to cool. Place the sausagemeat in a bowl and add the thyme, mustard,cayenne pepper, seasoning, chopped chives and 2 tablespoons of water. Mix thoroughly and form 8 patties with your hands (dip your hands in cold water if the mix sticks). Chill in the fridge for 20 minutes. Once the eggs are cool enough to handle, gently remove the shells. Flatten each pattie into a circle and place an egg in the centre. Wrap the sausagemeat around the egg, pressing the edges in order to seal it but being careful not to press too hard. Put the flour into a small bowl and season. In a second smallbowl, beat the remaining 2 eggs and stir in the milk. Put thebreadcrumbs into a third bowl. Roll each egg in the flour, gently tapping off any excess, then dip it in the beaten egg and finally, roll it in the breadcrumbs, making sure that all sides are coated Heat a deep fat fryer to 190c or fill a saucepan with oil deep enoughto cover the eggs and heat to 190c. Fry the Scotch eggs 2 at a time for 2 minutes until golden brown. Remove from the oil with a slotted spoon and place on a drying rack over a baking tray. When all the eggs have been fried, place the tray in the oven for an additional 10 minutes. Serve immediately while the yolks are still runny. Copyright © Heston Blumenthal 2010"}], "nutrition": {"Energy": "1451.848kJ 347kcal", "Fat": "21.6g", "Saturated Fat": "6.6g", "Sugars": "2g", "Salt": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/201007Heston18.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}