{"title": "Heston's rhubarb sponge", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6"}, "ingredients": [{"item": "140g Waitrose Duchy Organic Medium British Free Range Eggs, about 3"}, {"item": "130g caster sugar"}, {"item": "85g plain flour"}, {"item": "½ tsp baking powder"}, {"item": "Pinch of salt"}, {"item": "60g unsalted butter, melted"}, {"item": "50g whipping cream"}, {"item": "6g coriander leaves"}, {"item": "Zest of 1 orange"}, {"item": "Zest of ½ lemon"}, {"item": "200g rhubarb, washed and cut into 3cm chunks"}, {"item": "85g caster sugar"}, {"item": "1 tbsp lemon juice"}, {"item": "50g Waitrose Seriously Fruity Raspberry Coulis"}, {"item": "2g Tate+Lyle Pectin"}, {"item": "90g Heston from Waitrose Fruit Cup, to soak"}, {"item": "170g strawberry jam"}, {"item": "2 tsp toasted coriander seeds, coarsely crushed"}, {"item": "160g whipping cream"}, {"item": "20g icing sugar, sieved"}, {"item": "20g Heston from Waitrose Fruit Cup"}, {"item": "7g Waitrose Cooks’ Homebaking Freeze Dried Strawberries"}, {"item": "7g icing sugar"}, {"item": "Zest of 1 orange"}], "instructions": [{"step": "Preheat the oven to 170ºC, gas mark 3. Grease and line a 15cm round cake tin with baking parchment. Add the eggs and sugar to the bowl of a stand mixer fitted with a whisk attachment and whisk until thick and creamy. Meanwhile, sieve the flour, baking powder and salt together in another bowl."}, {"step": "In a small jug, mix the melted butter and whipping cream, stir in the coriander leaves and blitz using a hand blender. Add the dry ingredients to the egg mixture in 3 stages and fold gently at each stage. Drizzle in the infused, melted butter. Add the citrus zests and fold gently. Pour the mixture into the prepared cake tin and bake in the preheated oven for about 25 minutes, or until golden and a skewer inserted comes out clean."}, {"step": "For the rhubarb layer, place the rhubarb in a pan with 50g of the sugar, lemon juice and coulis, and place over a medium heat for about 8-10 minutes or until the rhubarb is cooked through. Meanwhile, place the remaining sugar and pectin in a bowl and mix well. Add this to the cooked rhubarb and stir well. Allow to cool completely."}, {"step": "To make the fruit cup cream, whip the cream to soft peaks using a mixer fitted with a whisk attachment. Add the icing sugar and the fruit cup and whisk to medium peaks. Place the cream in a piping bag fitted with a 0.8cm tip and reserve in the fridge until ready to assemble."}, {"step": "Finally, make the strawberry powder. Place the dried strawberries in a bowl and using the back of a spoon, or mortar and pestle, crush to a fine powder. Add the icing sugar and orange zest. Set aside."}, {"step": "To assemble, slice the sponge horizontally into three equal layers. Lightly soak the bottom sponge with the fruit cup, using a brush. Mix together the strawberry jam and rhubarb mixture, then using a spatula, spread half the mixture onto the bottom layer of soaked sponge, leaving a 2cm border around the edge. Pipe mounds of fruit cup cream around the edge of this layer, then sprinkle with a little of the coriander seeds. Then place the middle layer of soaked sponge on top and repeat. Finally top with the final layer of soaked sponge and sprinkle over the strawberry powder and serve."}], "nutrition": {"Energy": "2,224kJ 531kcals", "Fat": "25.1g", "Saturated Fat": "14.9g", "Carbohydrate": "70.6g", "Sugars": "59.6g", "Protein": "5.6g", "Salt": "0.5g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Waitrose-Weekend-252_Hestons-Easter_Rhubarb-Victoria-Sponge128053.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}