{"title": "Homemade Croissants", "tags": null, "planning": {"prep_time": "PT1 hour, plus two nights and 2½ hours provingM", "cook_time": "PT20M", "total_time": "PT3 daysM", "serves": "12"}, "ingredients": [{"item": "7g Dried active yeast (or 15g fresh yeast or 3.5g fast-action yeast)"}, {"item": "300ml Milk, lukewarm"}, {"item": "500g Strong white flour"}, {"item": "50g Caster sugar"}, {"item": "2 tsp Salt"}, {"item": "250g Unsalted butter, chilled"}], "instructions": [{"step": "DAY 1: Prepare the dough Blend the yeast with the milk. Sift the flour into a mixing bowl and add the sugar and salt. Make a well in the centre and pour in the yeast mixture. Mix with your fingers, then tip onto a board, bring together and knead lightly until you have a dough slightly softer than pastry dough. Return to the bowl, cover and leave for 30–60 minutes in a warm place till doubled in size. Knock back, by simply pressing all the air out of it, then return to the bowl, cover with clingfilm and rest in the fridge. Next, place the butter in a polythene bag and, using a rolling pin, pat into a 10cm square. Put this in the fridge, too, and chill both dough and butter overnight.  DAY 2: Roll in the butter Take the dough out of the fridge and put on a lightly floured surface. Score an X halfway into the dough, so it is left with four discrete areas. Work each section out from the centre until the dough forms the shape of a cross; tidy up the ends to make them square. The centre of the cross should be about 12cm square. Make sure the butter is the same temperature and texture as the dough; it should be soft, but still cold. If it is too hard and you can feel it under the dough it will crack, in which case leave it to warm a while; if it is too soft, it will ooze out, so chill it for 10 minutes or so. Place the butter in the centre of the cross and fold the 4 ends over the centre to enclose. Gently roll out to a 50cm x 25cm rectangle (5mm thick), being careful the butter does not ooze out. Fold the bottom third up and the top third down as you would a letter. Wrap and chill for 20–30 minutes, then, with the flap to the right, repeat the rolling and folding process  DAY THREE: Shape, prove and bake Take out the pastry and roll into a rectangle measuring 45cm x 35cm (5mm thick), trim the edges, and cut it in half lengthways. Cut into 12 isosceles triangles. Roll up each from its long side. Place onto a couple of baking sheets, flap-side down, and curve into crescents. Cover with clingfilm; prove at room temperature for 1–1 ½ hours until puffy and marshmallow-like in consistency. Preheat the oven to 230°C, gas mark 8. Brush with beaten egg and bake for 10 minutes, then turn the oven down to 190°C, gas mark 5 and cook for a further 15–20 minutes until golden brown. Serve while warm, with fruit preserve, chocolate spread, cream cheese, or whatever else takes your fancy."}], "nutrition": {"Energy": "1439.296kJ 344.0kcal", "Fat": "19.2g", "Saturated Fat": "12.3g", "Sugars": "6.5g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/0611078-r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}