{"title": "Homemade smoky baked beans with egg & chorizo", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT45M", "total_time": "PT55M", "serves": "4"}, "ingredients": [{"item": "2 tsp oil"}, {"item": "1 red onion, chopped"}, {"item": "1 tbsp black treacle"}, {"item": "½ tsp sweet smoked paprika"}, {"item": "1 tsp chipotle paste"}, {"item": "2 x 400g cans cannellini beans, drained and rinsed"}, {"item": "400g can borlotti beans, drained and rinsed"}, {"item": "½ x 400g can chopped tomatoes"}, {"item": "½ tbsp cider vinegar, plus extra to taste"}, {"item": "100g Waitrose Chorizo Ring, cut into thick slices"}, {"item": "2 tsp olive oil"}, {"item": "4 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "1 tbsp chopped parsley, to serve"}], "instructions": [{"step": "Heat the oil in a large saucepan over a low heat. Add the onion and season. Cook, stirring occasionally, for 5 minutes. Stir in all the remaining ingredients for the beans. Add 150ml water and simmer over a low heat, lid on, for 35-40 minutes, until tender and thickened. Season again to taste, adding a splash of extra vinegar if the beans seem too sweet."}, {"step": "When the beans are almost ready, cook the chorizo. Lay the slices in a single layer in a large frying pan. Place over a low heat and cook gently until crisp, then turn over to crisp the other side. Remove the chorizo from the pan with a slotted spoon and set aside. Add the oil to the pan and increase the heat to high. Crack in the eggs and cook until the whites are set and the yolks cooked to your liking."}, {"step": "Serve the beans topped with the egg and the chorizo. Scatter with parsley and serve."}], "nutrition": {"Energy": "1,779kJ 425kcals", "Fat": "20.6g", "Saturated Fat": "5.9g", "Carbohydrate": "31.8g", "Sugars": "10g", "Protein": "28g", "Salt": "1g", "Fibre": "12.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/WRWK190117homemade-smoky-baked-beans-with-egg-chorizo.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}