{"title": "Hot cross buns", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT40 minutes, plus provingM", "cook_time": "PT15M", "total_time": "PT55 minutes, plus provingM", "serves": "10"}, "ingredients": [{"item": "75g LOVE Life Fruit, Seed & Nut Muesli"}, {"item": "3 tbsp orange juice"}, {"item": "425g strong white bread fl our, plus extra for dusting"}, {"item": "65g caster sugar"}, {"item": "2 tsp easy-blend dried yeast"}, {"item": "2 tsp mixed spice"}, {"item": "100g LOVE Life Raisin Mix"}, {"item": "1 tsp sea salt"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "50g butter, melted"}, {"item": "150ml warm milk"}, {"item": "To finish"}, {"item": "50g plain flour"}, {"item": "4 tbsp milk"}, {"item": "4 tbsp caster sugar"}], "instructions": [{"step": "Soak the muesli in the orange juice for 10 minutes. Put the soaked muesli with liquid, flour, sugar, yeast, spice, raisins and salt in a large bowl. Beat the egg with the melted butter and milk, then add to the bowl. Mix with a round-bladed knife to make a soft dough, adding a dash more milk if the dough feels dry."}, {"step": "Turn out onto a floured surface and knead for 10 minutes until the dough feels elastic. Transfer to a lightly oiled bowl, cover with clingfilm and leave to rise in a warm place for 1½-2 hours or until the dough has doubled in size."}, {"step": "Grease a large baking sheet. Turn the dough out onto a floured surface and cut into 10 pieces. Shape each into a ball and space 5cm apart on the baking sheet. Cover loosely with greased clingfilm and leave in a warm place for a further 45-60 minutes until doubled in size. Preheat the oven to 220°C, gas mark 7."}, {"step": "For the crosses, stir 5 tbsp cold water into the plain flour until no lumps remain. Spoon into one corner of a small plastic food bag and twist the ends to contain the mixture, or use a Cooks' Homebaking Piping Bag. Snip off the very tip and pipe crosses onto the buns."}, {"step": "Bake for about 12-15 minutes until risen and golden. Meanwhile, gently heat the milk and sugar in a small saucepan until the sugar dissolves. Bring to the boil and boil for 2 minutes. Brush over the buns while still warm then transfer to a wire rack to cool."}], "nutrition": {"Energy": "1,476kj/349kcals", "Fat": "7g", "Saturated Fat": "3.4g", "Carbohydrate": "64.1g", "Sugars": "25.9g", "Salt": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/2014wked-March-r6crossbuns.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}