{"title": "Hot & sour soup with pork, prawns & noodles", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT30M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "180g raw jumbo king prawns, deveined"}, {"item": "400g pork mince"}, {"item": "1 tbsp cornflour"}, {"item": "4 salad onions, trimmed"}, {"item": "2 cloves garlic, crushed"}, {"item": "1 large red chilli, finely chopped"}, {"item": "3 tsp finely grated ginger"}, {"item": "2 tbsp chopped coriander"}, {"item": "2 lemongrass stalks, trimmed, halved and bruised"}, {"item": "2 tbsp sunflower oil"}, {"item": "500ml shellfish stock"}, {"item": "500ml light vegetable stock"}, {"item": "4 fresh lime leaves"}, {"item": "2 tbsp soy sauce, plus extra to taste"}, {"item": "2 tbsp fish sauce, plus extra to taste"}, {"item": "1-2 tsp Lee Kum Kee Chui Chow Chilli Oil, plus extra to serve"}, {"item": "1 tsp sugar, plus extra to taste"}, {"item": "Juice of 1 lime"}, {"item": "200g pack Waitrose Tat Soi (or 200g Pak Choi), cut into ribbons"}, {"item": "2 x 150g packs Amoy Straight To Wok Rice Noodles"}], "instructions": [{"step": "Roughly chop the prawns and tip into a food processor along with the pork mince and cornflour. Finely slice the salad onions and add half to the mixer with half each of the garlic, chilli and ginger. Whizz until the mixture is thoroughly combined then add half the chopped coriander and whizz again – the mixture should still have some texture."}, {"step": "Tip the mixture into a bowl and, using damp hands, roll into 20 even size balls. Place on a clean tray, cover and chill while you prepare the broth."}, {"step": "Tip the remaining garlic, chilli and ginger into a large wok or saucepan, add the lemongrass stalks, 1 tbsp sunflower oil and cook over a low-medium heat until aromatic. Add the shellfish and vegetable stocks, lime leaves, soy sauce, fish sauce, chilli oil and sugar and bring slowly to the boil. Cook at a low simmer for 20 minutes. Taste, add the lime juice and a little more sugar, fish sauce or soy if needed to balance the flavours."}, {"step": "Fry the pork and prawn balls in a large frying pan in the remaining sunflower oil for about 10 minutes, until golden brown. Remove from the pan and drain briefly on kitchen paper. Add the pork balls to the stock and simmer for a further 2 minutes. Add the tat soi (or pak choi) to the broth together with the noodles and continue to cook until the noodles are piping hot throughout, the pork balls are cooked through with no pink meat and the tat soi is wilted and tender. Serve scattered with the remaining chopped coriander, sliced salad onions and with extra chilli oil on the side."}], "nutrition": {"Energy": "1,811kJ 432kcals", "Fat": "18.8g", "Saturated Fat": "4.6g", "Carbohydrate": "28.7g", "Sugars": "6.7g", "Protein": "36.9g", "Salt": "3.9g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Waitrose-Weekend_RT_WK353_WKEnd_Fri-Night-Supper_Hot-&-Sour-Soup-Pork-prawns-Noodles.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}