{"title": "Hot cross apple scones", "tags": null, "planning": {"prep_time": "PT 20 minutes + coolingM", "cook_time": "PT12M", "total_time": null, "serves": "16"}, "ingredients": [{"item": "400g self-raising flour, plus extra for dusting"}, {"item": "1 tsp baking powder"}, {"item": "100g cold unsalted butter, cut into cubes"}, {"item": "1 tsp ground mixed spice"}, {"item": "85g light brown muscovado sugar"}, {"item": "2 small Braeburn apples, peeled and chopped into small pieces"}, {"item": "100g Waitrose Sweet & Tangy Fruit Mix (dried)"}, {"item": "Zest 1 orange and 1 tbsp juice"}, {"item": "200ml semi-skimmed milk"}, {"item": "1 tsp vanilla extract"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg, beaten"}, {"item": "85g plain flour, plus extra for dusting"}, {"item": "2 tsp golden syrup"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7 and heat a baking sheet in the top third of the oven. Sift the flour and baking powder into a large bowl with ½ tsp salt. Rub in the butter until the mix looks like fine breadcrumbs, then stir in the spice, sugar, apples, dried fruit and orange zest."}, {"step": "Warm the milk to room temperature then stir in the orange juice and vanilla plus 2 tbsp beaten egg. Combine this mixture with the dry ingredients to make a rough, sticky dough — stirring quickly with a round-bladed knife as you pour will keep the scones light."}, {"step": "Flour a clean work surface, tip the dough onto it then flour the dough and your hands. Gently knead a few times until a little smoother, then pat into a round about 3cm thick. Dust with more flour, then stamp out 6cm rounds using a straight-sided cutter. Pat together the leftovers and repeat to make 16 scones."}, {"step": "To make the crosses, stir 6–7 tbsp cold water into the plain flour to make a smooth paste. This will loosen as it sits, so don’t be tempted to add too much water. Spoon into a food bag or disposable piping bag and snip off the end at about 5mm."}, {"step": "Sprinkle the hot baking sheet with flour, then add the scones. Pipe crosses over the tops (see Cook's Tip below) then bake for 12 minutes or until risen, golden and they sound hollow when tapped underneath. Stir 1 tsp boiling water into the golden syrup to make a glaze, then brush over the scones and leave to cool on a wire rack."}], "nutrition": {"Energy": "854kJ 203kcals", "Fat": "5.8g", "Saturated Fat": "3.6g", "Carbohydrate": "34.4g", "Sugars": "13.1g", "Protein": "3.2g", "Salt": "0.3g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/HotCrossScones_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}