{"title": "Hotteok", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes, plus proving and coolingM", "cook_time": "PT15M", "total_time": "PT45 minutes, plus proving and coolingM", "serves": "8"}, "ingredients": [{"item": "200g strong white bread flour"}, {"item": "50g rice flour"}, {"item": "½ tsp sea salt"}, {"item": "7g sachet easy bake yeast"}, {"item": "125ml milk"}, {"item": "1 tbsp golden caster sugar"}, {"item": "about 1 litre vegetable oil, plus extra for kneading and greasing"}, {"item": "Filling"}, {"item": "40g dark brown soft sugar"}, {"item": "40g golden caster sugar"}, {"item": "40g mixed nuts, finely chopped (such as walnuts and pine nuts)"}, {"item": "¼ tsp ground cinnamon"}], "instructions": [{"step": "Mix the flours, salt and yeast in a large bowl. Gently heat the milk and 50ml water in a small saucepan until warm but not steaming, stir in the 1 tbsp caster sugar, then gradually pour over the flour mixture, stirring with a wooden spoon until it forms a rough, sticky dough. Lightly oil your hands, then knead in the bowl for 1-2 minutes, until it becomes smoother. Cover and leave for 30 minutes-1 hour in a warm place until doubled in size. Meanwhile, put all the filling ingredients in a small bowl with a pinch of salt; mix to combine."}, {"step": "When the dough is ready, lightly grease a baking tray with oil and rub some more oil on your hands. Divide the dough into 8 equal balls. Flatten 1 ball into a palm-sized disc. Put 11/2 tbsp filling in the middle then bring the top and bottom edges to the centre and pinch tightly together to seal. Repeat with the left and right edges to give a round shape. Set this seam-side down on the work surface; make a claw with your hand and roll the dough using your palm to create a tight ball. Put on the oiled tray. Repeat with the remaining dough and filling."}, {"step": "Oil a spatula, then put a large frying pan with some oil (about 2cm deep) over a medium heat. When hot (but not smoking), carefully drop in the pancakes, seam-side down (you may need to work in batches); press gently to flatten with the oiled spatula. Flip and press again gently. Fry for 3-4 minutes or until both sides are golden. Lift out onto a plate lined with kitchen paper and enjoy as soon as they are cool enough to eat."}], "nutrition": {"Energy": "1,048kJ 250kcals", "Fat": "9.1g", "Saturated Fat": "0.9g", "Carbohydrate": "36g", "Sugars": "13g", "Protein": "5.3g", "Salt": "0.4g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Hotteok.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}