{"title": "Hyderabad-inspired red chicken biryani", "tags": null, "planning": {"prep_time": "PT15 minutes + soaking and marinatingM", "cook_time": "PT1 hour 30 minutesM", "total_time": "PT1 hour 45 minutes + soaking and marinatingM", "serves": "4"}, "ingredients": [{"item": "4 chicken thighs"}, {"item": "300g pack The Spice Tailor Hyderabad Red Korma"}, {"item": "150g Yeo Valley Natural Yogurt, plus extra to serve"}, {"item": "25g fresh ginger, peeled and finely chopped or grated"}, {"item": "1 clove garlic, peeled and finely chopped or grated"}, {"item": "280g Tilda Basmati Rice"}, {"item": "4 tbsp sunflower oil"}, {"item": "2 onions, thinly sliced"}, {"item": "1 stick cinnamon"}, {"item": "Pinch of saffron, covered in 3 tbsp boiling water"}, {"item": "28g pack coriander, roughly chopped"}], "instructions": [{"step": "Put the chicken, the pastes from the korma kit, yogurt, ginger and garlic into a bowl, combine and season. Cover and place in the fridge for at least 2 hours, or ideally overnight."}, {"step": "Wash the rice under cold running water, until the water is no longer cloudy, then put in a bowl and cover with fresh water. Soak for 30 minutes. Meanwhile heat 3 tbsp of oil in a large frying pan, add the onions with a pinch of salt and cook over a medium heat, increasing the heat if needed, for 20-25 minutes, stirring from time to time until brown, sticky and starting to crisp. Turn off the heat and set aside."}, {"step": "Bring a pan of salted water to the boil. Add the whole spices from the korma kit along with the cinnamon stick. Add the rice, bring back to the boil and cook for about 4 minutes, until about three-quarters cooked and still a little crunchy. Drain and set aside to steam dry in the sieve. Preheat the oven to 200°C, gas mark 6."}, {"step": "Add the remaining oil to a large cast iron casserole dish. Place the chicken into the pan (reserving the marinade), add a layer of rice and then onions, drizzle over the saffron and its water, then cover the pan in 2 layers of foil and the lid. Bake for 50 minutes, or until the chicken is completely cooked and there is no pink meat. When you’re almost ready to serve, tip the excess marinade into a saucepan and heat gently until bubbling and slightly thickened. Sprinkle with coriander, then serve with the sauce and yogurt alongside."}], "nutrition": {"Energy": "2,287kJ 547kcals", "Fat": "27g", "Saturated Fat": "5.6g", "Carbohydrate": "51g", "Sugars": "11g", "Protein": "22g", "Salt": "1g", "Fibre": "4.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Waitrose-Weekend_Wk497_Advertorial-Indian_Hyderabadi-Red-Chicken-Biriyani.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}