{"title": "Irish cream coffee macarons", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30M", "cook_time": "PT40M", "total_time": "PT1 hour 10 minutesM", "serves": "26-30"}, "ingredients": [{"item": "90g icing sugar"}, {"item": "85g ground almonds"}, {"item": "2 egg whites"}, {"item": "1 tbsp Camp Chicory & Coffee Essence"}, {"item": "80g caster sugar"}, {"item": "For the filling"}, {"item": "60g unsalted butter, softened"}, {"item": "1½ tbsp Baileys Original Irish Cream"}, {"item": "100g icing sugar, sifted"}], "instructions": [{"step": "Line 2 baking trays with baking parchment. Using a high-speed blender, whizz together the icing sugar and almonds (10-15 pulses). Sieve into a medium bowl; combine with 1 egg white (about 35g) and the coffee essence."}, {"step": "Put the caster sugar and 2 tbsp water in a pan; heat to dissolve. Meanwhile, put the remaining 1 egg white in a medium bowl and use electric beaters to whisk on a high speed to soft peaks (1-2 minutes). Once the sugar has dissolved, increase the heat; using a jam thermometer, bring the sugar syrup to 118˚C. As it nears this temperature, resume beating the egg white then, quickly and confidently, add the sugar syrup, while whisking, making sure all the syrup is incorporated. Whisk the mixture until glossy and thick (1-2 minutes). Mix a large spoonful of the whisked egg white through the almond mixture until combined. Gently fold in the remainder."}, {"step": "Spoon the mixture into a piping bag. Cut the tip off the bag to create a 1cm hole and pipe circles onto your parchment- lined sheets (about the size of a £2 coin – see cook’s tip; you should pipe 52-60 in total). Leave the trays to sit for 20-30 minutes, or until the macarons form a light skin. Preheat the oven to 170˚C, gas mark 3."}, {"step": "Bake the macarons one tray at a time for 12-14 minutes, until it is easy to peel a macaron off the baking parchment. Leave to cool on the baking trays. Meanwhile, to make the filling, beat the butter until light and fluffy. Whisk in the Irish cream, then add the icing sugar a little at a time. Spoon into a piping bag and pipe onto the base of a macaron shell, then sandwich with a second macaron shell (you can also fill them with a teaspoon)."}], "nutrition": {"Energy": "355kJ 85kcals", "Fat": "3.8g", "Saturated Fat": "1.4g", "Carbohydrate": "11g", "Sugars": "11g", "Protein": "1.3g", "Salt": "0.1g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/i/250620_Waitrose_Baking_Cover_Coffee-Macaroons-V1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}