{"title": "Izy Hossack’s earl grey & orange hot cross buns", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT40 minutes, plus steeping,cooling and provingM", "cook_time": "PT35M", "total_time": "PT1 hour 15 minutes, plus steeping, cooling and provingM", "serves": "12"}, "ingredients": [{"item": "4 earl grey tea bags"}, {"item": "7g sachet easy bake yeast"}, {"item": "3 tbsp granulated sugar"}, {"item": "440g plain flour"}, {"item": "1 tsp salt"}, {"item": "1 tbsp mixed spice"}, {"item": "2 large oranges, zest and 80ml juice"}, {"item": "100g currants or raisins"}, {"item": "1 large egg, beaten"}, {"item": "50g unsalted butter, melted and cooled"}, {"item": "vegetable oil, for kneading and greasing"}, {"item": "65g plain flour"}, {"item": "about 2 tbsp whole milk"}, {"item": "3 tbsp apricot jam, sieved"}], "instructions": [{"step": "Steep the tea bags in 160ml boiling water for 15 minutes. Squeeze out as much liquid as possible; discard the tea bags. When the tea is lukewarm, about 38˚C, mix in the yeast until dissolved, then beat in the sugar and 60g plain flour; set aside for 15 minutes."}, {"step": "In a large bowl, mix the remaining 380g flour with the salt, mixed spice, orange zest and currants or raisins. Whisk the orange juice and egg into the melted butter, then mix, with the yeasted tea, into the dry ingredients to form a smooth dough."}, {"step": "Knead the dough on an oiled work surface until smooth and elastic – about 10 minutes. Return to a clean, oiled bowl, cover with cling film and leave to rise in a warm place for about 1 hour or until doubled in size."}, {"step": "Divide and shape the dough into 12even buns, then line them up in rows ona parchment-lined baking tray, 2-3cm apart. Slash a cross into the top of each using a sharp, serrated knife; cutting in the same direction across each row of buns will make the piping easier. Cover with oiled cling film and leave to rise again until doubled in size, about 30 minutes. Preheat the oven to 180˚C, gas mark 4."}, {"step": "For the crosses, beat the flour with enough water (about 70ml) to make a loose paste. Transfer to a piping bag fitted with a 1cm plain nozzle (or cut a 1cm opening in a disposable piping or sandwich bag). Brush the buns with milk, then pipe the flour paste into the cuts made for the crosses."}, {"step": "Bake for 30-35 minutes, until golden and hollow-sounding. Gently heat the apricot jam in a small pan, brush over the warm buns, then cool completely on a wire rack. These are best eaten on the day of baking but can be stored in an airtight container for up to 5 days and are delicious toasted."}], "nutrition": {"Energy": "1,119kJ 265kcals", "Fat": "5.9g", "Saturated Fat": "2.9g", "Carbohydrate": "47.7g", "Sugars": "15.7g", "Protein": "5.3g", "Salt": "0.5g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Waitrose-Kitchen-12-01-156987_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}