{"title": "Jackfruit & vegetable fajitas with spicy lime black beans", "tags": [{"tag": "Vegetarian"}, {"tag": "Vegan"}], "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "6"}, "ingredients": [{"item": "3 x 400g cans Epicure Organic Black Beans, drained and rinsed"}, {"item": "1 large green chilli, finely chopped (deseed for less heat)"}, {"item": "2 limes"}, {"item": "28g pack Santa Maria Original Fajita Mild"}, {"item": "4 tsp olive oil"}, {"item": "1 pack mixed peppers, deseeded and cut into strips"}, {"item": "1 red onion, chopped"}, {"item": "230g pack asparagus, trimmed and cut into 2cm pieces"}, {"item": "2 x 410g cans Cooks’ Ingredients Jackfruit, drained"}, {"item": "384g pack 6 malted rye tortilla wraps"}, {"item": "28g pack coriander, roughly chopped"}], "instructions": [{"step": "Place the black beans in a saucepan with 150ml water, the chilli, juice from 1 lime and 1 tsp of fajita seasoning. Simmer over a low heat for 10 minutes, stirring occasionally."}, {"step": "Meanwhile, heat 1 tbsp of the oil in a large frying pan. Fry the peppers, onion and asparagus for 5 minutes, stirring occasionally, until seared. Transfer to a bowl. Add the remaining oil to the pan and cook the jackfruit for 2-3 minutes until lightly browned. Transfer to a chopping board and pull into shreds using two forks."}, {"step": "Return the vegetables and jackfruit to the pan, sprinkle with the remaining fajita seasoning and toss over a medium heat for 2 minutes. Warm the tortillas according to the pack instructions. Divide the jackfruit mixture between the tortillas. Serve scattered with coriander and with the remaining lime cut into wedges to squeeze over and the beans on the side."}], "nutrition": {"Energy": "1,990kJ 473kcals", "Fat": "7.9g", "Saturated Fat": "1.1g", "Carbohydrate": "73g", "Sugars": "10g", "Protein": "18g", "Salt": "1.5g", "Fibre": "17g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/Waitrose-Weekend_Wk489_Healthy-Everyday_Jackfruit-&-Vegetable-Fajitas.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}