{"title": "Japanese-style poached sea bass in mushroom and rice broth", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "250g pouch microwavable long grain rice"}, {"item": "500g dashi broth"}, {"item": "10g fresh root ginger, cut into matchsticks"}, {"item": "2 tbsp mirin"}, {"item": "1/2 tbsp light soy sauce"}, {"item": "1 tbsp light soft brown sugar"}, {"item": "40g shiitake mushrooms, sliced"}, {"item": "1 tbsp Cook's Ingredients aonori seaweed"}, {"item": "115g baby spinach"}, {"item": "4 salad onion, cut into long thin slices"}, {"item": "2 Waitrose & Partners Boneless Sea Bass Fillets"}, {"item": "1 tbsp Miso Tasty Aka Red Miso Paste"}], "instructions": [{"step": "Heat the rice according to pack instructions and divide between 2 warm soup bowls. Meanwhile, put the dashi in a pan with 250ml water, the ginger, mirin, soy sauce, sugar and shiitake mushrooms. Bring to the boil then simmer for 4 minutes. Add the seaweed, spinach and most of the salad onions. Bring back to a simmer, add the sea bass fillets in a single layer and cook for about 2 minutes, until tender but not flaking apart. Carefully lift the fish fillets onto a plate, remove and discard the skin then cut each fillet in half. Sit the fish on the rice in the bowls."}, {"step": "Return the broth to gentle simmer. Put the miso paste into a heatproof bowl and and whisk in a ladle of the broth to blend. Pour the miso mixture into the broth and gently simmer until just blended; don't boil. Ladle the broth over the rice and fish and serve with the remaining salad onions scattered over."}], "nutrition": {"Energy": "1,872kJ 439kcals", "Fat": "12.2g", "Saturated Fat": "2.3g", "Carbohydrate": "52.4g", "Sugars": "10.2g", "Protein": "27.8g", "Salt": "1.64g", "Fibre": "4.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/miso1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}