{"title": "Jersey Royal focaccia", "tags": null, "planning": {"prep_time": "PT30 minutes, plus provingM", "cook_time": "PT55M", "total_time": "PT1 hour 25 minutes, plus provingM", "serves": "8-12"}, "ingredients": [{"item": "500g strong white bread flour"}, {"item": "2 tsp fine sea salt"}, {"item": "7g sachet fast action yeast"}, {"item": "8 tbsp extra virgin olive oil, plus extra for greasing and drizzling"}, {"item": "300g Jersey Royals"}, {"item": "5 garlic cloves, halved"}, {"item": "3 tbsp rosemary leaves"}], "instructions": [{"step": "Sift the flour into a large bowl; stir in the salt and yeast. Make a well in the centre and stir in 3 tbsp olive oil and 360ml warm water. Mix into a wet, sticky dough, adding up to 30ml more water if needed. Knead for about 6 minutes in a freestanding mixer with a dough hook (or by hand on a lightly oiled surface for 10 minutes) until smooth and stretchy. Return the dough to the bowl, cover with a clean tea towel and leave in a warm place until doubled in size (40 minutes-2 hours, depending on the warmth of your kitchen)."}, {"step": "Meanwhile, cook the Jersey Royals in boiling salted water for 15 minutes until tender; drain and leave to cool slightly. Cut into quarters then put in a bowl with the garlic cloves and rosemary leaves, drizzle with another 3 tbsp olive oil; season."}, {"step": "Once the dough has fully risen, line a 25cm x 35cm baking tray with parchment then rub all over with oil. Put the dough on the tray and press it out flat to the 4 corners. Cover and leave to prove in a warm place until almost doubled in size (30-40 minutes). When it is almost fully risen, preheat the oven to 220˚C, gas mark 7."}, {"step": "Firmly dimple the dough with your fingertips, then press the potatoes, garlic and rosemary into the dimples. Drizzle over the remaining 2 tbsp olive oil with 2 tbsp water and sprinkle with salt flakes. Bake for 20 minutes, then reduce the heat to 180˚C, gas mark 4 and bake for 20 minutes more until golden. Serve warm, drizzled with extra oil."}], "nutrition": {"Energy": "Per serving (8) 1588kJ 378kcals", "Fat": "15g", "Saturated Fat": "2.2g", "Carbohydrate": "51g", "Sugars": "0.8g", "Protein": "8.9g", "Salt": "1.8g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/Jersey-royal-focaccia.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}