{"title": "John Whaite's Eton Mess Cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "8 - 10"}, "ingredients": [{"item": "For the cake"}, {"item": "340g stork/very soft butter"}, {"item": "340g caster sugar"}, {"item": "6 large eggs"}, {"item": "340g self raising flour"}, {"item": "1tsp baking powder"}, {"item": "For the filling"}, {"item": "300g strawberries"}, {"item": "50g caster sugar"}, {"item": "300ml double cream"}, {"item": "3 passionfruit"}, {"item": "For the meringue and topping"}, {"item": "4 large egg whites"}, {"item": "225g caster sugar"}, {"item": "3 meringue nests"}], "instructions": [{"step": "Preheat the oven to 180C/160C fan/gas mark 4. Grease and line the bases of 3 x 20cm sandwich tins."}, {"step": "For the cake, place the stork/butter, sugar, eggs, flour and baking powder into a mixing bowl or freestanding electric mixer fitted with paddle attachment, and beat just until you have a smooth batter – don’t over mix! Divide the batter evenly between the cake tins and bake for 20-25 minutes, or until a skewer inserted into the centre of each cake comes out clean. Allow the cakes to cool in their tins for 5 minutes, then invert onto a wire rack to cool completely. If the cakes are a little wonky, level them, once cooled, with a long serrated knife."}, {"step": "For the filling, hull the strawberries and chop each one in half. Put them into a bowl and toss with the caster sugar. Leave to macerate for a good 10 minutes."}, {"step": "Whip the cream to soft floppy peaks – the peaks should just about hold their shape, but don’t over whip the cream."}, {"step": "To assemble, place one cooled cake onto a cakestand and top it with half the cream. Spread the cream out evenly. Place one third of the strawberries onto the cream and squeeze over the pulp of half a passionfruit. Repeat with another slice of cake, the remaining cream, the second third of the strawberries, and another half of passionfruit"}, {"step": "To make the meringue, place the egg whites and sugar into a large heatproof mixing bowl and set it over a pan of simmering water. Using a handheld electric mixer beat the egg whites and sugar together until they start to thicken and feel hot to the touch. Once they feel hot, remove the bowl from the pan of water and continue whisking for 5-10 minutes, until the mixture is at room temperature, and is a very thick, glossy meringue."}, {"step": "Pile the two thirds of the meringue onto the cake and spread it over the top and down the sides – I use a crank-handled palette knife for this. Get the meringue as smooth as you can, but a few little imperfections make this look even better."}, {"step": "Blob the remaining meringue on top in large, random spoonfuls, then scatter over the remaining strawberries – leave any juice in the bowl. Quarter the remaining passionfruit and place them randomly on top of the cake. Crumble over the meringue nests and chill until ready to serve."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/John Whaite cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}