{"title": "John Whaite's Clementine and cardamom upside-down cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "10 - 12"}, "ingredients": [{"item": "For the topping"}, {"item": "125g caster sugar 8 clementines"}, {"item": "For the cake"}, {"item": "285g unsalted butter"}, {"item": "285g light brown muscovado sugar"}, {"item": "5 large eggs, beaten"}, {"item": "285g self-raising four"}, {"item": "11⁄2 tsp ground cardamom"}, {"item": "1 tsp fine sea salt"}, {"item": "For the glaze (optional)"}, {"item": "4 tbsp apricot jam"}, {"item": "1 tbsp water"}], "instructions": [{"step": "Preheat the oven to 170°C/150°C fan/gas mark 3. Grease a 23cm round loose-bottomed cake tin and line with baking paper."}, {"step": "For the topping, heat a medium saucepan over a medium-high heat. Once the pan is hot, add the sugar and allow it to melt and slowly turn to an amber caramel – the sugar touching the base of the pan will turn rst, and slowly but surely the sugar on top will soon become liquid, too. Give the pan a little swirl as the sugar starts to melt. Once you have a dark caramel, pour it into the base of the prepared cake tin."}, {"step": "Keeping them whole, peel the clementines, then cut them in half horizontally to retain that little hole in the top and bottom. Arrange the clementine halves, hump-side down, on the caramel."}, {"step": "For the cake, cream together the butter and sugar until really soft – the butter should become very pale and the sugar will more or less dissolve into it. Add the eggs, a little at a time, beating well after each addition, then add the our, cardamom and salt and beat in just until incorporated to a smooth batter. I do all of this in my KitchenAid tted with the paddle attachment, but an electric hand-held mixer will do. Pour the batter over the clementines and gently level it out, being careful not to displace the fruits. Bake for 1 hour and up to 1 hour 10 minutes, until a skewer inserted into the centre of the cake comes out clean, apart from the odd crumb of cake made soggy by the oranges beneath. Remove the cake from the oven and allow it to cool in the tin for 5 minutes, then invert onto a plate."}, {"step": "For the glaze, simply combine the jam and water in a small pan and bring to the boil. Paint the glaze onto the cake with a pastry brush. The cake will keep for a few days in an airtight tin; it’ll actually be that bit better on day two."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/Clementine-Cake-2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}