{"title": "Jordan Bourke's Vietnamese-style crispy pancakes with nuoc cham sauce", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT35M", "total_time": "PT1 hourM", "serves": "6"}, "ingredients": [{"item": "220g rice flour"}, {"item": "1½ tsp ground turmeric"}, {"item": "1 tsp caster sugar"}, {"item": "400ml coconut milk, warmed gently if solid"}, {"item": "vegetable oil, for frying"}, {"item": "200g beansprouts"}, {"item": "150g cooked king prawns"}, {"item": "25g pack mint, leaves picked"}, {"item": "28g pack coriander, leaves picked"}, {"item": "3 salad onions, shredded into 7cm lengths"}, {"item": "1 tbsp caster sugar"}, {"item": "2 garlic cloves, crushed"}, {"item": "1 red Thai chilli, deseeded and very finely chopped"}, {"item": "2 limes, zest of 1 and 2 tbsp juice"}, {"item": "2½ tbsp fish sauce"}], "instructions": [{"step": "For the pancakes, sieve the rice flour and turmeric into a large bowl. Stir in the sugar and a large pinch of salt, then slowly whisk in the coconut milk and 200ml water, ensuring there are no lumps. Leave to rest for 20 minutes."}, {"step": "Meanwhile, for the nuoc cham sauce, put the sugar and 100ml warm water in a bowl and stir until dissolved. Add the remaining ingredients, stir, cover and set aside. Preheat the oven to 100˚C, gas mark ¼."}, {"step": "Heat 1 tbsp oil in a large 24cm-base non-stick pan over a high heat. Once smoking hot, pour in a large ladleful of batter, ensuring it covers the entire surface of the pan in a thin layer (you will need to swirl the batter quickly). Fry for 4-5 minutes, without moving it around, until the bottom is golden brown in places, quite crispy and the surface is dry. Slide onto a plate and keep warm in the oven; repeat with the rest of the batter. 4 Put another 1 tbsp oil in the pan, add the beansprouts and stir-fry for 3 minutes. Stir in the prawns for 1 minute. Season and divide the mixture between the pancakes, add the herbs and salad onions, and drizzle over the sauce."}], "nutrition": {"Energy": "1,626kJ 389kcals", "Fat": "23g", "Saturated Fat": "12g", "Carbohydrate": "36g", "Sugars": "6.7g", "Protein": "8.9g", "Salt": "1.7g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Vietnamese-style-crispy-pancakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}