{"title": "Jun Tanaka's seafood okonomiyaki", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT10M", "total_time": "PT30M", "serves": "4-6"}, "ingredients": [{"item": "3 eggs"}, {"item": "100ml Cooks’ Ingredients dashi"}, {"item": "125g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "40g pointed cabbage, finely shredded"}, {"item": "40g beansprouts"}, {"item": "100g cooked mussels, shelled"}, {"item": "8 raw king prawns, peeled and cut into 1cm pieces"}, {"item": "25ml olive oil"}, {"item": "100g tomato ketchup"}, {"item": "25g Worcestershire sauce"}, {"item": "100g mayonnaise"}, {"item": "2 tbsp finely chopped salad onions"}, {"item": "4 sheets sushi nori, cut into thin strips"}, {"item": "25g sushi ginger, cut into thin strips"}], "instructions": [{"step": "To make the okonomiyaki batter, put the eggs in a bowl and add the dashi. Whisk together, then slowly add the flour and baking powder to form a smooth batter. Season with salt."}, {"step": "Add the cabbage, beansprouts, mussels and prawns; gently fold together. Take a non-stick pan, around 22cm in diameter, pour in the oil and set over a gentle heat. When hot, pour the okonomiyaki mixture into the pan and cook over a medium-high heat for 5 minutes, or until golden. Keep checking to make sure that it does not burn."}, {"step": "Using a spatula, very carefully flip the okonomiyaki onto a plate, then quickly transfer back to the pan and cook for a further 5 minutes. Test that it’s cooked by inserting a thin knife into the centre – if there is batter left on the knife, cook for a further 2 minutes, then test again. When the knife comes out clean, it’s cooked. Transfer to a serving plate."}, {"step": "Mix the tomato ketchup and Worcestershire sauce in a bowl then transfer to a small piping bag. Put the mayonnaise in a separate piping bag. Squeeze the tomato ketchup mixture in a zigzag all over the okonomiyaki. Repeat with the mayonnaise. Sprinkle the salad onions over the top, followed by the nori. Finally, place the sushi ginger in the centre and serve."}], "nutrition": {"Energy": "Per serving (6) 1394kJ 334kcals", "Fat": "21g", "Saturated Fat": "2.6g", "Carbohydrate": "23g", "Sugars": "5.8g", "Protein": "13g", "Salt": "1.8g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/Jun-Tanaka's-seafood-okonomiyaki.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}