{"title": "Juniper and rosemary lamb with damson and sloe gin sauce", "tags": null, "planning": {"prep_time": "PT10 minutes, plus marinating and restingM", "cook_time": "PT90M", "total_time": "PT1 hour 40 minutes, plus marinating and restingM", "serves": "6"}, "ingredients": [{"item": "2 rosemary sprigs"}, {"item": "2 tsp sea salt"}, {"item": "2 tsp caster sugar"}, {"item": "2 garlic cloves"}, {"item": "1 tbsp unsalted butter, softened"}, {"item": "8 juniper berries"}, {"item": "2kg whole lamb leg"}, {"item": "1 onion, thickly sliced"}, {"item": "150ml chicken stock"}, {"item": "2 tbsp damson jam"}, {"item": "2 tbsp sloe gin"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Strip the leaves from the rosemary and crush in a pestle and mortar with the salt, sugar, garlic, butter and juniper berries. With a small sharp knife, make several slits all over the lamb. Rub the marinade over the lamb, pushing it into the slits. Scatter the onion into a large roasting tin and sit the lamb on top. Set aside to marinate for 30 minutes and allow the lamb to come to room temperature."}, {"step": "Put the lamb in the oven and roast for 20 minutes, then turn the heat down to 180°C, gas mark 4, and roast for 1 hour more (these timings are for slightly pink meat; cook for longer if your prefer your lamb more well done). Once cooked, take the lamb out of the roasting tin and transfer to a chopping board. Cover loosely with a sheet of foil to keep warm and set aside to rest for 30 minutes."}, {"step": "To make the damson sauce, tip the stock into the roasting tin, place over a medium heat and boil, scraping up any sticky bits with a wooden spoon. Sieve into a small saucepan; discard any solids. Spoon the fat from the top of the gravy, then bring to the boil. Stir in the damson jam and sloe gin, then simmer for 10 minutes until reduced."}, {"step": "Slice the lamb and serve with the damson sauce, boulangère potatoes and red cabbage"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/j/2013wkwe-March-r4k.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}