{"title": "Ken Hom's Shanghai-style wonton", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "250g wonton wrappers (see recipe below or buy from Chinese food stores)"}, {"item": "350g pak choi, coarsely chopped"}, {"item": "Pinch chilli powder"}, {"item": "½ teaspoon salt"}, {"item": "Freshly ground white pepper to taste"}, {"item": "2 tsp light soy sauce"}, {"item": "2 tbsp salad onions, chopped finely"}, {"item": "1 tbsp Shaoxing rice wine or dry sherry"}, {"item": "1 tsp sugar"}, {"item": "2 tsp toasted sesame oil"}, {"item": "1.2 litres chicken stock"}, {"item": "1 tbsp light soy sauce"}, {"item": "1 tsp toasted sesame oil"}, {"item": "Chopped salad onions"}], "instructions": [{"step": "Blanch the pak choi and squeeze all excess liquid out, then add all the other filling ingredients and mix well."}, {"step": "When you are ready to stuff the wontons, put 1 tablespoon of the filling in the centre of the first wonton wrapper. Dampen the edges with a little water and bring up the sides of the wrapper around the filling. Pinch the edges together at the top so that the wonton is sealed; it should look like a small filled bag."}, {"step": "When the wontons are ready, bring the stock, soy sauce and sesame oil to a simmer in a large pot."}, {"step": "In another large pot, bring salted water to a boil and poach the wontons for one minute or until they float to the top. Remove them immediately and transfer them to the pot with the stock (this procedure will result in a cleaner-tasting broth). Continue to simmer them in the stock for two minutes. Transfer to either a large soup bowl or to individual bowls. Garnish with salad onions and serve immediately."}, {"step": "Combine 250g ‘00’ pasta flour or plain flour, 1 medium Waitrose British Blacktail Free Range Egg, 1 medium Waitrose British Blacktail Free Range Egg Yolk and 1 tsp fine sea salt in a food processor and pulse until the mixture resembles fine breadcrumbs. Add cold water until it starts to form a rough ball."}, {"step": "Tip the dough out on to a clean work surface and knead until smooth. Wrap in clingfilm and refrigerate for one hour."}, {"step": "Dust the work surface with a little cornflour, unwrap the dough and roll out as thinly as possible. Cut into approx sixteen 9cm squares and dust each square with cornflour. Stack the wrappers then wrap in clingfilm and chill until ready to use."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/KenHom_Wonton_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}