{"title": "Kiwi-marinated squid with red onion, kiwi and lime salsa", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT10M", "total_time": "PT40M", "serves": "2"}, "ingredients": [{"item": "300g baby squid, cleaned (available from the fish service counter)"}, {"item": "3 golden kiwis, peeled"}, {"item": "1 small red onion, finely sliced"}, {"item": "1 tsp light brown soft sugar"}, {"item": "½-1 green chilli, finely sliced, to taste"}, {"item": "1 lime, zest and juice"}, {"item": "25g pack mint, leaves picked"}, {"item": "1 tsp cumin seeds"}, {"item": "10g fresh root ginger, peeled and roughly chopped"}, {"item": "1 tbsp olive oil"}, {"item": "steamed brown basmati or coconut rice and cavolo nero, to serve (optional)"}], "instructions": [{"step": "Cut the squid tubes in half from top to bottom to make 2 pieces. Lightly score the inside surfaces with a sharp knife in a criss-cross pattern. Dice 2 kiwis into 1-2cm pieces and put in a bowl with the sliced onion, brown sugar, green chilli, lime zest, ½ the lime juice and ½ the mint. Season and set aside."}, {"step": "For the marinade, put the cumin seeds in a dry frying pan over a medium heat to toast for a minute or so, shaking the pan occasionally, until fragrant and slightly darker. Tip into a blender or the small bowl of a food processor and add the remaining kiwi fruit, roughly chopped, along with the ginger and remaining lime juice and mint leaves. Blend until almost smooth, then transfer to a large, non-metallic bowl."}, {"step": "Either preheat the grill to medium or put a griddle pan over a high heat until smoking-hot. Add the prepared squid (including any tentacles) to the marinade, turning to coat; season. Remove from the marinade and drizzle with the oil. Don’t leave in the marinade or the kiwi will soften the squid too much."}, {"step": "If grilling, put on a baking tray and grill for 4-5 minutes, carefully turning over halfway. If cooking in a griddle pan, cook for 2 minutes on each side. Once cooked, the squid should be opaque, curled up attractively to show the scored pattern and charred in places. Serve the squid with the salsa, plus cooked rice and greens, if liked."}], "nutrition": {"Energy": "2,253kJ 534kcals", "Fat": "13g", "Saturated Fat": "2g", "Carbohydrate": "68g", "Sugars": "16g", "Protein": "32g", "Salt": "0.5g", "Fibre": "5.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/k/201029_004A_KiwiMarinatedSquid.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}