{"title": "Korean walnut & cinnamon stuffed pancakes", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6"}, "ingredients": [{"item": "1½ tbsp honey"}, {"item": "7g sachet active dried yeast"}, {"item": "200g plain flour, plus 50-75g extra for handling"}, {"item": "¾ tsp fine sea salt"}, {"item": "2 tsp vegetable oil, plus extra for frying"}, {"item": "Vanilla ice cream, to serve"}, {"item": "For the filling"}, {"item": "20g walnuts"}, {"item": "50g light or dark brown soft sugar"}, {"item": "1 tsp cinnamon, plus extra for dusting"}, {"item": "Large pinch fine sea salt"}], "instructions": [{"step": "Put the honey, yeast and 135ml warm water"}, {"step": "in a small bowl. Stir well to combine, then set aside for 10 minutes until frothy. Put 200g flour in a large mixing bowl with the salt. Slowly stir in the vegetable oil and yeast mixture, mixing together into a sticky, relatively wet dough. Cover and leave in a warm place for an hour, or until doubled in size. Once risen, knock the dough back with a spatula, then cover and leave to rise again for 30 minutes."}, {"step": "Meanwhile, preheat the oven to 180ºC, gas mark 4. Put the walnuts for the filling on a baking tray and lightly roast for 4-5 minutes, until golden. When cool enough to handle, chop them finely. Combine them with all the other filling ingredients in a bowl and set aside."}, {"step": "Add the remaining flour to the work surface in a neat layer. It may seem like a lot but it is needed to prevent sticking. Knock back the dough once again, then scrape it directly onto the flour. With floured hands, gently roll the dough so that all sides are coated with flour and no longer sticky. Shape the dough into a rough oblong shape, then, using a sharp knife dipped in flour, cut the dough in half, then cut each half into three pieces of equal size. Clean the knife after each cut so it does not stick. Roll the 6 pieces of dough in the flour to coat and prevent them from sticking."}, {"step": "Take one dough ball at a time and flatten it out in the palm of your hand, brushing off any excess flour. Add 1 tbsp of the filling to the centre, then pull the edges of the dough up and around the filling, sealing it at the top by pressing it together between your fingers, encasing the filling completely. Flour your fingers as you go to prevent sticking. Continue with the remaining dough and filling."}, {"step": "Put 1½ tbsp vegetable oil in a large nonstick frying pan and place over a medium heat. Add 2 or 3 balls of dough to the pan, leaving plenty of room around them. After 1 minute, or when the bottom is golden, flip over and gently but firmly flatten out the balls with a spatula. Fry for 2 minutes, until golden brown, then flip over again, reduce the heat to low and fry for a final 2 minutes."}, {"step": "Remove and keep warm, then continue to cook the remaining pancakes, using kitchen paper to wipe the pan as you go and adding more vegetable oil as needed. Serve the pancakes immediately with a ball of ice cream on top and a dusting of cinnamon."}], "nutrition": {"Energy": "1,608kJ 383kcals", "Fat": "15g", "Saturated Fat": "7.7g", "Carbohydrate": "53g", "Sugars": "28g", "Protein": "8.1g", "Salt": "0.8g", "Fibre": "2.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/k/Korean-&-Walnut-Pancakes_Serving_220222.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}