{"title": "Lamb keema pasties", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "1 tbsp sunflower oil, plus extra for brushing"}, {"item": "1 tsp cumin seeds"}, {"item": "1 large onion, finely chopped"}, {"item": "20g fresh root ginger, grated"}, {"item": "3 garlic cloves, grated"}, {"item": "2-3 green chillies, chopped"}, {"item": "½ tsp salt 1 tsp ground turmeric"}, {"item": "2 tsp garam masala"}, {"item": "½ x 28g pack coriander, finely chopped"}, {"item": "1 tbsp tomato purée"}, {"item": "500g lamb mince"}, {"item": "400g strong white bread flour"}, {"item": "1 tsp salt"}, {"item": "100g lard, cubed and chilled"}, {"item": "100g salted butter, cubed and chilled"}, {"item": "1 egg, beaten"}, {"item": "25g pack flat leaf parsley, finely chopped"}, {"item": "3 salad onions,finely chopped"}, {"item": "4 tsp pomegranate molasses"}, {"item": "1 lime, juice"}, {"item": "1 green chilli, chopped"}, {"item": "4 tsp olive oil"}, {"item": "1 tsp caster sugar"}], "instructions": [{"step": "For the pastry, put the flour and salt in a large bowl. Rub in the lard and butter until it resembles breadcrumbs (or pulse in a food processor). Add 140ml cold water, bring together and knead for 3 minutes. Wrap and chill for 1 hour."}, {"step": "Meanwhile, heat the oil in a frying pan, then add the cumin seeds. Once they start sizzling, add the onion and cook until translucent (5-6 minutes). Add the ginger, garlic and chillies; cook for 3 minutes. Stir in the salt, turmeric, garam masala, coriander and tomato purée. When the paste starts sticking, add  30ml water and cook for 1 minute more. Add the lamb mince to the paste and cook on a low heat, stirring occasionally, until browned (about 5 minutes). Check the seasoning, then remove from the heat and leave to cool (about 30 minutes)."}, {"step": "Preheat the oven to 190˚C, gas mark 5, and put a baking tray in to heat up. Cut the pastry into quarters and shape each into a disc. Roll out each disc to 20-22cm diameter then use an upturned side plate as a guide to trim into a neat circle. Put ¼ of the keema mixture on one half of each circle, leaving a 3-4cm border. Fold over the pastry; press to seal the edges. Crimp the sealed edge with small twists (see page 109 for a step-by-step guide) or a fork, then tuck the end under. Transfer to the hot baking tray and brush with the egg. Bake for 45 minutes, until golden. Meanwhile, combine all the ingredients for the parsley chutney with 2 tbsp water in a bowl. Let the pasties stand for 10 minutes then serve with the chutney."}], "nutrition": {"Energy": "5154 1,237", "Fat": "81g", "Saturated Fat": "38g", "Carbohydrate": "86g", "Sugars": "12g", "Protein": "37g", "Salt": "2.6g", "Fibre": "6.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/05-British-pasties.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}