{"title": "Lamb cutlets with polenta & herb dressing", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "4 lamb rack cutlets"}, {"item": "150g quick cook polenta"}, {"item": "50g Parmigiano Reggiano, grated"}, {"item": "25g butter, cubed"}, {"item": "2½ tbsp olive oil"}, {"item": "4 sage leaves, finely sliced"}, {"item": "1 sprig rosemary, needles only, finely sliced"}, {"item": "1 clove garlic, peeled and finely sliced"}, {"item": "2 anchovy fillets from a jar, drained and finely chopped"}, {"item": "1 small red chilli, deseeded and finely chopped"}, {"item": "3 tsp balsamic vinegar"}, {"item": "Large handful of rocket"}], "instructions": [{"step": "Preheat your grill to high. When it’s hot, season your cutlets, place them on to a tray and slide under the grill. Cook for about 4 minutes on each side (for medium), before turning the gas off and leaving in the warm grill compartment to rest until you are ready to eat."}, {"step": "While the lamb is cooking, prepare the polenta according to pack instructions. When thick and hot add the grated Parmigiano Reggiano and cubed butter and beat until worked in. Put aside."}, {"step": "Pour the olive oil into a small saucepan over a low heat. Add the sage, rosemary, garlic, anchovies and red chilli and warm the ingredients for about 5 minutes. Do not fry the ingredients, you just want to infuse the oil with all the flavours and lightly cook the garlic."}, {"step": "Take the saucepan off the heat, pour in the balsamic vinegar and stir into the oil – it won’t emulsify, but ensure the vinegar is evenly distributed."}, {"step": "Divide the polenta between two plates, lay the cutlets on top, drizzle with the herby dressing from the saucepan and finish with a handful of rocket."}], "nutrition": {"Energy": "3,230kJ 772kcals", "Fat": "39.1g", "Saturated Fat": "18.9g", "Carbohydrate": "61.8g", "Sugars": "2.3g", "Protein": "43.1g", "Salt": "1.3g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Lamb-cutlets-with-polenta-&-herb-dressing.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}