{"title": "Lamb hotpot", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT7½ hoursM", "total_time": null, "serves": "4"}, "ingredients": [{"item": "3 tbsp plain flour"}, {"item": "2 packs of 4 essential Waitrose Lamb Loin Chops or Shoulder Chops (from the service counter), trimmed of fat"}, {"item": "50 g butter"}, {"item": "2 onions, thinly sliced"}, {"item": "800g essential Waitrose Potatoes, peeled and thinly sliced (cover them with cold water)"}, {"item": "2 tbsp thyme leaves"}, {"item": "1 tbsp Worcestershire sauce"}, {"item": "500 ml Waitrose Cooks' Ingredients Lamb Stock"}], "instructions": [{"step": "Place the flour in a large freezer bag and season. Add the chops and shake to coat evenly.  Melt half the butter in a large frying pan over a high heat. Add the floured chops and cook for 3-4 minutes on each side, until well browned. Meanwhile, toss a third of the onions, potatoes and thyme together in the slow cooker and spread out to cover the base evenly. Transfer the meat to the slow cooker, together with any pan juices.  Scatter the remaining onion and thyme over the chops. Mix the Worcestershire sauce into the stock and pour over the top, then cover and cook on low for 6 hours or until the onions are softened.  Arrange the remaining potato slices on the top. Cover and cook on high for a further hour, or until the potatoes are tender. Ensure that your slow cooker dish can be removed from the base and that it is flameproof – check manufacturer’s instructions – then preheat the oven to 230°C, gas mark 8. Melt the remaining butter and use it to brush the potato slices. Remove the slow cooker dish from the base and place it in the oven. Cook for 30 minutes or until the potatoes are golden. Serve with green beans.  CONVENTIONAL COOKING Preheat the oven to 150C, gas mark 2. Follow steps 1-3, using a lightly greased 5 litre casserole dish with a tight-fitting lid instead of the slow cooker. At the end of step 3, cover with the lid and bake for 1½ hours. Melt the remaining butter, arrange the remaining potato slices over the onions, then brush them with the butter. Re-cover and cook for a further hour, or until the potatoes are tender. Increase the oven temperature to 230C, gas mark 8, remove the lid and cook for a further 30 minutes until the potatoes are golden."}], "nutrition": {"Energy": "3259.336kJ 779.0kcal", "Fat": "37.3g", "Saturated Fat": "18.2g", "Sugars": "6.6g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/200912Seas12.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}