{"title": "Lamb and Turnip Pie", "tags": null, "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT180M", "total_time": "PT3 - 3½ hours, plus coolingM", "serves": "4 - 6"}, "ingredients": [{"item": "1kg lamb neck fillet, cut into rough 2cm pieces"}, {"item": "2 tbsp plain flour"}, {"item": "3 tbsp vegetable oil"}, {"item": "2 onions, peeled and finely chopped"}, {"item": "2 rosemary sprigs"}, {"item": "600–800ml chicken or lamb stock"}, {"item": "400g turnips, peeled and cut into rough 2–3cm chunks"}, {"item": "250g puff pastry, rolled to about ½ cm thick"}, {"item": "1 egg, beaten"}], "instructions": [{"step": "Season the pieces of lamb and dust generously with the flour. Heat the vegetable oil in a heavy-bottomed saucepan and fry the pieces of lamb and onions together in batches, for 3–4 minutes each. Add the rosemary and 600ml stock, bring to the boil and simmer gently for 1½–2 hours until the lamb is soft and tender and the sauce is thick. If it is too thick, add a little more stock. Skim the stew occasionally and discard the fat. Cooking time may be a little longer – it is difficult to be exact with braising cuts. Add the turnips, cover with a lid and add more water if necessary to cover the turnips. Simmer for about 15 minutes until the turnips are cooked. Remove from the heat and season to taste. Leave to cool.  Preheat the oven to 200°C, gas mark 6. When the lamb mixture is cool, transfer it to a 1.5–2 litre pie dish. Cut out a pastry lid to fit the dish, allowing an extra 2cm all the way round. Brush the edges of the pastry with some of the egg and lay the pastry brushed-side down on the dish, pressing it on with a fork. Cut a 2–3cm slit in the centre to let the steam out, or for larger pies, place a pie funnel in the centre of the dish surrounded by the filling, then lay the pastry over it with the funnel poking through. Decorate with any scraps. Brush the top with the remaining egg. Bake for 40–45 minutes until golden."}], "nutrition": {"Energy": "2983.192kJ 713.0kcal", "Fat": "47.8g", "Saturated Fat": "17.9g", "Sugars": "7.2g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/0703054-r04.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}