{"title": "Lamb chops, pomegranate and feta", "tags": null, "planning": {"prep_time": "PT20 minutes, plus restingM", "cook_time": "PT10M", "total_time": "PT30 minutes, plus restingM", "serves": "2"}, "ingredients": [{"item": "1 pomegranate"}, {"item": "½ red onion, finely chopped"}, {"item": "1½ tbsp red wine vinegar"}, {"item": "handful walnuts, toasted and roughly chopped"}, {"item": "1¼ tsp ground cumin"}, {"item": "large handful mint leaves, shredded, plus a few whole leaves for scattering"}, {"item": "4 tbsp extra virgin olive oil"}, {"item": "4 lamb chops, at room temperature"}, {"item": "50g feta cheese"}], "instructions": [{"step": "Cut the pomegranate in half and hold one half, cut-side down, over a bowl. Using a wooden spoon, hit the outside until seeds start to fall into the bowl. When you’ve gathered all the seeds from one half, repeat with the other. Pick out any bits of pith."}, {"step": "Add the onion, vinegar and walnuts to the bowl. Stir in ¼ tsp ground cumin, the shredded mint leaves and 3 tbsp olive oil. Season, then put to one side to allow the flavours to mingle."}, {"step": "Rub the chops on all sides with 1 tbsp olive oil. Sprinkle with the remaining 1 tsp cumin; season. Heat a frying pan over a medium heat and add the chops so they are standing on their fat side, holding them upright with tongs if need be. Cook for 3-4 minutes, until the fat is crisp, then 2-3 minutes on each side. Remove from the pan and leave somewhere warm to rest for 5-6 minutes."}, {"step": "Arrange the chops on plates, sprinkling with any resting juices, then roughly crumble the feta over the top. Splash with the pomegranate dressing and a tiny trickle more olive oil, if liked. Scatter with the whole mint leaves before serving"}], "nutrition": {"Energy": "3,047kJ 734kcals", "Fat": "57.3g", "Saturated Fat": "15.7g", "Carbohydrate": "8.1g", "Sugars": "6.8g", "Protein": "46.4g", "Salt": "0.8g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/LambChopsPoemgranateAndFeta_200x200.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}