{"title": "Lamb & potato samosas", "tags": null, "planning": {"prep_time": "PT20 minutes + coolingM", "cook_time": null, "total_time": "PT30M", "serves": "12"}, "ingredients": [{"item": "250g essential Waitrose Potatoes, cut into 1cm cubes"}, {"item": "½ x 500g pack lamb mince"}, {"item": "1 red chilli, finely diced"}, {"item": "3cm piece ginger, grated"}, {"item": "1 tbsp medium curry powder"}, {"item": "100g frozen peas"}, {"item": "150g tub Fage Total Natural Yoghurt"}, {"item": "75g Sharwood’s Mango Chutney"}, {"item": "Oil, for deep frying"}, {"item": "For the samosa pastry"}, {"item": "250g plain flour"}, {"item": "½ tsp salt"}, {"item": "1 tbsp nigella seeds"}, {"item": "50g ghee, melted"}], "instructions": [{"step": "To make the filling, parboil the potatoes in boiling water for 4-5 minutes until just tender, then drain. Meanwhile, fry the mince in a medium frying pan to brown, add the chilli, ginger and curry powder and cook for 1 minute. Stir in the peas and potato cubes, then season and fry for 1-2 minutes. Allow to cool then divide into 12 equal portions."}, {"step": "While the filling is cooling, make the pastry. Mix the flour, salt and nigella seeds in a bowl. Stir in the melted ghee and gradually add approximately 100ml water, mixing with a round bladed knife until it forms a dough, don’t add too much water as you don’t want the dough to be sticky."}, {"step": "Mix together the yoghurt and mango chutney and chill until needed. When the filling has cooled, divide the pastry into 6 balls and roll one at a time on a floured surface into a 16cm circle. Cut the circle in half along the centre. Brush the cut edge of the semi circle with water and fold together to seal. Make it into a cone shape in your hand and spoon in one portion of filling, brush the pastry edges with water and seal to give a filled triangle. Repeat to give 12 samosas."}, {"step": "Heat the oil in a deep fat fryer or large saucepan to 190°C and cook the samosas 4 at a time for 5 minutes until golden, then drain on kitchen paper and serve hot or cold with the mango yoghurt."}], "nutrition": {"Energy": "1,007kJ 241kcals", "Fat": "12.4g", "Saturated Fat": "5.2g", "Carbohydrate": "23.9g", "Sugars": "4.6g", "Protein": "7.4g", "Salt": "0.5g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/default_waitrose_recipe.jpg"}