{"title": "Lamb Hotpots", "tags": null, "planning": {"prep_time": "PT55M", "cook_time": "PT2 hours 50 minutesM", "total_time": "PT3 hours 45 minutesM", "serves": "6-8"}, "ingredients": [{"item": "1.25kg British lamb neck fillet, trimmed of excess fat and sinew and cut into 3-4cm chunks"}, {"item": "1 tbsp vegetable oil"}, {"item": "4 onions, sliced"}, {"item": "60g unsalted butter"}, {"item": "3 carrots, cut into 2cm chunks"}, {"item": "3 tbsp plain flour"}, {"item": "4 bay leaves"}, {"item": "½ x 20g pack thyme, leaves picked, plus 6-8 extra sprigs"}, {"item": "6 lambs’ kidneys (optional) halved, white core removed, cut into 2 cm chunks and soaked in milk overnight"}, {"item": "500ml fresh chicken or lamb stock"}, {"item": "1.5kg maris piper or other floury potatoes, peeled and thinly sliced"}], "instructions": [{"step": "Pat the lamb chunks dry on kitchen paper, coat in the oil and season. Heat a large casserole or heavy-based pan over a medium-high heat and fry (in batches if necessary), turning until browned, for about 10-12 minutes; set aside."}, {"step": "Preheat the oven to 170°C, gas mark 3. Add the onions to the pan with a pinch of salt and cook over a medium heat for 5 minutes. Add 30g butter and cook gently for 10-15 minutes, until soft and starting to caramelise. Toss in the carrots, lamb and resting juices, flour, bay and thyme leaves and kidneys (if using). Cook, stirring, for 1-2 minutes, then pour in the stock. Bring to a boil, then simmer briskly for 5 minutes, scraping the base of the pan to incorporate any sticky bits. Season and set aside."}, {"step": "Cover the bases of your dishes (use earthenware pie dishes or foil containers) with a layer of sliced potato. Next, divide the lamb mixture between them and top with the remaining potato; you want at least a double layer on top of each. Melt the remaining 30g butter and brush over the potato."}, {"step": "Cover each dish tightly with foil and bake for 1 hour 30 minutes, until a small knife is easily inserted. Uncover, add a picked thyme sprig to each and cook for a final 45-55 minutes, until golden. Serve, with pickled beetroot or red cabbage and some steamed greens, if liked."}], "nutrition": {"Energy": "2,723kJ 651kcals", "Fat": "34g", "Saturated Fat": "16g", "Carbohydrate": "48g", "Sugars": "8.5g", "Protein": "38.2g", "Salt": "0.4g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Lamb-Hot-Pot-V1_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}