{"title": "Layered lemon cake with raspberries and cream", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT10M", "cook_time": "PT45M", "total_time": "PT55M", "serves": "10"}, "ingredients": [{"item": "100g unsalted butter, softened, plus extra for greasing"}, {"item": "150g Waitrose Golden Caster Sugar, plus 2 tbsp"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs, lightly beaten"}, {"item": "150g self-raising flour"}, {"item": "3 tbsp whole milk"}, {"item": "Finely grated zest of 2 lemons"}, {"item": "½ x 300ml tub essential Waitrose Whipping Cream"}, {"item": "250g fresh essential Waitrose British Raspberries"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line a 900g loaf tin with baking parchment. In a bowl, use an electric beater to cream together the butter and caster sugar for 3-4 minutes until pale and fluffy. Beat in the eggs, then sift in the flour and mix well to combine. Stir in the milk and lemon zest."}, {"step": "Spoon the mixture into the prepared loaf tin and bake for about"}, {"step": "minutes until a skewer inserted into the centre of the cake comes out clean. Carefully lift out of the tin and leave to cool on a wire rack."}, {"step": "When the cake is cooled completely, use a bread knife to cut it horizontally into 3 layers. Whisk together the whipping cream"}, {"step": "and 1 tbsp sugar."}, {"step": "Spread half of the cream between each of the layers and scatter with raspberries. Sprinkle the top of the cake with the remaining"}, {"step": "tbsp sugar and decorate with raspberries. Carefully slice and serve."}], "nutrition": {"Energy": "1,210kJ 289kcal", "Fat": "15.8g", "Saturated Fat": "9.6", "Carbohydrate": "33.1g", "Sugars": "22g", "Protein": "3.7g", "Salt": "0.2g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Layered lemon cake with raspberries and cream.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}