{"title": "Leek and parmesan tart", "tags": null, "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT80M", "total_time": "PT1 hour 40 minutes, plus coolingM", "serves": "10"}, "ingredients": [{"item": "plain flour, for dusting"}, {"item": "500g shortcrust pastry"}, {"item": "75g unsalted butter"}, {"item": "6 leeks, trimmed, finely sliced and rinsed"}, {"item": "½ tsp salt"}, {"item": "5 thyme sprigs, leaves"}, {"item": "3 tbsp dry white wine"}, {"item": "30g parmigiano reggiano"}, {"item": "300g double cream"}, {"item": "1 egg and 3 extra egg yolks"}], "instructions": [{"step": "On a lightly floured surface, roll out the pastry to the thickness of a £1 coin, large enough to line a deep, 23cm, loose-bottomed tart tin. Ease into the tin, then trim so it overhangs by 1cm. Prick with a fork, line with baking parchment and chill for 30 minutes."}, {"step": "Meanwhile, melt the butter in a large pan. Stir in the leeks, salt and thyme. Cover and cook over a gentle heat for 15-20 minutes, stirring occasionally, until soft. Add the wine and bubble, uncovered, for 5-10 minutes, until most of the liquid has evaporated; set aside."}, {"step": "Put a baking sheet in the oven; preheat to 180˚C, gas mark 4. Fill the case with baking beans, put on the baking sheet and bake for 20-25 minutes, until the sides are light golden. Remove the beans and parchment; bake for 10-15 minutes, until light golden. Remove from the oven and trim off the overhang with a sharp serrated knife; brush out any crumbs from the inside of the case."}, {"step": "Grate the parmesan into a bowl and beat in the cream, egg and yolks. Stir in the leeks and season. Pour into the case and bake for 35-40 minutes, until just set. Cool for 20 minutes, then carefully remove the tart ring. Eat warm or at room temperature."}], "nutrition": {"Energy": "1,910Kj 460Kcal", "Fat": "36.1g", "Saturated Fat": "22g", "Carbohydrate": "25.4g", "Sugars": "3.2g", "Protein": "8.4g", "Salt": "0.5g", "Fibre": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/LeekTart-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}