{"title": "Leek and roasted garlic soup", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT45M", "total_time": "PT1 hour 5 minutesM", "serves": "4"}, "ingredients": [{"item": "1 large garlic bulb"}, {"item": "1½ tbsp olive oil"}, {"item": "4 large leeks, thickly sliced"}, {"item": "1 medium baking potato, peeled and chopped into 2cm chunks"}, {"item": "1 litre fresh vegetable stock"}, {"item": "3 thyme sprigs"}, {"item": "2 tbsp extra virgin olive oil"}, {"item": "2 tsp lemon juice"}], "instructions": [{"step": "Preheat the oven to 190˚C, gas mark 5. Slice the top off the garlic bulb, to just expose the flesh within. Drizzle with tbsp olive oil, season with salt and wrap loosely in a foil parcel. Roast for 40 minutes. Meanwhile, soften the leeks in the remaining 1 tbsp olive oil in a large saucepan or casserole, stirring over a low heat for 5 minutes. Cover, turn the heat to very low and cook gently for 10 minutes more. Uncover and add the potato, stock and 1 thyme sprig. Bring to the boil and simmer for 25 minutes."}, {"step": "Reserve 4 large roasted garlic cloves. Squeeze the remainder into the soup, stirring well, and simmer for 5 minutes. Remove and discard the thyme sprig and blend the soup until completely smooth, either in the pan with a handheld blender, or in an upright blender. Season and loosen with a splash more water, if liked."}, {"step": "Squeeze the reserved roasted garlic flesh into a bowl and add the stripped leaves from the remaining 2 thyme sprigs. Add the extra virgin olive oil and lemon juice; season and beat with a fork to make the mixture as smooth as possible. Reheat the blended soup and divide between warmed serving bowls. Spoon the roasted garlic oil over and serve straight away."}], "nutrition": {"Energy": "920kJ 221kcals", "Fat": "13g", "Saturated Fat": "2g", "Carbohydrate": "18g", "Sugars": "6.2g", "Protein": "4.6g", "Salt": "0.1g", "Fibre": "6.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Leek-and-roasted-garlic-soup.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}