{"title": "Lemon and fennel risotto", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT50M", "total_time": "PT65M", "serves": "4"}, "ingredients": [{"item": "1 fennel bulb (about 330g)"}, {"item": "1.2 litres vegetable stock"}, {"item": "1 Sorrento lemon, zest and juice"}, {"item": "1 tbsp olive oil"}, {"item": "50g unsalted butter"}, {"item": "1 onion, finely chopped"}, {"item": "1 celery stick, trimmed and finely chopped"}, {"item": "350g arborio risotto rice"}, {"item": "150ml white wine"}, {"item": "60g pecorino, finely grated"}], "instructions": [{"step": "Trim the fennel, reserving the fronds, then halve. Finely chop one half. Shave the other half into thin strips with a vegetable peeler; put in a bowl of iced water and set aside. Put the stock in a pan with most of the zest; bring to the boil, then reduce to a very low heat. Put a large pan on a medium-low heat; add the oil and 25g butter. Stir in the chopped fennel, onion and celery; fry for 15 minutes, until translucent (reduce the heat if browning)."}, {"step": "Add the rice to the vegetables, stir for 2 minutes, then add the wine and turn the heat up a little. Keep stirring until it’s almost absorbed, then slowly add the hot stock, a ladle at a time, stirring until absorbed before adding the next. It will take 25-30 minutes for the stock to be absorbed and the rice to be cooked, but still with a little bite (if you run out of stock, use boiling water). Season, add most of the lemon juice, the remaining 25g butter and the pecorino. Stir, cover with a lid and leave to stand for 2 minutes."}, {"step": "Meanwhile, drain the shaved fennel, dress with the remaining lemon juice and season. Serve the risotto with the shaved fennel on top, scattered with the remaining lemon zest, reserved fennel fronds and a little extra pecorino, if liked"}], "nutrition": {"Energy": "2,413kJ 575kcals", "Fat": "20g", "Saturated Fat": "10g", "Carbohydrate": "76g", "Sugars": "7.2g", "Protein": "13g", "Salt": "0.6g", "Fibre": "6.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/20201215_JBWaitroseMag_March2021_Harvest_Recipe_LemonFennelAndPecorinoRisotto.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}