{"title": "Lemon meringue cupcakes", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30M", "cook_time": "PT25M", "total_time": "PT55M", "serves": null}, "ingredients": [{"item": "100g unsalted butter, very soft"}, {"item": "200g caster sugar"}, {"item": "240g plain flour"}, {"item": "1 tbsp baking powder"}, {"item": "¼ tsp fine sea salt"}, {"item": "Grated zest of 1 lemon"}, {"item": "2 medium Waitrose Free Range Eggs"}, {"item": "240ml whole milk"}, {"item": "100g lemon curd"}, {"item": "200g caster sugar"}, {"item": "4 medium Waitrose Free Range Egg whites"}, {"item": "¼ tsp cream of tartar"}], "instructions": [{"step": "Preheat oven 200ºC, gas mark 6. Line a 12-hole muffin tin with muffin cases. Beat the soft butter, caster sugar, plain flour, baking powder, salt and lemon zest together with an electric handheld whisk or stand alone mixer, until the ingredients are well incorporated and have the texture of fine breadcrumbs."}, {"step": "Mix the eggs with the milk and slowly add to the butter mixture, continuing to beat until smooth."}, {"step": "Divide the batter between the cases (about three quarters full). Bake for approximately 25 minutes or until risen, pale golden and springy to the touch. Leave to cool slightly before removing from the tin and placing on a wire rack to cool completely before topping."}, {"step": "To make the topping: put the sugar and 150ml water into a small saucepan and bring to the boil over a medium heat. In a stand mixer or using a hand held electric mixer, whisk the egg whites with the cream of tartar until just foamy. When the sugar syrup has boiled for about 5 minutes and reached a soft ball stage (115ºC on a sugar thermometer), turn the mixer onto a medium speed and pour the sugar syrup slowly onto the eggs whites."}, {"step": "When all the sugar has been added, turn the mixer on to a high speed and whisk until the meringue has quadrupled in size and is very smooth and shiny. Using a small knife cut a 2cm plug out of the centre of the cakes, fill each hole with 1 tsp of lemon curd and then replace the cake that was taken out."}, {"step": "Top each cake with a big spoonful of the meringue, giving it texture with a small palette knife. Use a kitchen blowtorch to lightly brown the meringue or pop them under a hot grill for a few seconds. Serve with afternoon tea."}], "nutrition": {"Energy": "1414.192kJ 338kcals", "Fat": "9.9g", "Saturated Fat": "5.8g", "Carbohydrate": "57g", "Sugars": "41.2g", "Salt": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/2013wked-July-r5c.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}