{"title": "Lemon meringue pie", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus chillingM", "cook_time": "PT55M", "total_time": "PT1 hour 15 minutes, plus chilling M", "serves": "6"}, "ingredients": [{"item": "Plain flour, for dusting"}, {"item": "250g Cooks’ Ingredients Shortcrust Pastry, thawed"}, {"item": "Finely grated zest and juice of 2 unwaxed lemons"}, {"item": "175g caster sugar"}, {"item": "5 tbsp cornflour"}, {"item": "3 medium Waitrose Columbian Blacktail Free Range Eggs, separated"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. On a lightly floured work surface, roll out the pastry to the thickness of a £1 coin and use to line a 20cm-diameter shallow loosebottomed tin. Prick the bottom with a fork, line with greaseproof paper and fill with baking beans. Chill for 30 minutes."}, {"step": "Place the pastry in the centre of the oven and bake for 15 minutes. Remove the paper and beans and continue to bake for a further 5-10 minutes, or until the pastry has become dry but not coloured. Remove from the oven and allow to cool completely."}, {"step": "Reduce the temperature to 150°C, gas mark 2. Place the lemon zest and juice plus 100g of the sugar into a pan with 300ml cold water and gently heat, stirring until the sugar dissolves."}, {"step": "Mix the cornflour to a smooth paste with 6 tbsp cold water, then stir into the lemon mixture and combine well. Increase the heat, bring to the boil and cook for about 1 minute, stirring continuously, until smooth and thickened."}, {"step": "Allow to cool slightly then beat in the egg yolks, one at a time. Pour the warm filling into the cooked pastry case and level the surface."}, {"step": "In a large bowl, whisk the egg whites until stiff peaks form, then gradually whisk in the remaining sugar, a tablespoon at a time, until thick and glossy. Spoon the meringue over the filling and spread out evenly with a spatula or palette knife to cover, but leave the rim of the pastry case uncovered. Flick or swirl the surface of the meringue with the spatula or palette knife to give a textured finish."}, {"step": "Bake for 35 minutes until the meringue is golden and crisp. Serve just warm if you prefer the filling to have a soft-flowing consistency, or cold for a set filling. The pie should be eaten on the day it is made."}], "nutrition": {"Energy": "1727.992kJ 413kcals", "Fat": "13.5g", "Saturated Fat": "7.5g", "Carbohydrate": "65.7g", "Sugars": "31.4g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/09_Lemon_Meringue_Pie_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}