{"title": "Lemon posset with rhubarb and shortbread", "tags": null, "planning": {"prep_time": "PT40 minutes, plus chillingM", "cook_time": null, "total_time": "PT1 hour 20 minutes, plus chillingM", "serves": "6"}, "ingredients": [{"item": "600ml double cream"}, {"item": "120g caster sugar"}, {"item": "2 lemons, zest and juice"}, {"item": "90g unsalted butter, just softened"}, {"item": "30g caster sugar, plus 1 tbsp for dredging"}, {"item": "100g plain flour"}, {"item": "30g rice flour"}, {"item": "200g rhubarb, cut into 3cm pieces"}, {"item": "50g caster sugar"}], "instructions": [{"step": "Put the cream, sugar and lemon zest into a pan. Heat gently until the sugar has dissolved, then bring to a boil and simmer for 3 minutes. Remove from the heat and stir in the lemon juice. Allow to cool , then sieve into 6 teacups or ramekins. Chill for 4-6 hours or overnight."}, {"step": "For the shortbread, beat the butter and sugar together with a wooden spoon until combined. Next, beat in the flours and a pinch of salt. If it doesn't come together with the spoon, use your hands to knead very lightly. Roll out the dough between two pieces of baking parchment or clingfilm, then trim to a rectangle roughly 20cm x 40cm. Cut in half lengthways, then cut into 12 fingers. Transfer to a parchment-lined baking sheet and chill for 30 minutes."}, {"step": "Meanwhile, make the poached rhubarb. Put the rhubarb and sugar into a small pan and heat over a medium-low heat. Once the sugar has dissolved, simmer gently for 6-8 minutes until the rhubarb is tender. Strain, reserving the juices to the pan and simmer for 5 minutes until syrupy. Pour over the rhubarb and set aside to cool."}, {"step": "Preheat the oven to 160°C, gas mark 1. Bake for 30 minutes until just golden. Remove the shortbread from the oven and dredge with 1 tbsp sugar. Carefully transfer to a wire rack to cool."}, {"step": "Serve the possets with the rhubarb spooned over the top and the shortbread on the side."}], "nutrition": {"Energy": "- 785Kcal", "Fat": "60.2g", "Saturated Fat": "37.8g", "Carbohydrate": "56.7g", "Sugars": "40g", "Protein": "4g", "Salt": "0.1g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Waitrose_Easter_054_200x200.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}