{"title": "Lemon, thyme & courgette cake", "tags": null, "planning": {"prep_time": "PT20 minutes + coolingM", "cook_time": "PT30M", "total_time": "PT45 to 50 minutes + coolingM", "serves": "6 - 8"}, "ingredients": [{"item": "250g butter, softened, plus extra for greasing"}, {"item": "1 medium (approx 200g) courgette, coarsely grated"}, {"item": "200g caster sugar"}, {"item": "1 tbsp lemon thyme leaves, finely chopped"}, {"item": "Finely grated zest and juice of 1½ lemons"}, {"item": "200g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "3 British Blacktail Large Free Range Eggs"}, {"item": "150g mascarpone cheese"}, {"item": "25g icing sugar, plus extra for dusting"}, {"item": "2 tbsp (approx 30ml) milk or single cream"}, {"item": "100g lemon curd"}, {"item": "Raspberries, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Butter 2 x 20cm deep cake tins and line with baking parchment. Wrap the courgette in a clean tea towel and squeeze to remove any excess moisture. Set aside."}, {"step": "Using a stand mixer (or electric hand whisk), cream together the butter, sugar, lemon thyme leaves and lemon zest for at least 5 minutes, or until very pale and fluffy. Meanwhile, sieve the flour and baking powder together and set aside. Gradually mix the eggs, one at a time, into the butter mix, along with 1 tbsp of the flour, until combined, then add the remainder of the flour. Add the lemon juice to loosen the mixture to a dropping consistency, then stir through the courgettes."}, {"step": "Divide the mixture between the prepared tins and smooth with a spatula. Bake in the oven for around 25-30 minutes until well risen, golden and slightly shrunken away from the sides. Leave in the tins for 1 minute, then turn out onto a wire rack to cool."}, {"step": "Mix the mascarpone with the icing sugar, then loosen to a spreadable consistency with milk or single cream. Spread on one of the cakes, then spread over the lemon curd. Place the remaining cake on top, then dust with icing sugar. Serve on the day it is made. Delicious with a few raspberries."}], "nutrition": {"Energy": "2,550kJ 612kcals", "Fat": "39g", "Saturated Fat": "24g", "Carbohydrate": "56g", "Sugars": "37g", "Protein": "7.8g", "Salt": "1g", "Fibre": "2.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/LEMONTHYME-COURGETTE-CAKE_186908.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}