{"title": "Lemon cake & mango chicks", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes + coolingM", "cook_time": "PT12M", "total_time": "PT32 minutes + coolingM", "serves": "6"}, "ingredients": [{"item": "6 large Waitrose British Blacktail Eggs"}, {"item": "Vegetable oil, for greasing"}, {"item": "50g butter, softened"}, {"item": "50g self-raising flour"}, {"item": "50g caster sugar"}, {"item": "¼ tsp baking powder"}, {"item": "1 tsp milk"}, {"item": "Finely grated zest of 1 unwaxed lemon"}, {"item": "125g Waitrose Apricot Preserve, warmed"}, {"item": "150g granulated sugar"}, {"item": "2-3 drops natural yellow food colouring"}, {"item": "About ¼ x 150g pack Waitrose Duchy Dried Mango"}, {"item": "Cooks’ Homebaking White Fondant Icing"}, {"item": "Black fondant icing (from a 5x100g pack of Dr. Oetker Regal-Ice Ready To Roll Coloured Icing)"}], "instructions": [{"step": "With a skewer make a hole in the larger end of each egg then cut into a 1cm-wide hole. Tip 1 egg into a bowl and reserve. Pour all the remaining eggs into a large bowl, chill and use for another recipe. Rinse all 6 egg shells with water and drain well."}, {"step": "Preheat the oven to 180°C, gas mark 4. Tip a little oil into the shell, shake to grease inside the shell, drain well and repeat for all the shells. Loosely scrunch 6 pieces of foil into the holes of a muffin tin and nestle the shells into them so they stay upright. In a bowl mix the butter, flour and sugar with the 1 egg, baking powder and milk until smooth. Add the lemon zest. Spoon into a piping bag then pipe into the shells until each is three-quarters full."}, {"step": "Bake for 15-17 minutes or until a skewer inserted into the centre comes out clean. Leave to cool completely then peel off the shell and trim any excess cake, if needed to shape."}, {"step": "Mix the sugar with the yellow food colouring. Brush the sieved jam over the cakes then roll each in the sugar to coat. Cut 12 triangular pieces of mango for feet, 12 pieces for little wings and 12 little triangles to make beaks. Using the preserve as glue, stick the mango onto each chick, cutting little slits in the cake to push in the mango if necessary. Make 12 tiny balls of white fondant, and 12 slightly smaller black ones and use for the eyes."}], "nutrition": {"Energy": "1,439kJ 341kcals", "Fat": "8.2g", "Saturated Fat": "4.7g", "Carbohydrate": "64.2g", "Sugars": "57.9g", "Protein": "2.6g", "Salt": "0.3g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/20_LemonCakeMangoChicks_024.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}