{"title": "Lemon simnel cupcakes", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT20 minutes + coolingM", "total_time": "PT40 minutes + coolingM", "serves": "12"}, "ingredients": [{"item": "500g pack Waitrose Cooks' Homebaking Golden Marzipan"}, {"item": "150g Tate + Lyle Light Muscovado Sugar"}, {"item": "150g essential Waitrose Unsalted Dairy Butter, at room temperature"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "150g self-raising flour"}, {"item": "125g essential Waitrose Mixed Fruit"}, {"item": "2 lemons, both zested and juice of 1"}, {"item": "Icing sugar to dust"}, {"item": "2 tbsp apricot jam"}], "instructions": [{"step": "Preheat the oven to 180ºC, gas mark 4 and line a 12-hole muffin tin with muffin cases. Cut off an 80g piece of marzipan, then set aside the larger piece for later. Cut the smaller piece into 12 equal chunks."}, {"step": "Place the sugar and butter in a large mixing bowl and beat together until pale and creamy. Add the eggs, one at a time, scraping the bowl down after each addition. Fold in the flour along with the mixed fruit, lemon juice and half the zest. Add a spoonful of mixture to each case, place a chunk of marzipan in the centre, then top each evenly with the rest of the mixture. Bake in the oven for 15–20 minutes, until risen and golden, then allow to cool on a wire rack."}, {"step": "Sprinkle a little icing sugar on the work surface and roll out the remaining marzipan. Using a small cookie cutter (about 6cm) cut out 12 circles, saving the leftover marzipan."}, {"step": "To decorate the cupcakes, take off the paper cases. Brush on a little apricot jam then place on the circles of marzipan. Shape the leftover marzipan into 12 balls, then place one in the centre of each cupcake, using some jam to help secure if necessary. Place them on a baking tray and pop under a hot grill for 1 minute until the marzipan is lightly browned. Finish with a small sprinkling of lemon zest."}], "nutrition": {"Energy": "1,769kJ 421kcals", "Fat": "17.4g", "Saturated Fat": "7.6g", "Carbohydrate": "60.8g", "Sugars": "51.5g", "Protein": "5.4g", "Salt": "0.2g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/032016-recipe-card-Lemon-simnel-cupcakes-.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}