{"title": "Lemon & poppy seed cake with raspberry topping", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "12"}, "ingredients": [{"item": "200g unsalted butter, softened, plus extra for greasing"}, {"item": "200g plain flour"}, {"item": "100g ground almonds"}, {"item": "2 tsp baking powder"}, {"item": "½ tsp fi ne salt"}, {"item": "3 tbsp poppy seeds"}, {"item": "250g golden caster sugar"}, {"item": "3 medium British Blacktail Free Range Eggs"}, {"item": "3 Cooks’ Ingredients Unwaxed Lemons, zest and juice of all"}, {"item": "3 tbsp whole milk, warmed"}, {"item": "1 heaped tbsp Cooks’ Ingredients Freeze Dried Raspberries"}, {"item": "1 tbsp granulated sugar"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Lightly grease and line a 23cm springform cake tin and line with baking parchment. In a bowl, mix together the flour, almonds, baking powder, salt and poppy seeds; set aside."}, {"step": "In a large mixing bowl, beat the butter and sugar with electric beaters for 2-3 minutes until light. Beat in the eggs one at a time, then the lemon zest and milk. Use a spatula to stir in the flour mixture until combined, then stir in the juice of 1 lemon. Tip into the tin; bake for 45 minutes, until golden and a skewer inserted in the centre comes out clean. Don’t open the oven door until the cake has had its full cooking time as the delicate batter might sink a little."}, {"step": "Meanwhile, in a small blender or food processor, very briefly pulse or whizz the raspberries and granulated sugar.Once cooked, cool the cake in the tin for 10 minutes then remove and transfer to a cooling rack. Brush all over with the remaining lemon juice, then dust with the raspberry sugar. Serve once the cake reaches room temperature."}], "nutrition": {"Energy": "1,519kJ 364kcals", "Fat": "21g", "Saturated Fat": "9.7g", "Carbohydrate": "36g", "Sugars": "23g", "Protein": "6.3g", "Salt": "0.49g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Waitrose_RC_May2020_6074.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}