{"title": "Lemon & pistachio cake", "tags": null, "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT40M", "total_time": "PT1 hour 15 minutesM", "serves": "10"}, "ingredients": [{"item": "For the marzipan"}, {"item": "100g LOVE Life Pistachios"}, {"item": "50g ground almonds"}, {"item": "75g golden caster sugar"}, {"item": "75g icing sugar"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg white, lightly beaten"}, {"item": "For the cake"}, {"item": "175g slightly salted butter, softened, plus extra for greasing"}, {"item": "175g golden caster sugar"}, {"item": "Finely grated zest 2 lemons, plus 3 tbsp juice"}, {"item": "3 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "225g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "For the butter icing"}, {"item": "75g slightly salted butter, softened"}, {"item": "75g icing sugar, plus extra for dusting"}, {"item": "1 tbsp lemon juice"}, {"item": "Chopped pistachios, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and base line 2 x 20cm sandwich tins. To make the marzipan, put the pistachios in a food processor and blitz until finely ground. Add the almonds, caster sugar, icing sugar and the egg white and blend to a paste."}, {"step": "For the cake, put the butter, sugar, lemon zest, eggs, flour and baking powder in a bowl and beat with an electric whisk until pale and creamy. Beat in the lemon juice and spoon a quarter of the mixture into each of the tins. Level the surface. Halve the pistachio marzipan and roll out each piece on a surface dusted with icing sugar until slightly smaller than the tins. Press gently over the filling in each tin and cover with the remaining mixture."}, {"step": "Bake for 35–40 minutes or until risen and just firm to the touch. Loosen the edges of the cakes with a knife and transfer to a wire rack to cool."}, {"step": "For the butter icing, beat the butter with the icing sugar until light and fluffy then beat in the lemon juice. Use to sandwich the cakes together on a serving plate. Dust the top lightly with icing sugar and scatter with chopped pistachios to decorate."}], "nutrition": {"Energy": "2,353kj 563kcals", "Fat": "31.9g", "Saturated Fat": "14.8g", "Carbohydrate": "61.2g", "Sugars": "43.7g", "Protein": "7.8g", "Salt": "0.7g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/TV/PistachioCake_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}