{"title": "Lemon cheesecake with summer berries", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus cooling and chillingM", "cook_time": "PT1 hour 35 minutesM", "total_time": "PT1 hour 55 minutes, plus cooling and chillingM", "serves": "12"}, "ingredients": [{"item": "150g ginger nuts, crushed"}, {"item": "50g ground almonds"}, {"item": "50g salted butter, melted"}, {"item": "250g golden caster sugar, plus 1 tbsp extra"}, {"item": "1 tbsp cornflour"}, {"item": "900g soft cheese"}, {"item": "4 eggs"}, {"item": "2 tsp vanilla extract"}, {"item": "2 lemons, zest and 3 tbsp juice"}, {"item": "300ml soured cream"}, {"item": "400g mixed berries"}, {"item": "3 tbsp lemon curd"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. Line the base and sides of a 23cm springform cake tin with baking parchment and sit on a baking tray. Combine the ginger nuts, ground almonds and butter in a bowl, then press into the base of the tin. Bake for 15 minutes, until just crisp on top; set aside."}, {"step": "Combine the sugar and cornflour in a large mixing bowl. Using electric beaters or a wooden spoon, beat in the soft cheese. Thoroughly beat in the eggs, one at a time, followed by the vanilla, lemon zest, 2 tbsp lemon juice and the soured cream, mixing until just smooth. Pour into the tin and bake on the middle shelf of the oven for 1 hour 20 minutes or until just set."}, {"step": "Turn the oven off and prop the door open slightly. Leave the cheesecake in the oven for an hour, then remove and leave to cool completely. Chill in the fridge for at least 4 hours or overnight."}, {"step": "Cut up any large strawberries, then toss the berries with 1 tbsp lemon juice and 1 tbsp sugar. Set aside for 5 minutes. Meanwhile, remove the cheesecake from the tin and top with the lemon curd. Spoon over the berries just before serving."}], "nutrition": {"Energy": "2,126kJ 510kcals", "Fat": "33.6g", "Saturated Fat": "18.9g", "Carbohydrate": "42.6g", "Sugars": "35.7g", "Protein": "9.3g", "Salt": "0.8g", "Fibre": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Lemon-cheesecake-with-summer-berries.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}