{"title": "Lobster Thermidor", "tags": null, "planning": {"prep_time": "PT50 minutes, plus cooling and chillingM", "cook_time": "PT30M", "total_time": "PT1 hour 20 minutes plus cooling and chillingM", "serves": "2"}, "ingredients": [{"item": "3 tbsp unsalted butter"}, {"item": "2 shallots, finely sliced"}, {"item": "small bunch tarragon, plus 6 extra sprigs"}, {"item": "300ml fresh fish stock"}, {"item": "1 tbsp plain flour"}, {"item": "150ml whole milk"}, {"item": "3 tbsp double cream"}, {"item": "2 egg yolks"}, {"item": "½ whole nutmeg, freshly grated"}, {"item": "2 tbsp English mustard"}, {"item": "2 x frozen Canadian cooked lobsters, defrosted"}, {"item": "4 tbsp cognac (or other brandy)"}, {"item": "2 handfuls coarsely grated gruyère cheese (about 50g)"}], "instructions": [{"step": "Heat 1 tbsp butter in a saucepan. Once foaming, add the shallots and bunch of tarragon; fry over a medium heat for 3-4 minutes, until starting to soften. Pour in the stock and boil for 10-12 minutes, until reduced to 2-3 tbsp."}, {"step": "Meanwhile, make the white sauce. Heat 1 tbsp butter in another pan set over a medium heat and, once foaming, stir in the flour. Cook for 1-2 minutes, until lightly golden. Take off the heat and gradually add the milk, stirring after each addition until smooth. Return to a low-medium heat, stirring, for 5-7 minutes, until you have a thick sauce."}, {"step": "Strain the reduced fish stock into the sauce, add the cream and season. Cook for 3-4 minutes more, stirring until thickened again. Transfer to a bowl, cool for a few minutes, then stir in the egg yolks, nutmeg and mustard. Cover the surface with cling film and set aside."}, {"step": "Prepare the lobsters (see page 89 for our step-by-step guide) and chop the claw and tail meat. Heat the final 1 tbsp butter in a frying pan set over a high heat. Once foaming, stir in the lobster meat, any juices and the roe and green tomalley, if using. Fry for a few minutes, then splash in the brandy and boil or flambé until the alcohol has evaporated. Set aside to cool for a few minutes. Pick and chop the leaves from the 6 tarragon sprigs, then stir into the white sauce with the lobster."}, {"step": "Divide the mixture between the lobster shells and place on a baking tray (cover with cling film and chill if making ahead, up to 24 hours in advance)."}, {"step": "To serve, preheat the grill to high and scatter the cheese over the prepared lobsters. Grill for 4-5 minutes, until piping hot and golden."}], "nutrition": {"Energy": "2,895kJ 697kcals", "Fat": "52.7g", "Saturated Fat": "29.7g", "Carbohydrate": "16.6g", "Sugars": "8g", "Protein": "39g", "Salt": "3.8g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/Lobster-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}