{"title": "Fragrant beef noodle soup", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT15M", "total_time": "PT30M", "serves": "2"}, "ingredients": [{"item": "100g Thai Taste Rice Noodles"}, {"item": "2 x Kallo Organic Very Low Salt Beef Stock Cubes"}, {"item": "1 small onion, finely chopped"}, {"item": "3cm piece root ginger, peeled and thickly sliced"}, {"item": "1 red chilli, seeded and thinly sliced"}, {"item": "1 cinnamon stick"}, {"item": "1 star anise"}, {"item": "230g frying steak, trimmed of any visible fat"}, {"item": "½ x 300g pack beansprouts"}, {"item": "235g pack Waitrose Green Pak Choi, thickly sliced"}, {"item": "2 tbsp fresh coriander leaves"}, {"item": "1 lime, cut into wedges, to serve"}], "instructions": [{"step": "Place the noodles in a large bowl, cover with a kettleful of boiling water and leave to soak for 15 minutes, stirring once or twice to make sure the noodles don’t stick together."}, {"step": "While the noodles are soaking, place the stock cubes, onion, ginger, chilli, cinnamon, star anise and 750ml boiling water in a large pan and bring back to the boil. Simmer for 10 minutes."}, {"step": "Meanwhile, cook the steak in a non-stick frying or griddle pan for 2–3 minutes on each side, until nicely browned but still a little pink in the centre. Transfer to a plate, let it rest for 5 minutes, then slice thinly."}, {"step": "Stir the beansprouts and pak choi into the broth and cook for 2 minutes or so until the vegetables are tender."}, {"step": "Drain the noodles and divide between 2 bowls. Ladle over the broth and vegetables then top with the sliced beef and coriander. Serve with lime wedges for squeezing over."}], "nutrition": {"Energy": "1995.768kJ 477kcals", "Fat": "16.9g", "Saturated Fat": "5.9g", "Carbohydrate": "51.4g", "Sugars": "6.7g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/2013wkwe-September-r1beefsoup.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}