{"title": "Spanakopita", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6"}, "ingredients": [{"item": "900g essential Waitrose Spinach"}, {"item": "250g pack essential Waitrose Ricotta"}, {"item": "2 medium eggs, beaten"}, {"item": "20g pack Cooks' Ingredients Dill Leaves, chopped"}, {"item": "Bunch salad onions, finely chopped"}, {"item": "100g essential Waitrose Greek Light Salad Cheese, crumbled"}, {"item": "3 sheets Jus-Rol Filo Pastry"}, {"item": "1 tbsp olive oil"}, {"item": "145g bag Waitrose Continental Salad, to serve"}, {"item": "40g Greek Kalamata olives, to serve"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Wash the spinach well, then place in a large saucepan. Cover with a lid and cook for 2-3 minutes until wilted (do this in batches if your pan isn't big enough to fit all the spinach in one go)."}, {"step": "Cool the cooked spinach under running water, then drain thoroughly. Squeeze to get rid of any excess liquid, then chop roughly."}, {"step": "In a large bowl, mix together the ricotta and eggs, then stir in the spinach, dill and salad onions."}, {"step": "Spoon half the mixture into an ovenproof pie dish, measuring 20cm x 30cm, then scatter over the cheese in an even layer. Top with the remaining spinach mixture."}, {"step": "Lay a sheet of pastry on the work surface and brush lightly with oil. Top with a second and third layer of pastry, brushing the top of each with oil. Place the pastry over the spinach mixture. Trim any excess and tuck in the edges. Using a sharp knife, score lightly in a crisscross pattern."}, {"step": "Bake for 40-45 minutes until golden brown and cooked through. Slice and serve with the salad and scattered olives."}], "nutrition": {"Energy": "1133.864kJ 271kcals", "Fat": "15.3g", "Saturated Fat": "6g", "Carbohydrate": "17.1g", "Sugars": "5.3g", "Salt": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/l/LOVELLIFE162_Spanakopita400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}