{"title": "Mango, cardamon & white chocolate bread", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes + provingM", "cook_time": "PT25-30 minutesM", "total_time": "PT1 hour +M", "serves": "1 large loaf"}, "ingredients": [{"item": "450g strong white bread flour, sifted, plus extra for kneading and shaping"}, {"item": "7g sachet easy-bake yeast"}, {"item": "50g golden caster sugar"}, {"item": "Seeds from 10 green cardamom pods, ground to make ½ tsp"}, {"item": "50g unsalted butter"}, {"item": "250ml semi-skimmed milk"}, {"item": "1 large Waitrose British Blacktail Free Range Egg"}, {"item": "1 tsp vanilla bean paste"}, {"item": "150g pack Cooks’ Homebaking White Chocolate"}, {"item": "225g prepared mango cubes"}, {"item": "Seeds from 10 green cardamom pods, ground to make ½ tsp"}, {"item": "2 tbsp golden caster sugar"}, {"item": "1 tbsp apricot jam"}, {"item": "1 tbsp shelled pistachios, sliced into slivers"}], "instructions": [{"step": "Mix the flour, yeast, sugar, cardamom and ½ tsp salt in a large bowl. Melt the butter in a small pan, add the milk and warm to room temperature. Beat in the egg and vanilla paste with a fork. Stir this into the flour mix to make a rough, sticky dough then set aside for 10 minutes."}, {"step": "Knead the dough on a floured surface for 5-10 minutes until smooth and elastic, then leave to rise in an oiled bowl covered loosely with oiled clingfilm for 1 hour, or until doubled in size."}, {"step": "Meanwhile, prepare the filling. Chop the chocolate and mango into 1cm chunks. Mix the cardamom with the sugar. Line a large baking sheet with baking parchment."}, {"step": "Flour the work surface generously, then turn the dough out from the bowl. Dust it with more flour then, without any kneading, roll the dough to a 30 x 60cm rectangle. Scatter with the fruit, chocolate and cardamom sugar, then roll up into a long sausage. Flatten a little to seal, then cut in half lengthways, keeping one end joined. Twist the 2 ropes of dough together, lift onto the baking sheet then press the ends together to make a ring. If you lose any chocolate or mango along the way, just poke it back in. Cover loosely again and leave to prove in a warm place for 30 minutes. Preheat the oven to 200°C, gas mark 6."}, {"step": "Bake the bread for 25-30 minutes or until golden and risen. It will sound hollow when tapped underneath. Warm the jam with a splash of water, then brush it over the warm bread to glaze. Scatter with pistachios and slice to serve."}], "nutrition": {"Energy": "130kJ 309kcal", "Fat": "9.7g", "Saturated Fat": "5.2g", "Carbohydrate": "48.1g", "Sugars": "20.2g", "Protein": "7.3g", "Salt": "0.3g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Mango, cardamom & white chocolate Easter bread.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}