{"title": "Mango and cardamom kulfi pops with pistachios", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT15 minutes, plus infusing, chilling and freezingM", "cook_time": "PT5M", "total_time": "PT20 minutes, plus infusing, chilling and freezingM", "serves": "6 x 100ml lollies"}, "ingredients": [{"item": "125ml whole milk"}, {"item": "200g sweetened condensed milk"}, {"item": "4 whole green cardamom pods, lightly crushed (make sure the seeds are also crushed slightly)"}, {"item": "1 small, very ripe and fragrant mango (about 175g flesh)"}, {"item": "150ml double cream, whipped to soft peaks"}, {"item": "100g shelled unsalted pistachios"}], "instructions": [{"step": "In a saucepan, gently simmer the whole milk, condensed milk and crushed cardamom pods for 2 minutes. Set aside to cool completely, then strain to remove the cardamom and chill for at least 1 hour."}, {"step": "To prepare the mango, cut the cheeks off either side of the stone and scoop out the flesh. Remove any remaining flesh from around the stone.  In a food processor (or using a stick blender), purée the fruit until smooth, then stir into the chilled milks. Fold in  the lightly whipped double cream until everything is combined."}, {"step": "Divide the kulfi mixture between 6 x 100ml lollymoulds (or use paper party cups) and place wooden sticks in the centre, if using. If the sticks don’t stand up at this point, freeze for 1 hour before adding them. Freeze for at least  3 hours, until solid."}, {"step": "Finely chop the pistachios, making sure they still have some texture; you don’t want a powder. Run the lollymoulds under hot water for a few seconds to loosen (or peel away the paper cups), then roll and coat each kulfi pop in the nuts. Eat immediately or freeze again in sandwich bags if needed; they’ll lose their fresh flavour if kept for much longer than a week."}], "nutrition": {"Energy": "1,442kJ 347kcals", "Fat": "24.6g", "Saturated Fat": "10.7g", "Carbohydrate": "24.4g", "Sugars": "24g", "Protein": "6.9g", "Salt": "0.1g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Ice_Cream_3_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}