{"title": "Mango & coconut custard tarts", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes, plus coolingM", "cook_time": "PT30 minutesM", "total_time": "PT45 minutes, plus coolingM", "serves": "4"}, "ingredients": [{"item": "375g block Jus-Rol Sweet Shortcrust"}, {"item": "170ml double cream"}, {"item": "3 large Waitrose British Blacktail Free Range Eggs"}, {"item": "75g caster sugar"}, {"item": "160ml can coconut cream"}, {"item": "½ large mango, finely chopped"}, {"item": "2 tbsp desiccated coconut"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Roll out the pastry to 5mm thickness and use to line 4 individual 12cm-wide x 2cm-deep  loose-bottomed tart tins. Fill the tart cases with baking parchment and baking beans and bake blind for 10 minutes. Remove the parchment and beans."}, {"step": "Meanwhile, in a small pan, heat the double cream very gently until it just reaches boiling point then remove from the heat. Place 1 whole egg and 2 egg yolks (reserving the 2 egg whites for the topping in step 4) in a bowl and beat gently with 50g of the sugar. Pour over the hot cream, whisking all the time, then add the coconut cream and stir to combine."}, {"step": "Pour the custard mixture into the tart cases and bake for"}, {"step": "12-15 minutes until just set. Remove from the oven and top with"}, {"step": "the chopped mango."}, {"step": "Using a handheld whisk, beat the reserved egg whites to soft peaks then slowly add the remaining sugar, a little at a time, until you have a glossy, stiff meringue mixture. Spoon the meringue on top of the mango and sprinkle with the desiccated coconut. Bake for 4-5 minutes until golden. Leave to cool in the tins for 10 minutes then carefully remove and serve."}], "nutrition": {"Energy": "4066.848kJ 972kcals", "Fat": "66.5g", "Saturated Fat": "36.8g", "Carbohydrate": "79.1g", "Sugars": "34.6g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Mango-and-coconut-custard-tarts-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}