{"title": "Mango & coconut breakfast brioche", "tags": null, "planning": {"prep_time": "PT45 minutes + overnight provingM", "cook_time": "PT25-30 minutesM", "total_time": "PT1 hour 15 minutesM", "serves": "8-10"}, "ingredients": [{"item": "275ml milk"}, {"item": "425g strong white bread flour, plus extra for dusting"}, {"item": "50g caster sugar"}, {"item": "1 tsp table salt"}, {"item": "7g pack fast action dried yeast"}, {"item": "50g butter, cubed"}, {"item": "2 British Blacktail Medium Free Range Eggs, beaten"}, {"item": "For the filling"}, {"item": "1 ripe mango, peeled, stoned and chopped"}, {"item": "25g caster sugar"}, {"item": "75g desiccated coconut"}, {"item": "1 British Blacktail Medium Free Range Egg, beaten"}], "instructions": [{"step": "Pour the milk into a small saucepan and heat gently until it is warm to the touch but not boiling. Combine the flour, sugar, salt, yeast and butter in the bowl of a stand mixer. Use the paddle attachment to blend the cubes of butter into the flour until you have a sandy texture with no large lumps of fat remaining."}, {"step": "Pour the beaten egg into the middle and add ½ of the warm milk. Begin to mix on a slow speed, gradually adding the remaining milk. The dough will be very wet, but this is characteristic of a brioche so don’t panic!"}, {"step": "Beat the dough for 8-10 minutes on a medium speed. It won’t come together into a ball and will appear more like a batter, but it will look elastic and start to pull away from the bowl. Use a spatula to scrape down the sides, cover and place the dough into the fridge to rise overnight (8-12 hours is ideal)."}, {"step": "In the morning, remove the dough from the fridge and let it sit at room temperature for 30 minutes while you make the filling. Blitz the mango to a purée in a food processor or mini-chopper, then tip into a small saucepan. Add the sugar and simmer for 5 minutes. When the purée is smooth and has thickened slightly, remove from the heat and allow to cool before using. Gently toast the coconut in a large, dry frying pan."}, {"step": "Divide the dough into 4 equal pieces and shape each into a ball. Dust a large baking tray and your work surface with flour and, if you have them, have a dough scraper and pizza cutter handy."}, {"step": "Roll each piece of dough into a large circle using a floured rolling pin, cutting around a dinner plate approx. 26-28cm in diameter to ensure they are all the same size. Layer the dough circles onto the baking tray, spreading a layer of mango purée and desiccated coconut between each one. You should create three layers of filling and leave the top bare."}, {"step": "To create the star shape, place an upturned glass into the centre of the dough circles. Use a sharp knife or pizza cutter to make 16 cuts from the outside of the dough to the glass in the centre as a guide. Using both hands, take two strips next to each other and twist them twice towards each other. Pinch the ends together to form a point. Repeat with the remaining strips until you have created an eight-point star."}, {"step": "Remove the glass, cover the dough with a tea towel and leave to prove for 30-45 minutes or until slightly increased in size. About"}, {"step": "minutes before the dough is ready, preheat the oven to 220°C, gas mark 7."}, {"step": "Brush the dough liberally with beaten egg and bake for 25-30 minutes, rotating the tray once during the baking process. Check the bread after 15 minutes and cover with foil if it is looking too dark. Allow the bread to cool for 10 minutes before serving warm as a breakfast centrepiece, or allow to cool completely. It is best eaten on the day it’s made, or within 2 days. Delicious with a cup of tea or coffee."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Mango-&-Coconut-Brioche.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}