{"title": "Maple custard tarts", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT40M", "total_time": "PT60M", "serves": "12"}, "ingredients": [{"item": "200g plain flour, plus extra for dusting"}, {"item": "100g cold butter, cubed"}, {"item": "20g icing sugar"}, {"item": "½ tsp vanilla paste"}, {"item": "4-6 tbsp cold milk"}, {"item": "150ml whole milk"}, {"item": "150ml double cream"}, {"item": "2 large Waitrose British Blacktail Eggs, plus 1 egg yolk"}, {"item": "75g caster sugar"}, {"item": "3 tbsp Waitrose Canadian Maple Syrup No 2, plus extra for drizzling"}, {"item": "1 tbsp cornflour"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. For the pastry, place the flour, butter and a pinch of salt in a bowl and using your fingertips, rub the butter into the flour until it resembles coarse breadcrumbs. Stir through the icing sugar thoroughly and then add the vanilla paste. Slowly add the milk, mixing using a knife, until it starts to come together to form a firm dough. Tip out onto a lightly floured work surface and knead together gently to form a dough. Wrap in clingfilm and place in the fridge to rest."}, {"step": "For the filling, place the milk and cream in a saucepan and heat gently until nearly boiling. In a large bowl place the 2 eggs, 1 yolk, sugar and maple syrup and whisk together well. Place the cornflour in a small bowl and add a couple of tablespoons of the hot milk to form a smooth paste. Pour this into the egg mixture along with the hot milk and cream, whisking throughout. Pour into a jug and set aside to cool."}, {"step": "Roll out the pastry on a lightly floured work surface until very thin. Cut out discs measuring 12cm and use to line the base and sides of a 12 hole muffin tin. Prick the bases with a fork and then line each one with baking parchment or foil. Fill with baking beans or dried rice or beans and bake blind for 15 minutes until lightly golden. Remove the baking beans and parchment/foil and bake for a further 5 minutes."}, {"step": "Reduce the oven to 180°C, gas mark 4. Pour the egg mixture into the pastry cases. Carefully return to the oven and bake for a further 15 minutes until just set. Leave to cool in the tin for about 5 minutes then transfer to a wire rack and while still warm drizzle the top of each with a little extra maple syrup. Serve warm or allow to cool."}], "nutrition": {"Energy": "1,119kJ 268kcals", "Fat": "15.5g", "Saturated Fat": "9g", "Carbohydrate": "28g", "Sugars": "13.5g", "Protein": "4.1g", "Salt": "0.2g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Waitrose-Weekend_WK345_WKEnd-Menu_Sun-Pud_Maple-Custard-Tarts.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}