{"title": "Marbled Double Chocolate Cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes plus chillingM", "cook_time": "PT35M", "total_time": null, "serves": "12"}, "ingredients": [{"item": "150g Cooks’ Ingredients Dark Chocolate For Cooking, broken into pieces"}, {"item": "225g butter, softened and cut into cubes"}, {"item": "225g golden caster sugar"}, {"item": "4 Columbian Blacktail eggs"}, {"item": "225g self-raising flour"}, {"item": "For the topping"}, {"item": "150g Cooks’ Ingredients Dark Chocolate For Cooking, broken into pieces"}, {"item": "125ml essential Waitrose Whipping Cream"}, {"item": "150g Cooks' Ingredients White Chocolate For Cooking, broken into pieces"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Generously butter and flour a 23cm ring or savarin cake tin (or a 20cm square cake tin, base-lined with baking parchment). Tap out excess flour.  For the cake, melt the dark chocolate in a heatproof bowl over a pan of barely simmering water, stirring occasionally until smooth and melted. Remove from the heat, set aside and allow to cool slightly.  Using an electric whisk or wooden spoon, beat the butter and sugar together until very pale and fluffy. Beat in the eggs, one at a time, then sieve in the flour and fold in to combine. Spoon half of the cake mixture into a clean bowl and reserve, then pour the melted but cooled chocolate into the other half of the cake mixture and gently stir until combined.  Alternate spoonfuls of both cake mix into the prepared cake tin then, using a skewer, stir and swirl together to create a marbled effect. Bake in the preheated oven for 30-35 minutes (or about 50 minutes if using a square cake tin) until cooked and a skewer comes out clean. Allow to cool in the tin for about 5 minutes. Gently loosen the edges and turn out. Cool on a rack.  For the topping, gently melt the remaining dark chocolate in a pan with the cream. Remove from the heat and allow to cool slightly. Meanwhile, in a heatproof bowl over a pan of barely simmering water, melt the white chocolate until smooth and glossy, Spread the dark chocolate over the top of the cake then, with a spoon, liberally drizzle over the white chocolate. Chill until the chocolate topping has set."}], "nutrition": {"Energy": "2389.064kJ 571.0kcal", "Fat": "39.7g", "Saturated Fat": "24.1g", "Sugars": "32.5g", "Salt": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/marble_cake_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}