{"title": "Marinated Beef with Asparagus", "tags": [{"tag": "Diabetic"}], "planning": {"prep_time": "PT10 minutes, plus marinating overnightM", "cook_time": "PT40 minutes (for rare), plus 15-20 minutes restingM", "total_time": "PT55 minutes to an hour, plus marinating overnightM", "serves": "8"}, "ingredients": [{"item": "2 large cloves garlic, crushed"}, {"item": "2 medium red chillies, deseeded and finely chopped"}, {"item": "2 tbsp grainy mustard"}, {"item": "200ml Waitrose Balsamic Vinegar of Modena"}, {"item": "1kg piece fillet steak, Aberdeen Angus or British, from the meat service counter"}, {"item": "A little olive oil for searing"}, {"item": "For the asparagus"}, {"item": "750g asparagus spears, trimmed"}, {"item": "100g butter"}, {"item": "Finely grated zest and juice of 1 lemon"}], "instructions": [{"step": "Place the garlic, chillies, mustard and vinegar in a shallow dish and mix well. Add the beef, turning it to coat with the marinade. Cover and chill overnight, turning occasionally.  Preheat the oven to 200°C, gas mark 6. Remove the meat from the marinade and dry off the beef with kitchen paper. Discard the marinade.  Heat a large frying pan with a little olive oil. Sear the fillet on a high heat until brown all over. Place in a non-stick roasting tin and cook for 35 minutes for rare, 50 minutes (medium) or 1 hour (well done). Store in the fridge until ready to transport, but serve at room temperature.  Meanwhile, add the asparagus to a pan of boiling water and cook for 5-6 minutes until just tender. Drain and refresh under cold water.  To make the lemon butter sauce, melt the butter with the lemon zest and juice, and season well. Allow to cool, then chill."}], "nutrition": {"Energy": "1435.112kJ 343.0kcal", "Fat": "20.8g", "Saturated Fat": "10.9g", "Sugars": "2.7g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/0605ss32-r03.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}