{"title": "Marinated chicken, cannellini, chorizo and pepper salad", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT30 minutes, plus marinatingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 45 minutes, plus marinatingM", "serves": "6"}, "ingredients": [{"item": "4 red romano peppers"}, {"item": "1½ tbsp olive oil"}, {"item": "2 chicken breasts, skin on"}, {"item": "3 tbsp clear honey"}, {"item": "1 garlic clove, crushed"}, {"item": "2 lemons, juice, plus zest of 1"}, {"item": "120g hot and spicy chorizo ring, thinly sliced"}, {"item": "400g can cannellini beans, drained and rinsed"}, {"item": "110g pack baby leaf and rocket salad"}, {"item": "225g pack golden baby plum tomatoes, halved"}, {"item": "1 tbsp nonpareille capers, drained and rinsed"}, {"item": "1 tbsp sherry vinegar"}, {"item": "3 tbsp extra virgin olive oil"}, {"item": "½ x 25g pack flat leaf parsley, roughly chopped"}, {"item": "400g can cannellini beans, drained and rinsed 110g pack baby leaf and rocket salad 225g pack golden baby plum tomatoes,..."}, {"item": "400g can cannellini beans, drained and rinsed 110g pack baby leaf and rocket salad 225g pack golden baby plum tomatoes,..."}], "instructions": [{"step": "Preheat the oven to 230˚C, gas mark 8. Put the peppers on a baking tray, rub with ½ tbsp olive oil and roast for 30 minutes, turning halfway, until the skins are charred. Meanwhile, put the chicken breasts in a bowl. Whisk together the honey, garlic, zest and juice of 1 lemon and the remaining 1 tbsp olive oil; season and pour over the chicken. Set aside to marinate for 30 minutes."}, {"step": "Put the cooked peppers in a sealed plastic bag and allow to cool. Turn the oven down to 160˚C, gas mark 3. Heat an ovenproof frying pan over a medium heat. Add the chicken, skin-side down and cook for 3-5 minutes, until the skin is crisp. Turn over and transfer to the oven for 8-12 minutes, until cooked through. Put on a board, loosely cover with foil, and allow to rest."}, {"step": "Meanwhile, wipe the pan clean and heat over a medium-high heat; add the chorizo and cook for about 5 minutes, until crisp and releasing its fat. Use a slotted spoon to lift the chorizo onto a plate, keeping the oil in the pan. Turn the heat down, add the beans and cook for 15-20 minutes until crisp, stirring occasionally."}, {"step": "Peel the skins off the peppers, deseed and thinly slice. Scatter the salad leaves over a serving platter; top with the peppers, chorizo, beans, tomatoes and capers. Slice the chicken and arrange over the top. In a small bowl, whisk together the sherry vinegar, extra virgin olive oil and remaining lemon juice. Season and drizzle over the salad. Scatter over the parsley and serve."}], "nutrition": {"Energy": "1,447kJ 347kcals", "Fat": "20g", "Saturated Fat": "4.3g", "Carbohydrate": "19g", "Sugars": "14g", "Protein": "21g", "Salt": "1.4g", "Fibre": "4.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Marinated-chicken,-cannellini-and-pepper-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}