{"title": "Mark Sargeant’s sea bass with creamed crab and chilli spelt", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT40M", "total_time": "PT1 hour 5 minutesM", "serves": "4"}, "ingredients": [{"item": "1 tbsp vegetable oil"}, {"item": "4 sea bass fillets, scaled and pin boned"}, {"item": "small knob unsalted butter"}, {"item": "60g unsalted butter"}, {"item": "2 echalion shallots, finely chopped"}, {"item": "1 bay leaf"}, {"item": "½ x 20g pack thyme, leaves picked"}, {"item": "1 red chilli, deseeded and finely chopped"}, {"item": "2 garlic cloves, finely chopped"}, {"item": "200g pearled spelt (or arborio rice)"}, {"item": "100g brown crab meat"}, {"item": "800ml fresh chicken stock"}, {"item": "2½ tbsp double cream"}, {"item": "25g pack chives, finely chopped"}, {"item": "100g white crab meat"}], "instructions": [{"step": "To make the crab and chilli spelt, heat the butter in a saucepan, add the shallots and cook gently until soft but not browned – about 10 minutes. Add the bay leaf, thyme leaves, chilli and garlic; cook for 2 minutes more. Add the spelt (or rice) and cook for another 2 minutes, then stir in the brown crab meat. Meanwhile, heat the chicken stock in a small saucepan."}, {"step": "Add the warm stock to the spelt a ladle at a time, stirring continuously, adding more stock once it has been absorbed. Cook until the spelt is just tender – about 15-20 minutes; set aside while you cook the fish."}, {"step": "Heat the oil in a non-stick frying pan over a medium heat. Pat the sea bass fillets dry on kitchen paper and season. Place the fillets skin-side down in the pan (if they curl up a little, press firmly and they will relax back down). Cook for about 4-5 minutes, until almost cooked through. Add the butter, take the pan off the heat and turn the fish over – the residual heat will cook the fish through while you finish the spelt."}, {"step": "Put the spelt back on the heat to warm through, then stir in the cream, chives and white crab meat. It should have a loose texture that settles once stirred, like risotto; add a splash more stock (or water) if it seems too dry. Season, divide between plates or shallow bowls and top with the sea bass."}], "nutrition": {"Energy": "2,711kJ 648kcals", "Fat": "33.9g", "Saturated Fat": "16.3g", "Carbohydrate": "36.8g", "Sugars": "2.1g", "Protein": "48.9g", "Salt": "1.2g", "Fibre": "4.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WaitroseKitchenMar15_EasterWeekend11986_Seabass_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}