{"title": "Marsala-baked pears with hazelnut praline cream", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT40M", "total_time": "PT55M", "serves": "6"}, "ingredients": [{"item": "6 perfectly ripe pears"}, {"item": "35g raisins"}, {"item": "500ml sweet Marsala"}, {"item": "Juice of ½ lemon"}, {"item": "100g soft light brown sugar"}, {"item": "For the praline cream"}, {"item": "150g granulated sugar"}, {"item": "60g blanched hazelnuts, toasted"}, {"item": "2 tbsp lemon juice"}, {"item": "300ml whipping cream"}, {"item": "1 tbsp soft light brown sugar"}, {"item": "1 tsp vanilla extract"}], "instructions": [{"step": "Heat the oven to 190°C, gas mark 5. Halve the pears, but don’t core or peel them. Arrange the pears skin-side down in a single layer in a deep gratin dish or shallow casserole. Sprinkle the raisins round them."}, {"step": "Pour on the Marsala, 100ml water and the lemon juice. Sprinkle on the sugar and bake for 30-40 minutes – although how long it takes for the pears to become tender depends on how ripe they are. Spoon the liquid over the pears a few times during cooking. If the pears are soft but the cooking liquid is too thin, drain off some of the liquid and boil the rest to reduce it."}, {"step": "Let the pears, raisins and liquid cool, then transfer to a serving dish."}, {"step": "Line a baking sheet that has a low rim with baking parchment. To make the cream, put the granulated sugar for the praline into a small saucepan with 4 tbsp of water. Heat gently, tilting the pan every so often to make sure there is an even heat, until the sugar has dissolved. Put the heat right up and bring the sugar to a boil. Boil hard until the sugar goes from a pale toffee colour to caramel (your nose will tell you when it gets there, as well as your eyes). Be careful not to take it too far and burn the sugar. Immediately pull the pan off the heat, add the hazelnuts and 1 tbsp of the lemon juice. Stir this, then quickly pour the mixture onto the prepared baking sheet. Tilt the sheet to spread out the praline and leave it to cool and set."}, {"step": "Prise the praline off the baking sheet. You now need to break it down so you have a mixture of chunks, shards and powder. I usually put"}, {"step": "it in a plastic bag and bash it with a rolling pin. Whip the cream until it’s holding its shape, then add the rest of the lemon juice, the soft light brown sugar, the vanilla and the praline. Serve the pears with the praline cream on the side."}], "nutrition": {"Energy": "2,383kJ 570kcal", "Fat": "26g", "Saturated Fat": "13g", "Carbohydrate": "65g", "Sugars": "64g", "Protein": "3g", "Salt": "0.1g", "Fibre": "4.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Marsala-Baked-Pears.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}