{"title": "Martha Collison's buttered rum ginger cake", "tags": [{"tag": "Vegetarian"}, {"tag": "Christmas"}], "planning": {"prep_time": "PT1-1 hour 30 minutes + coolingM", "cook_time": "PT50M", "total_time": "PT1 hour 40 minutes to 2 hours 20 minutes + coolingM", "serves": "12 - 14"}, "ingredients": [{"item": "200g butter"}, {"item": "250g dark brown muscovado sugar"}, {"item": "50g treacle"}, {"item": "150g golden syrup"}, {"item": "200ml whole milk"}, {"item": "2 Waitrose British Blacktail Large Free Range Eggs"}, {"item": "2 pieces stem ginger from a jar in syrup, drained, finely chopped"}, {"item": "250g plain flour"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "1 tsp ground ginger"}, {"item": "1 tsp ground cinnamon"}, {"item": "½ tsp ground nutmeg"}, {"item": "Finely grated zest of 1 large orange"}, {"item": "3 Waitrose British Blacktail Large Free Range Egg whites"}, {"item": "175g caster sugar"}, {"item": "200g unsalted butter, cubed and softened"}, {"item": "4 tbsp spiced rum"}, {"item": "1 tsp ground nutmeg"}, {"item": "Fondant icing, gold lustre spray and Christmas hundreds and thousands, to decorate"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 3 and grease and line three 18cm tins with baking parchment. Heat the butter, sugar, treacle and syrup together in a large saucepan, stirring until the butter is melted and the sugar dissolved. When grains of sugar are no longer visible, remove from the heat, pour the milk into the saucepan with the hot mixture and whisk to combine. Beat in the eggs and chopped stem ginger."}, {"step": "Sift the flour, bicarbonate of soda, spices and orange zest together in a large bowl. Pour the wet mixture over the top and whisk together until smooth. Divide the mixture between the tins and then bake for 40-50 minutes, or until firm and a skewer inserted into the centre comes out clean. Leave the cakes to cool completely in their tins before decorating."}, {"step": "To make the buttercream, place the egg whites into a large bowl or the bowl of the stand mixer. Combine the sugar and 75ml water in a small saucepan and set over a low heat. Stir until the sugar dissolves, then stop stirring and bring the syrup up to a simmer. Use a sugar thermometer to check the temperature. When the sugar syrup reaches 110°C on the sugar thermometer, start whisking the egg whites on high speed so they form stiff peaks. When the syrup reaches 118°C (the soft ball stage), remove it from the heat and slowly pour into the egg whites, whisking all the time. Try to avoid pouring the syrup onto the beaters, as this will create hard sugar crystals. Continue to whisk for 5 minutes, beating until the meringue is thick and glossy and the outside of the bowl feels cool to the touch."}, {"step": "Add the butter, piece by piece, whisking between each addition until all the butter is incorporated and the buttercream is smooth. It is likely that the buttercream will look curdled at some point, but persist with whisking and it will eventually come together. Once all the butter has been mixed in, add the rum and nutmeg and beat for a further few minutes to make sure the buttercream is really smooth."}, {"step": "When you are ready to assemble the cake, place the bottom layer onto a cake stand or better, a cake turntable. Sandwich all the cakes together with a thin layer of buttercream and use a palette knife to fully cover the outside of the cake too. Spoon any remaining icing into a piping bag fitted with a large closed star nozzle. Holding the bag vertically over the cake, squeeze and twist at the same time to create a ‘tree’ on the top. Repeat a few times, creating different sizes."}, {"step": "Make star shapes out of white fondant and spray them gold using a lustre spray. Use hundreds and thousands to create a border of colour around the base of the cake. To finish, place a star onto the top of each tree and add a few extra sprinkles as baubles. This cake will keep for up to 1 week in an airtight container in the fridge."}], "nutrition": {"Energy": "2,095kJ 501kcals", "Fat": "25.3g", "Saturated Fat": "15.6g", "Carbohydrate": "61g", "Sugars": "47g", "Protein": "4.6g", "Salt": "0.7g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK141217-Martha-rum-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}