{"title": "Martha Collison's quiche Lorraine", "tags": null, "planning": {"prep_time": "PT20 minutes + chillingM", "cook_time": "PT1 hour 10-15 minutesM", "total_time": "PT1 hour 35 minutes + chillingM", "serves": "4 - 6"}, "ingredients": [{"item": "1 x basic shortcrust pastry recipe"}, {"item": "2 Waitrose British Blacktail Medium Free Range Eggs and 1 egg yolk"}, {"item": "250g double cream"}, {"item": "1 tbsp vegetable oil"}, {"item": "150g smoked bacon lardons"}, {"item": "1 small onion, very finely chopped"}, {"item": "75g Gruyère cheese, grated"}, {"item": "50g mature Cheddar cheese, grated"}], "instructions": [{"step": "Preheat the oven to 200ºC, gas mark 6. Roll the chilled pastry out on a lightly floured surface or between 2 pieces of clingfilm to a 5mm thickness, then press into an 18–20cm deep tart tin. Use a small piece of pastry to press the sides in firmly. Roll the rolling pin across the top of the tin to cut off excess pastry, prick the base with a fork and chill for a further 15 minutes."}, {"step": "Line the pastry case with a sheet of baking parchment (scrunching the paper up first helps it go all the way to the edges). Fill to the top with baking beans, rice or lentils. Bake for 15 minutes, then remove the beans and paper and bake for 10 minutes until the base is crisp."}, {"step": "Reduce the heat to 180°C, gas mark 4. In a large jug, beat together the eggs, egg yolk and double cream until smooth. Season well with black pepper and set to one side."}, {"step": "Warm the vegetable oil in a small frying pan over a medium heat. Add the lardons and fry for 5–6 minutes until crisp. Remove from the pan using a slotted spoon and arrange over the case."}, {"step": "Reduce the heat to medium and fry the onion in the bacon fat until softened, then add to the pastry case. Scatter half the grated Gruyère and Cheddar over the onions and bacon, then pour in the egg mixture, filling to the top of the case. Sprinkle the remaining cheese over the top."}, {"step": "Bake for 30–35 minutes until the quiche is golden on top and the filling is set and slightly puffed up. Enjoy warm or at room temperature with salad."}], "nutrition": {"Energy": "2,900kJ 699kcals", "Fat": "57g", "Saturated Fat": "32g", "Carbohydrate": "29.2g", "Sugars": "1.6g", "Protein": "16.5g", "Salt": "1.4g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK121017Martha-quiche-Lorraine.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}