{"title": "Martha's chocolate fudge townie", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes + 30 minutes chilling timeM", "cook_time": "PT40M", "total_time": "PT60 minutes + 30 minutes chilling timeM", "serves": "8"}, "ingredients": [{"item": "200g plain flour"}, {"item": "20g ground almonds"}, {"item": "35g icing sugar"}, {"item": "125g butter, diced"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg, separated"}, {"item": "50g butter"}, {"item": "400g plain chocolate"}, {"item": "45g plain flour"}, {"item": "¼ tsp baking powder"}, {"item": "½ tsp instant coffee granules"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "130g caster sugar"}, {"item": "50-100g chocolate chunks"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and lightly grease a 34 x 11cm rectangular tart tin."}, {"step": "To make the pastry, place the flour, almonds, icing sugar and butter into a food processor and pulse until it resembles fine breadcrumbs. Add the egg yolk (save the white for glazing) and 1 tablespoon of cold water and pulse again. The mixture will clump together, so shape it into a rectangular shape using your hands, wrap in clingfilm and place in the fridge for 30 minutes."}, {"step": "Roll the chilled pastry out into a large rectangle just larger than the tin. It should be around 0.5cm in thickness. Gently place into the tin, making sure you push the dough right into the edges. Place a layer of baking parchment over the tart, fill with baking beans (rice or lentils will work just as well) and bake for 25 minutes. After 15 minutes of baking, remove the baking parchment and beans and brush with the beaten egg white. Return to the oven for the remainder of the baking time."}, {"step": "To make the brownie filling, melt the butter and chocolate together over a pan of simmering water. Combine the flour, baking powder and coffee in a small bowl."}, {"step": "Place the eggs and sugar into the bowl of a stand mixer and whisk until the mixture looks pale and has doubled in size. Pour the eggs into the chocolate mixture and gently stir, then fold in the flour until you have a thick, glossy mixture. Spoon the brownie mixture into the blind-baked tart case, sprinkle with chocolate chips and bake for 15–20 minutes. The top should be shiny and just starting to crack, and it should feel firm but not dry. Allow to cool slightly before removing from the tin. Serve warm with a scoop of ice cream or whipped cream for an indulgent dessert!"}], "nutrition": {"Energy": "3,059kJ 734kcals", "Fat": "41.3g", "Saturated Fat": "23.6g", "Carbohydrate": "79.4g", "Sugars": "56.8g", "Protein": "11.1g", "Salt": "0.6g", "Fibre": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Waitrose-Weekend_Martha_Townie.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}