{"title": "Martha Collison's bread bowls with roasted butternut pancetta soup", "tags": null, "planning": {"prep_time": "PT35 minutes + proving timeM", "cook_time": "PT60M", "total_time": "PT1 hour 30-35 minutes + provingM", "serves": "4"}, "ingredients": [{"item": "250g strong wholemeal bread flour"}, {"item": "250g strong white bread flour"}, {"item": "7g sachet easy bake instant yeast"}, {"item": "10g fine sea salt"}, {"item": "30ml olive oil"}, {"item": "1 medium Waitrose British Blacktail Egg, beaten"}, {"item": "Flour or cornmeal, to dust"}, {"item": "1 butternut squash, peeled and cut into small cubes"}, {"item": "2 tbsp olive oil"}, {"item": "1 tsp hot smoked paprika"}, {"item": "1 litre chicken stock"}, {"item": "2 cloves garlic, roughly chopped"}, {"item": "1 dried chipotle chilli, torn into small pieces"}, {"item": "80g pancetta"}, {"item": "2 tbsp crème fraîche, plus extra to serve"}], "instructions": [{"step": "Begin by making the ‘bowls’: place the flour in a large bowl. Add the yeast to one side of the bowl and the salt to the other. Fill a jug with 350ml of cold water, pour in the olive oil and ¾ of the water, then use your hands or a metal spoon to mix, adding more water until a smooth dough forms. You might not need all of the water, or you may need a little more."}, {"step": "Knead the dough on a lightly floured surface until a smooth and elastic dough forms. Place the dough in an oiled bowl, cover, and leave to rise until doubled in size – at least 1 hour and 30 minutes."}, {"step": "When the dough has risen, turn it out onto a lightly oiled surface and knock it back by folding it over on itself a couple of times. Shape into 4 balls and place onto a baking tray dusted with flour. Cover with a sheet of oiled clingfilm and leave to rise for 45 minutes, or until noticeably larger. Meanwhile, preheat the oven to 200°C, gas mark 6."}, {"step": "Brush the rolls with beaten egg, score with a serrated knife and bake for 20 minutes or until golden brown and risen. If you tap the bottom, the bread should sound hollow. Remove from the oven, (leave the oven on), and allow to cool on a wire rack."}, {"step": "Meanwhile, make the soup. Place the butternut squash cubes into a large roasting tin and toss in the olive oil. Sprinkle over the paprika and season with salt and pepper, making sure each cube is well coated. Roast the squash in the oven for 35-40 minutes until tender."}, {"step": "Pour the stock into a small saucepan and add the garlic and chilli. Heat on low for 20 minutes, allowing the flavours to infuse in the stock. Fry the pancetta in a small frying pan until crispy."}, {"step": "When the squash is cooked, tip it into a food processor or liquidiser and strain in half the stock (discarding the large chunks of garlic and chilli). Blitz until the squash is puréed, then add the remaining stock and continue to blitz until the soup is smooth. Pour the soup back into the saucepan with 2 tablespoons crème fraîche and heat on low until warmed through."}, {"step": "Use a serrated knife to cut a large circle in the top of each bread roll and scoop out the centre. Fill each bread bowl with the soup and a dollop of crème fraîche, then sprinkle with pancetta. Serve immediately with the bread centres on the side to dip."}], "nutrition": {"Energy": "3,348kJ 798kcals", "Fat": "33.5g", "Saturated Fat": "10.3g", "Carbohydrate": "85.9g", "Sugars": "13g", "Protein": "38.1g", "Salt": "2.5g", "Fibre": "9.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK160217-Bread-bowls-with-roasted-butternut-pancetta-soup.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}