{"title": "Martha Collison's cherry Bakewell steamed pudding", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT1 hour 30 minutes to 2 hoursM", "total_time": "PT1 hour 45 minutes to 2 hours 15 minutesM", "serves": "1 pudding"}, "ingredients": [{"item": "150g butter, softened"}, {"item": "150g light brown soft sugar"}, {"item": "1 tsp almond extract"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "100g plain flour"}, {"item": "1 tsp baking powder"}, {"item": "50g ground almonds"}, {"item": "60g pack dried sour cherries, roughly chopped"}, {"item": "75g icing sugar"}, {"item": "Fresh cherries and flaked almonds, to decorate"}], "instructions": [{"step": "Grease a 1 litre pudding basin with butter and line the base with a disc of baking parchment. Put a large square of foil on top of a square of baking parchment of the same size. Fold a pleat across the centre so the pudding can expand when it cooks and set to one side."}, {"step": "In a large bowl, beat together the butter, brown sugar and almond extract using a handheld electric whisk until light and fluffy – this will take about 5 minutes. Beat in the eggs one at a time."}, {"step": "Sieve the flour and baking powder into the mixture and beat again. Finally, add the ground almonds and dried sour cherries and stir to combine. Spoon the mixture into the greased basin so it is about two thirds full, and smooth over the top."}, {"step": "Put the pleated foil and parchment square on top of the basin with the foil side up. Fold over the sides of the basin, then secure by tying string around the sides."}, {"step": "To cook, put a heatproof saucer in the base of a large, deep saucepan. Lower in the prepared pudding and pour in enough boiling water to come halfway up the sides of the basin. Cover with a lid, bring to the boil and simmer gently for 1½-2 hours, topping up the water as necessary."}, {"step": "Lift the pudding out of the water and leave to stand for 5 minutes before turning out onto a plate and removing the parchment circle. Mix the icing sugar with enough water to form a thick paste and drizzle over the top of the pudding before topping with a cherry and a sprinkle of flaked almonds."}], "nutrition": {"Energy": "2,237kJ 535kcals", "Fat": "29.5g", "Saturated Fat": "14.2g", "Carbohydrate": "60.5g", "Sugars": "46.4g", "Protein": "6.9g", "Salt": "0.7g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK020217-Martha-cherry-Bakewell-steamed-pudding.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}