{"title": "Martha's moussaka", "tags": null, "planning": {"prep_time": "PT45M", "cook_time": "PT80M", "total_time": "PT125M", "serves": "8"}, "ingredients": [{"item": "2 large aubergines"}, {"item": "Table salt, for sprinkling"}, {"item": "500g baking potatoes, peeled"}, {"item": "2 tbsp olive oil, plus extra for drizzling"}, {"item": "1 red onion, diced"}, {"item": "1 tsp ground cumin"}, {"item": "1 tsp ground cinnamon"}, {"item": "½-1 tsp Cooks’ Ingredients Peppery Pul Biber (or chilli flakes)"}, {"item": "3 cloves garlic, crushed"}, {"item": "600g lamb mince"}, {"item": "¼ x 15g pack oregano, leaves only, finely chopped"}, {"item": "¼ x 20g pack thyme, leaves only, finely chopped"}, {"item": "200ml red wine"}, {"item": "400g can chopped tomatoes"}, {"item": "2 tbsp tomato purée"}, {"item": "For the sauce"}, {"item": "75g butter"}, {"item": "75g plain flour"}, {"item": "450ml milk"}, {"item": "200g plain yogurt"}, {"item": "50g Parmigiano Reggiano, grated"}, {"item": "¼ tsp ground nutmeg"}, {"item": "2 British Blacktail Medium Free Range Eggs, yolks only"}, {"item": "For the topping"}, {"item": "50g toasted pine nuts"}, {"item": "40g Parmigiano Reggiano, grated"}], "instructions": [{"step": "Slice the aubergine into 1cm slices and put in a colander. Sprinkle liberally with salt, toss to coat and leave to drain for about 45 minutes."}, {"step": "Preheat the oven to 180ºC, gas mark 4. Thinly slice the potatoes and arrange on a large, greased baking tray. Drizzle with olive oil, season and bake for 20 minutes."}, {"step": "Rinse the aubergines well, dry with kitchen paper and arrange over the potatoes. Season and bake for a further 20 minutes until tender."}, {"step": "Heat the oil in a large frying pan, add the onion and gently fry until softened, then stir in the spices and garlic and cook for a further 2 minutes. Stir in the lamb and most of the herbs, and fry until all the mince has browned. Add the red wine, tomatoes and tomato purée, then season and simmer for 30 minutes, until reduced and thickened. Set aside."}, {"step": "To make the white sauce, melt the butter in a pan, stir in the flour and cook for a minute. Gradually add the milk, whisking constantly with a balloon whisk until a smooth, thick sauce forms. Add the yogurt, cheese and nutmeg, then remove from the heat. Whisk in the egg yolks and"}, {"step": "set aside."}, {"step": "Arrange the vegetables over the base of a large ovenproof dish. Top with the lamb mixture, pour over the white sauce, then sprinkle over the topping ingredients and reserved chopped herbs. Bake for 30 minutes, or until golden brown. Allow to stand for 10 minutes before serving."}], "nutrition": {"Energy": "2,454kJ 589kcal", "Fat": "37g", "Saturated Fat": "17g", "Carbohydrate": "29g", "Sugars": "11g", "Protein": "27g", "Salt": "0.9g", "Fibre": "4.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's-Moussakav2.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}