{"title": "Martha Collison's pink lemonade cupcakes", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes + coolingM", "cook_time": "PT20M", "total_time": "PT1 hour-1 hour 5 minutes + coolingM", "serves": "16"}, "ingredients": [{"item": "125g butter, softened"}, {"item": "200g caster sugar"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "1 tsp vanilla extract"}, {"item": "225g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "120ml milk"}, {"item": "Zest of 1 lemon"}, {"item": "100ml pink lemonade, such as Fentimans Rose Lemonade or Lorina Traditional Pink Lemonade"}, {"item": "2 tbsp caster sugar"}, {"item": "100g raspberries"}, {"item": "Juice of ½ a lemon"}, {"item": "150g unsalted butter, softened"}, {"item": "450g icing sugar"}, {"item": "Fresh raspberries, zest of 1 lemon and coloured paper straws, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4, and line two 8-hole muffin tins with 16 cupcake cases."}, {"step": "Cream together the butter and sugar until pale and fluffy, about 4-5 minutes, using an electric whisk. Beat in the eggs, one at a time, followed by the vanilla."}, {"step": "In a separate bowl, combine the flour and baking powder. Add this gradually into the butter and egg mixture until a thick batter"}, {"step": "forms. Finally, stir in the milk and lemon zest."}, {"step": "Divide the mixture between the cupcake cases and bake for 15-20 minutes, or until the cakes are risen, golden and a skewer inserted comes out clean."}, {"step": "While the cakes are cooking, make the lemonade syrup. Stir together the lemonade and caster sugar in a saucepan over a medium heat for 5-10 minutes, or until reduced and beginning to thicken in consistency. Use a pastry brush to coat the top of each cupcake with the syrup, and then allow them to cool."}, {"step": "To make the raspberry buttercream, start with the raspberry purée. Place the raspberries and lemon juice into a saucepan and bring to a simmer. Use a fork to crush the berries until they become soft. Keep simmering the mixture for 5 minutes or until it has the appearance of raspberry jam. Remove from the heat and allow to cool completely before using."}, {"step": "Cream together the butter and icing sugar using an electric whisk until really light and fluffy. It will be quite thick at this stage. Gradually add in the cooled raspberry purée, a tablespoon at a time, until it is all incorporated. If the mixture looks slightly split, add a few tablespoons more icing sugar until it comes back together again and is smooth."}, {"step": "Pipe the raspberry icing onto the top of each cupcake using a piping bag fitted with a closed star nozzle. Top each cupcake with a fresh raspberry, paper straw and a sprinkling of lemon zest."}], "nutrition": {"Energy": "1,598kJ 381kcals", "Fat": "15.4g", "Saturated Fat": "9.5g", "Carbohydrate": "57.6g", "Sugars": "46.4g", "Protein": "2.9g", "Salt": "0.3g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK020616-pink-lemonade-cupcakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}