{"title": "Martha Collison's Sticky toffee flapjacks", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "about 12 large squares"}, "ingredients": [{"item": "150g butter, plus extra for greasing"}, {"item": "125g demerara sugar"}, {"item": "1 tbsp black treacle"}, {"item": "225g rolled oats"}, {"item": "150g medjool dates, destoned and quartered"}, {"item": "100g dark brown sugar"}, {"item": "25g butter"}, {"item": "1 tbsp golden syrup"}, {"item": "2 tbsp double cream"}, {"item": "50g toasted pecans"}, {"item": "You will need a  20 x 30cm brownie tin"}], "instructions": [{"step": "Preheat the oven to 200°C/180°C fan/gas 6. Grease a 20 x 30cm tin and line with baking parchment."}, {"step": "Put the butter, sugar and treacle into a large heavy-based saucepan. Heat the mixture gently, stirring occasionally, until the butter has completely melted and the sugar has almost dissolved."}, {"step": "Mix the oats and dates into the hot sugar and butter, and stir together until all the oats are completely coated."}, {"step": "Turn the mixture into the prepared tin and use the back of a spatula to press it down into an even layer."}, {"step": "Bake for 15 minutes until the top has just started to caramelise and is a light golden colour. This flapjack is darker than most, so be careful not to overbake it: you want the flapjack to be sticky and soft. Allow to cool completely in the tin."}, {"step": "To make the topping, put the dark brown sugar, butter and golden syrup into a small saucepan and bring to the boil. Stirring all the time, cook the mixture for five minutes or until thickened and bubbling. Carefully stir in the double cream and allow to cool slightly."}, {"step": "Roughly chop half the toasted pecans, then drizzle the toffee sauce over the flapjack. Sprinkle on the whole and chopped nuts and leave to set for about 30 minutes, or until the toffee sauce has cooled, before slicing into squares. The flapjacks will keep in an airtight container for up to 10 days."}, {"step": "Recipe taken from Twist by Martha Collison, HarperCollins, 2016."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha_Sticky-Toffee-Flapjacks_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}