{"title": "Martha Collison's gulab jamun", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20-25 minutes + soakingM", "cook_time": "PT15M", "total_time": "PT35-40 minutes + soakingM", "serves": "25"}, "ingredients": [{"item": "300g caster sugar"}, {"item": "5 green cardamom pods, slightly crushed"}, {"item": "1 tsp rose water"}, {"item": "125g dried skimmed milk powder"}, {"item": "3 tbsp plain flour"}, {"item": "1 tsp baking powder"}, {"item": "25g ghee (or butter)"}, {"item": "150ml whole milk"}, {"item": "Vegetable oil or ghee, to deep fry"}, {"item": "Pistachios, chopped, to serve"}], "instructions": [{"step": "Begin by making the sugar syrup. In a small saucepan, combine 150ml cold water with the caster sugar and cardamom pods. Simmer over a low heat for 1-2 minutes, stirring all the time until the sugar has dissolved and the syrup looks slightly thicker. Remove from the heat and stir in the rose water, then set aside."}, {"step": "Next make the gulab jamun. Combine the milk powder, flour and baking powder in a mixing bowl. Melt the ghee or butter in the microwave or in a small saucepan, then add to the dry ingredients."}, {"step": "Mix the ingredients together, adding the milk a little bit at a time until a soft, slightly sticky dough forms. Leave to stand for 2-3 minutes to firm up before rolling into 25 small round balls with damp hands. If the dough is too dry and starts to crack, add a little more milk to make smooth, round balls."}, {"step": "Heat enough oil or ghee in a medium saucepan to come halfway up the pan until it reaches around 150ºC on a thermometer. Try not to let the oil get any hotter than this or the balls won’t be cooked in the centre. Cook them in small batches for 5-7 minutes, stirring often to get an even golden colour on the outside. Remove from the oil with a slotted spoon and place on a piece of kitchen roll to absorb the excess oil. Cool for 3-4 minutes then place in a deep baking tin (a brownie tin works well)."}, {"step": "Place the syrup over a low heat and warm gently, then pour the syrup over the gulab jamun. Leave to soak for 1 hour before sprinkling with chopped pistachios. To enjoy them warm, heat with the syrup in the microwave in a non-metallic container for 20 seconds."}], "nutrition": {"Energy": "708kJ 170kcals", "Fat": "10g", "Saturated Fat": "2.4g", "Carbohydrate": "17.2g", "Sugars": "15.2g", "Protein": "2.7g", "Salt": "0.1g", "Fibre": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWL270417gulab-jamun.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}