{"title": "Martha Collison's soda bread", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT35M", "total_time": "PT50M", "serves": "2 small loaves"}, "ingredients": [{"item": "250g plain flour"}, {"item": "250g wholemeal flour"}, {"item": "1 tsp salt"}, {"item": "1½ tsp bicarbonate of soda"}, {"item": "400ml buttermilk (see Martha’s tip), plus extra if needed"}, {"item": "1 tbsp clear honey"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6 and place a baking tray into the oven to heat up."}, {"step": "Combine both flours in a large mixing bowl and add the salt and bicarbonate of soda. Make a well in the centre and add in the buttermilk and honey, as well as any additional ingredients for flavour variations. Use a round-ended knife to stir together the mixture, gradually incorporating the flour to form a soft dough. You may need to add a little extra buttermilk or milk to mop up any remaining flour."}, {"step": "Knead the dough very briefly (overhandling the dough will make your loaf tough), divide in 2, then form into 2 cob shapes. Remove the baking tray from the oven and carefully place the dough onto the tray, then use a serrated knife to slash a deep cross on the top of each loaf. The slashes are important, as they allow the heat of the oven to penetrate right into the centre of the bread to help it bake evenly."}, {"step": "Bake the loaves for 30-35 minutes or until a deep golden brown colour. If you tap the bottom of the loaf, it should sound hollow. Allow the loaf to cool for at least 15 minutes on a wire rack before serving warm with plenty of butter! Eat as soon as you can, as this bread tastes best fresh."}, {"step": "Beetroot & horseradish"}, {"step": "Grate 150g peeled fresh beetroot and squeeze any excess liquid out through kitchen paper. Add 1-2 tsp horseradish (freshly grated or hot horseradish from a jar) and the beetroot at step 2 and bake as directed."}, {"step": "Walnut & cranberry"}, {"step": "Add 100g chopped walnuts and 100g dried cranberries at step 2, then serve big hunks as an accompaniment to cheese."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK210618-Martha-sodabread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}