{"title": "Martha's raspberry & coconut ice cupcakes", "tags": null, "planning": {"prep_time": "PT20 minutes, plus cooling timeM", "cook_time": "PT20-25 minutesM", "total_time": "PT40-45 minutes, plus cooling timeM", "serves": "12 cakes"}, "ingredients": [{"item": "115g unsalted butter, softened"}, {"item": "200g caster sugar"}, {"item": "2 tsp vanilla extract"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "200g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "½ tsp salt"}, {"item": "120ml coconut milk"}, {"item": "100g raspberries, fresh or frozen"}, {"item": "135g unsalted butter, softened"}, {"item": "275g icing sugar, sifted"}, {"item": "50ml coconut milk"}, {"item": "12 fresh raspberries, to decorate"}, {"item": "3 tbsp desiccated coconut, to decorate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line a muffin tin with 12 muffin cases."}, {"step": "Cream the butter and sugar together until pale and fluffy, using an electric hand whisk or freestanding electric mixer with the paddle attachment."}, {"step": "Add the vanilla extract and the eggs (one at a time), scraping the bowl down with a spatula after each addition. Don’t worry if the mixture looks curdled at this point – it should blend together after the flour is added."}, {"step": "In a small bowl, combine the flour, baking powder and salt. With the mixer on low speed,"}, {"step": "add half the flour mixture, followed by all the coconut milk, then the remaining flour, mixing well between each addition until the mixture is smooth – about 2-3 minutes. It will be a very"}, {"step": "thick batter."}, {"step": "Fold the raspberries in by hand, and then divide the mixture between the cases and bake for 20-25 minutes. The cakes should be springy to the touch and, when inserted into a cake, a metal skewer should come out clean. Leave to cool completely."}, {"step": "While the cakes are cooling, make the frosting. Using a hand-held electric whisk, beat the butter, icing sugar and coconut milk together until light and fluffy – about 5 minutes. If the mixture is too runny, add a little more icing sugar."}, {"step": "Decorate the cold cakes using a palate knife. Put a tablespoon-sized dollop on the top of each cupcake, and then smooth down into the edges to form a cone shape. Use the rounded end of"}, {"step": "the spatula to create a swirl at the top. Decorate with a fresh raspberry and a sprinkle of desiccated coconut."}], "nutrition": {"Energy": "1,883kJ 450kcals", "Fat": "23.5g", "Saturated Fat": "15.9g", "Carbohydrate": "56g", "Sugars": "42.6g", "Protein": "3.6g", "Salt": "0.5g", "Fibre": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Martha-Raspberry-&-coconut-ice-cupcakes-WEB.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}