{"title": "Martha Collison's garlic baguettes", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT1 hour + proving time (overnight + 3 hours)M", "cook_time": "PT1 hour 5 minutesM", "total_time": "PT24 hoursM", "serves": "3 baguettes"}, "ingredients": [{"item": "150g strong white bread flour"}, {"item": "½ x 7g sachet fast-action yeast"}, {"item": "150ml cold water"}, {"item": "1 whole bulb garlic"}, {"item": "Pinch of sea salt"}, {"item": "200g plain flour"}, {"item": "100g strong white bread flour"}, {"item": "1 tsp table salt"}, {"item": "½ x 7g sachet fast-action yeast"}, {"item": "250ml water"}, {"item": "Sprinkle of semolina"}], "instructions": [{"step": "Beginning the day before you want to bake the baguettes, mix together all the sponge starter ingredients in a small bowl to make a thick paste and cover with clingfilm. Leave at room temperature for at least 12 hours (preferably overnight) so the mixture becomes bubbly. Making a sponge will improve the rise and flavour of the bread."}, {"step": "On the day you are ready to bake, preheat the oven to 200°C, gas"}, {"step": "mark 6. Place a whole bulb of garlic on a baking tray and bake for 45-50 minutes. Allow to cool completely, then squeeze the soft roasted garlic from each clove into a small bowl and discard the papery outer layers. Add a pinch of sea salt and mash the cloves to a smooth paste."}, {"step": "Place the flours, salt and yeast into a large bowl or the bowl of a stand mixer and add the mashed garlic paste. Pour in the bubbly sponge mixture and half of the water before mixing to form a rough dough. Keep adding the water gradually until you have a soft, fairly wet dough (you might not need all the water, or you may need to add a little more). It’s easiest to knead this dough in a stand mixer (around 5-8 minutes) or you can knead by hand on a lightly oiled surface (around 12-15 minutes) until the dough is smooth, elastic and silky."}, {"step": "Lightly oil a square or rectangular plastic container twice the size of the dough, then place it into the container. Cover and leave to prove for 1-2 hours or until doubled in size."}, {"step": "Sprinkle 2 large baking trays with semolina to stop the dough from sticking. Lightly flour the work surface and gently tip the dough out, being careful not to knock out the air bubbles. Divide the dough into 3, shape and roll into long baguette shapes and transfer to the baking trays, placing the baguettes seam side down. Cover the baguettes with oiled clingfilm or place the baking trays inside a large plastic bag to prove for 45 minutes – 1 hour or until visibly larger."}, {"step": "When you’re ready to bake, preheat the oven to 220°C, gas mark 7 and place a roasting tin filled with a mugful of water into the bottom of the oven. Slash the tops of the baguettes with a serrated knife and bake for 12-14 minutes or until golden. Allow to cool for 10 minutes before serving. These baguettes are best served on the day they are made."}], "nutrition": {"Energy": "1,202kJ 283kca", "Fat": "1.1g", "Saturated Fat": "0.2g", "Carbohydrate": "59.4g", "Sugars": "12g", "Protein": "8.9g", "Salt": "1g", "Fibre": "2.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK170817 Martha garlic baguettes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}