{"title": "Martha Collison's freezer dough cookies", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes + freezingM", "cook_time": "PT15M", "total_time": "PT30 minutes + freezingM", "serves": "20 cookies"}, "ingredients": [{"item": "200g butter, at room temperature"}, {"item": "150g light brown soft sugar"}, {"item": "1 Waitrose British Blacktail Medium Free Range Egg"}, {"item": "1 tsp vanilla extract"}, {"item": "275g plain flour"}], "instructions": [{"step": "In a large bowl, beat together the soft butter and the sugar using a wooden spoon. Beat the mixture until the ingredients are well combined – there is no need for them to be light and fluffy. Add the egg and vanilla extract, and beat again until smooth. Tip in the flour and stir using a spatula until a stiff dough forms. At this stage, add any other ingredients, such as chocolate chips or dried fruit (see below)."}, {"step": "Form the cookie dough into a thick log shape, approximately 20cm long. Roll in your desired coating (below), then wrap tightly in clingfilm, twisting the ends to seal. Place the cookie dough roll into the freezer and chill until completely frozen. The cookie dough will keep for up to 3 months."}, {"step": "When you are ready to bake your cookies, preheat the oven to 170ºC, gas mark 3. Unwrap the log and use a sharp knife to cut slices roughly 1cm thick. Arrange the cookies on a baking tray lined with baking parchment."}, {"step": "Bake for 12-15 minutes or until just starting to brown around the edges. The cookies will still feel soft, but will harden as they cool. Allow to cool completely on the tray before eating. The cookies will keep after baking for up to 1 week in an airtight container."}], "nutrition": {"Energy": "647kJ 155kcals", "Fat": "8.6g", "Saturated Fat": "5.3g", "Carbohydrate": "17g", "Sugars": "7.3g", "Protein": "1.8g", "Salt": "0.2g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK030518-Martha-freezer-dough-cookies.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}