{"title": "Martha Collison's Spiced marmalade bundt cake", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT45M", "total_time": null, "serves": "12-16"}, "ingredients": [{"item": "180g butter, at room temperature"}, {"item": "225g caster sugar"}, {"item": "175g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "75g ground almonds"}, {"item": "1½ tsp mixed spice"}, {"item": "3 eggs"}, {"item": "100g Seville orange marmalade"}, {"item": "Zest of 1 large orange"}, {"item": "125g Seville orange marmalade"}, {"item": "2 tbsp icing sugar"}, {"item": "2 tbsp fresh orange juice"}, {"item": "75g icing sugar"}, {"item": "1 tbsp fresh orange juice"}, {"item": "Orange zest, to decorate"}], "instructions": [{"step": "Preheat the oven to 160oC, gas mark 3, and grease a 1.5l bundt tin really well with butter followed by a light dusting of flour."}, {"step": "Cream the butter and sugar together using a handheld electric whisk or stand mixer until light and fluffy, around 5 minutes."}, {"step": "Mix the plain flour, baking powder, ground almonds and spice mix together in a small bowl. Add the eggs to the butter and sugar mixture one at a time, beating after each addition. Add 1 tbsp of the dry mix in between each egg to stop the mixture from curdling."}, {"step": "Add the remaining dry mix and beat until smooth. Place the marmalade into a small bowl and stir until loosened slightly. Spoon the marmalade and orange zest into the batter and mix one final time to combine."}, {"step": "Pour the batter into the prepared tin and bake in the centre of the oven for 40-45 minutes or until a skewer inserted comes out clean. Leave the cake to cool for 10-15 minutes, or until the pan is cool enough to touch. Use a plastic spatula or knife and run it around the edges of the tin if the cake looks like it might be stuck. Invert onto a cooling rack and leave to cool completely before decorating."}, {"step": "Heat the marmalade in a small saucepan with the icing sugar and orange juice and simmer until all the lumps of jelly have melted. Place a sheet of parchment under the cooling rack to catch the drips, and then spoon the glaze over the cake. Use a pastry brush to make sure the entire surface is covered."}, {"step": "Mix the icing sugar with enough orange juice to make a thick icing suitable to pipe. Pour into a piping bag and drizzle over the sticky cake before topping with orange zest and serving."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha_Bundt_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}