{"title": "Martha Collison's elderflower & strawberry pavlova", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT30 minutes + coolingM", "cook_time": "PT120M", "total_time": "PT2-3 hours + coolingM", "serves": "6 - 8"}, "ingredients": [{"item": "300g caster sugar"}, {"item": "150ml egg whites (around 5 Waitrose British Blacktail Medium Free Range Eggs)"}, {"item": "For the topping"}, {"item": "400g pack strawberries, hulled and chopped"}, {"item": "2 tbsp elderflower cordial"}, {"item": "2 tsp caster sugar"}, {"item": "400ml double cream"}, {"item": "Handful fresh mint, for serving"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6 and line a large baking tray with baking parchment. Pour the sugar onto the tray and spread out into an even layer. Place in the oven for 5-6 minutes, or until it feels hot to the touch and the very edges of the sugar layer are just starting to melt."}, {"step": "Meanwhile, put the egg whites into a large bowl. Whisk them until they resemble stiff peaks. When the meringue is ready you should be able to tip the bowl upside down without anything falling out."}, {"step": "Carefully whisk the hot sugar into the egg whites, adding a spoonful at a time and letting each spoonful fully mix in before adding the next. If you add the sugar too quickly, the meringue may collapse. Avoid adding any of the melted sugar around the edges – this will not dissolve properly in the meringue."}, {"step": "When all the sugar has been added whisk vigorously for 8-10 minutes or until the mixture is really thick and glossy. If you rub a small amount between your fingers, you shouldn’t be able to feel any grains of sugar. If it is still gritty, continue to whisk until it feels smooth."}, {"step": "Turn the oven down to 100°C, gas mark ¼. Spoon the meringue onto a lined baking tray to form a voluminous circular mound. Bake in the centre of the oven for 1½ to 2 hours, then turn the oven off and allow the pavlova to totally cool in the oven."}, {"step": "In a large bowl toss 400g pack strawberries, hulled and chopped, with 2 tbsp elderflower cordial and 2 tsp caster sugar until well coated. Leave for 10 minutes to macerate. Whip 400ml double cream into soft peaks and spread onto the cooled pavlova. Top with the strawberries and chopped fresh mint before serving."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha pavlova elderflower & strawberry.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}