{"title": "Martha Collison's baked vanilla cheesecake with raspberry & rhubarb", "tags": null, "planning": {"prep_time": "PT30 minutes + chillingM", "cook_time": "PT1 hour to 1 hour 30 minutesM", "total_time": "PT1 hour 30 minutes to 2 hoursM", "serves": "12"}, "ingredients": [{"item": "100g butter, plus extra for greasing"}, {"item": "250g digestive biscuits"}, {"item": "600g soft cheese"}, {"item": "150g caster sugar"}, {"item": "2 tbsp cornflour"}, {"item": "1 vanilla pod, seeds scraped out, pod kept"}, {"item": "4 Waitrose British Blacktail Free Range Medium Eggs"}, {"item": "125ml soured cream"}, {"item": "100g caster sugar"}, {"item": "200g raspberries"}, {"item": "250g rhubarb"}], "instructions": [{"step": "Grease the base and sides of a 20cm springform tin with butter. Cut a square of baking parchment slightly larger than the tin. Open the springform tin and place the base on the work surface. Lay the parchment over the base, then reattach the ring. The parchment will overhang at the edges, which makes the cheesecake easier to remove."}, {"step": "To make the base, melt the butter in a pan or microwave. Blitz the digestive biscuits in a food processor until they resemble fine crumbs, and then pour the melted butter into the processor and blitz again. Press the crumbs into the base and all the way up the sides of the lined tin, pushing it right into the edges to get an even layer using the back of a spoon. Place the base into the fridge to chill."}, {"step": "Preheat the oven to 140°C, gas mark 1. Beat together the soft cheese and sugar in a large bowl until smooth, then stir in the cornflour and vanilla seeds."}, {"step": "Add the eggs and stir gently, trying not to incorporate too much air, then mix in the soured cream. Pour the cheesecake mixture onto the chilled base. Bake the cheesecake for 1-1½ hours, or until the top feels set with a slight wobble in the centre. Allow to cool completely in the tin, then chill for at least 3 hours, preferably overnight."}, {"step": "To make the rhubarb topping, place the sugar in a small saucepan and add 125ml water. Bring to the boil, then add half the raspberries and the reserved vanilla pod. Simmer for 2-3 minutes, crushing the raspberries to release their juice, then turn the temperature down to low."}, {"step": "Slice the rhubarb into small pieces. Add the rhubarb to the raspberry syrup and poach for 2-3 minutes, or until tender but not falling apart. Remove from the syrup with a slotted spoon and leave to cool completely."}, {"step": "Add the remaining raspberries (reserving a small handful for the top) to the hot syrup and cook over a high heat, stirring all the time, until the mixture thickens into a sauce, around 5-8 minutes. Remove from the heat and allow to cool completely."}, {"step": "When ready to serve, remove the cheesecake from the tin and lift off the base by the overhanging parchment. Transfer onto a serving plate, pour the raspberry sauce over the cheesecake and spread to the edges. Decorate with the poached rhubarb and remaining raspberries before serving. The cheesecake will keep for 3 days in the fridge."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK070618-baked-vanilla-cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}