{"title": "Martha's baklava cheesecake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT50 minutes + chillingM", "cook_time": "PT60M", "total_time": "PT110-115 minutes + chillingM", "serves": "10"}, "ingredients": [{"item": "For the base"}, {"item": "25g pistachio nuts"}, {"item": "25g walnuts"}, {"item": "175g digestive biscuits"}, {"item": "75g butter, melted"}, {"item": "For the cheesecake filling"}, {"item": "400g soft cheese"}, {"item": "200g strained full fat"}, {"item": "Greek-style yogurt"}, {"item": "100g honey"}, {"item": "3 British Blacktail Medium Free Range Eggs"}, {"item": "Finely grated zest and juice of ½ unwaxed lemon"}, {"item": "For the syrup"}, {"item": "125g caster sugar"}, {"item": "75g honey"}, {"item": "1 cinnamon stick"}, {"item": "4 cardamom pods"}, {"item": "1 tsp orange blossom water"}, {"item": "For the topping"}, {"item": "125g filo pastry (about 3 sheets)"}, {"item": "100g pistachios"}, {"item": "100g walnuts"}], "instructions": [{"step": "Line the base of a 20-22cm round springform tin, lay a square of baking parchment over the base, and attach it to the tin by clipping it so the excess parchment hangs out."}, {"step": "For the base, blitz the nuts and digestive biscuits in a food processor, to resemble fine breadcrumbs. Meanwhile, brush the inside of the tin with a thin layer of melted butter. Stir the remaining butter into the biscuit crumbs, then tip into the tin and use the back of a spoon to press into an even layer. Chill for at least 30 minutes in the fridge."}, {"step": "Preheat the oven to 160°C, gas mark 3. To make the filling, use a balloon whisk to combine the soft cheese and Greek yogurt in a large mixing bowl, then stir in the honey, eggs, lemon zest and juice. Pour the cheesecake mixture over the chilled base and place onto a baking tray. Bake for 40-45 minutes, or until the cheesecake is set around the edges and has a slight wobble in the centre. Cool completely at room temperature, then place in the fridge for at least 3 hours."}, {"step": "While the cheesecake is cooling, make the syrup. Combine the sugar, honey, cinnamon stick, cardamom and 150ml cold water in a small pan. Stir over a low heat, until the sugar has dissolved, then bring to a gentle simmer. Allow the mixture to reduce by about one-third, then remove from the heat and stir in the orange blossom water. Allow to cool completely, then remove the cardamom pods and cinnamon stick. Set aside."}, {"step": "Preheat the oven to 180°C, gas mark 4. Lay the filo sheets on top of each other and roll up tightly to make a log shape. Use a sharp knife to thinly slice the log, creating thin ribbons of pastry. Unravel the pastry ribbons and toss together, then lay onto a baking tray. Bake for 12-15 minutes, jiggling the tray a couple of times during cooking so the ribbons brown evenly. Pulse the pistachios and walnuts in a food processor until you have a rubble-y consistency (you aren’t looking for ground nuts, you want a bit of texture)."}, {"step": "Place the crispy filo into a large mixing bowl and pour over three-quarters of the cooled syrup. Stir to coat each piece of pastry in sticky syrup (it will break apart as you stir) and then sprinkle over the nuts and fold through. Just before you are ready to serve, carefully remove the paper and place on a serving plate. Then pile the top high and evenly with the sticky baklava mix, then drizzle with the remaining syrup."}], "nutrition": {"Energy": "2,478kJ 595kcal", "Fat": "38g", "Saturated Fat": "15g", "Carbohydrate": "48g", "Sugars": "33g", "Protein": "13g", "Salt": "0.9g", "Fibre": "3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's Baklava-Cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}