{"title": "Martha Collison's coffee, white chocolate & walnut cake", "tags": null, "planning": {"prep_time": "PT40M", "cook_time": "PT25M", "total_time": "PT1M", "serves": "12"}, "ingredients": [{"item": "225g butter, softened"}, {"item": "225g light brown soft sugar"}, {"item": "4 medium Waitrose Free Range British Blacktail Eggs"}, {"item": "225g plain flour"}, {"item": "1 tbsp baking powder"}, {"item": "2 tbsp instant coffee, dissolved"}, {"item": "in 1 tbsp boiling water"}, {"item": "1 tbsp milk"}, {"item": "100g white chocolate"}, {"item": "75g walnut halves"}, {"item": "375g mascarpone cheese"}, {"item": "75g white chocolate, melted"}, {"item": "1 tsp instant coffee dissolved in 1 tsp boiling water"}, {"item": "3 tbsp milk"}], "instructions": [{"step": "Grease 3 x 18cm round tins and line with baking parchment and preheat the oven to 180°C, gas mark 4. Cream together the butter and sugar until pale and fluffy, about 4-5 minutes using an electric whisk. Beat in the eggs, one at a time."}, {"step": "In a separate bowl, combine the flour and baking powder. Add this gradually into the butter and egg mixture, followed by the coffee paste, until a thick batter forms. Stir in the milk to loosen it slightly."}, {"step": "Divide the mixture evenly between the tins and use a spatula to smooth the top. Bake for 20-25 minutes, or until the cakes are risen, golden and a skewer inserted comes out clean."}, {"step": "For the topping, melt the white chocolate in a bowl over a pan of simmering water and pour onto a sheet of baking parchment. Spread out into a large rectangle using a palate knife and then sprinkle over the walnut halves, crushing a few over the top for a different texture. Allow to harden, either at room temperature or in the fridge."}, {"step": "For the icing, place the mascarpone, melted white chocolate, coffee paste and milk together in a large bowl. Use an electric hand whisk to beat for a few minutes, or until light and spreadable."}, {"step": "Assemble the cake, spreading one third of the icing between each layer and one third on the top. Break up the white chocolate and walnut slab into small pieces and arrange on the top of the cake. This will keep for 3-4 days stored in the fridge."}], "nutrition": {"Energy": "2,421kJ 582kcals", "Fat": "41.4g", "Saturated Fat": "23.7g", "Carbohydrate": "43.9g", "Sugars": "28.9g", "Protein": "8.4g", "Salt": "0.8g", "Fibre": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK03032016-Martha-coffee-white-choc-walnut-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}