{"title": "Martha's iced ring biscuits", "tags": null, "planning": {"prep_time": "PT40 minutes + chillingM", "cook_time": "PT10-12 minutesM", "total_time": "PT50 minutes + chillingM", "serves": "about 30-40"}, "ingredients": [{"item": "100g unsalted butter, softened"}, {"item": "100g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "1 large Waitrose British Blacktail"}, {"item": "Free Range Egg"}, {"item": "200g plain flour"}, {"item": "½ tsp baking powder"}, {"item": "½ tsp fine salt"}, {"item": "250g royal icing sugar"}, {"item": "Gel food colourings, various"}], "instructions": [{"step": "Cream the butter and sugar together in a large bowl until starting to turn pale. Add the vanilla extract and break in the egg, then mix until combined."}, {"step": "In a small bowl, combine the flour, baking powder and salt."}, {"step": "Add this dry mixture to the butter and mix until a rough dough forms. You might need to gently knead the dough to make sure it holds together. Wrap the dough in clingfilm and chill in the fridge for 30 minutes."}, {"step": "Preheat the oven to 160°C, gas mark 3. Roll the dough out between 2 pieces of baking parchment (this stops it sticking to the work surface) to a thickness of around 0.5cm. Cut 5cm circles out using a cutter, and punch a smaller hole in the middle of each to create a ring (I used the small lid of the vanilla extract bottle). Transfer to a lined baking tray and bake for 10-12 minutes. You want the biscuits to be slightly golden, but not too dark."}, {"step": "To make the icing, mix the sugar with enough water to make a thick white paste. Divide the mixture between 3 bowls, then add a tiny amount of the colourings of your choice (I used pastel yellow, purple and pink) to each bowl and mix until you have the shade you desire. Spoon 1 tbsp of each colour into separate piping bags."}, {"step": "Dip each biscuit face down into one of the bowls of icing, then working quickly, drizzle lines of a different colour from a piping bag across the top. Drag a cocktail stick through the stripes to create a feathered effect. The icing does start to set quickly, so decorate one biscuit at a time. Repeat with the remaining biscuits using different combinations of colours, then leave to set for a few hours before sharing out."}], "nutrition": {"Energy": "365kJ 87kcals", "Fat": "2.6g", "Saturated Fat": "1.6g", "Carbohydrate": "15g", "Sugars": "10.5g", "Protein": "0.8g", "Salt": "0.1g", "Fibre": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/i/Ice-ring-biscuits-WEB.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}