{"title": "Martha Collison's Brooklyn blackout cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45M", "cook_time": "PT30M", "total_time": "PT75M", "serves": "1 large cake"}, "ingredients": [{"item": "250g plain flour"}, {"item": "325g light brown soft sugar"}, {"item": "75g cocoa powder"}, {"item": "2 tsp bicarbonate of soda"}, {"item": "125g butter"}, {"item": "284ml tub buttermilk"}, {"item": "150ml milk"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "For the chocolate custard filling"}, {"item": "350ml whole milk"}, {"item": "300g caster sugar"}, {"item": "1 tbsp golden syrup"}, {"item": "50g cocoa powder"}, {"item": "50g cornflour"}, {"item": "50g butter, cubed"}, {"item": "1 tsp vanilla extract"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 3 and grease and line three 20cm loose-bottom cake tins. Place the plain flour, brown sugar, cocoa powder and bicarbonate of soda into a large bowl and whisk to combine. Melt the butter in a small saucepan."}, {"step": "Whisk the buttermilk and milk into the melted butter, then beat in the eggs."}, {"step": "Pour the wet mixture into the dry ingredients, whisking until a smooth batter forms. Scrape the cake mixture into the prepared tins and smooth the tops with a spatula."}, {"step": "Bake for 25-30 minutes, swapping the cakes around for the last 10 minutes, until they are risen and a skewer inserted into each centre comes out clean. Allow to cool completely before icing."}, {"step": "While the cakes are cooling make the chocolate custard filling. Combine the milk, caster sugar, golden syrup and cocoa powder in a large saucepan, and warm over a medium heat, stirring occasionally, until the mixture comes to the boil."}, {"step": "In a separate bowl, combine the cornflour with 75ml cold water and whisk until smooth. When no lumps remain, slowly pour the cornflour mixture into the saucepan, whisking all the time. Whisk the mixture over the heat for 2-3 minutes, until it thickens considerably. Allow to boil for a further minute before removing from the heat and stirring in the butter and vanilla extract. Pour the mixture onto a clingfilm-lined baking tray, cover with another sheet of clingfilm to stop a skin forming and chill completely."}, {"step": "When you are ready to assemble the cake use a serrated knife to trim the tops of the cakes so that each is completely level. Place the offcuts into a mini food processor and blitz to create crumbs, or simply crumble between your fingers in a bowl."}, {"step": "Place the bottom layer of sponge onto a cake stand and spread with chocolate custard. Repeat with the remaining two layers, then cover the cake completely with custard using a palette knife. Chill for at least 1 hour to solidify. Coat the outside of the cake with the crumbs, then chill until ready to serve. Eat within 2-3 days."}], "nutrition": {"Energy": "2,069kJ 492kcal", "Fat": "17g", "Saturated Fat": "10g", "Carbohydrate": "76g", "Sugars": "56g", "Protein": "8g", "Salt": "0.6g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Marth Collison's Brooklyn blackout cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}