{"title": "Martha Collison's cranberry, pecan & honey hot cross buns", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes + proving timeM", "cook_time": "PT20M", "total_time": "PT1 hour to 1 hour 5 minutes + proving timeM", "serves": "10 buns"}, "ingredients": [{"item": "250ml whole milk"}, {"item": "50g butter"}, {"item": "50g clear honey, plus 2 tbsp for glazing"}, {"item": "1 medium Waitrose British Blacktail Egg"}, {"item": "500g strong white bread flour"}, {"item": "50g caster sugar"}, {"item": "10g salt"}, {"item": "2 tsp ground cinnamon"}, {"item": "10g fast-action yeast"}, {"item": "150g dried cranberries, chopped"}, {"item": "50g pecan nuts, chopped"}, {"item": "Oil, for greasing"}, {"item": "50g plain flour"}], "instructions": [{"step": "Place the milk, butter and honey into a saucepan and gently warm through until the butter has melted. Set to one side to cool to room temperature, then beat in the egg."}, {"step": "Put the bread flour into the bowl of a stand mixer. Add the sugar, salt and cinnamon to one side of the bowl, and the yeast to the other. Using the dough hook on medium speed, slowly pour the warm milk mixture into the flour and knead for 4-5 minutes, or until a smooth and elastic dough has formed. You might not need to add all the milk or you might need a splash more to clean any floury patches from the inside of the bowl. Add the cranberries and pecan nuts and knead until combined."}, {"step": "When the dough feels soft and silky, place it in a lightly oiled bowl and leave to rise for at least 1 hour or until at least doubled in size. Line 2 baking trays with baking parchment."}, {"step": "Tip the risen dough onto a work surface and fold it repeatedly over itself to knock out any large pockets of air. Divide the dough into 10 pieces and use a cupped hand to roll them into balls. Evenly space the dough on the prepared baking trays, leaving enough room for them to double in size. Cover and leave for 1 hour or until the buns are noticeably larger. Meanwhile, preheat the oven to 200ºC, gas mark 6."}, {"step": "For the crosses, mix the plain flour with a few teaspoons of water to make a loose paste. Transfer the paste into a piping bag and pipe a thin line in a cross shape over each bun. Bake the buns in a hot oven for 15-20 minutes or until golden brown all over. While the buns are still hot, use a pastry brush to paint honey all over the tops. Enjoy warm or cold, also delicious toasted."}], "nutrition": {"Energy": "1,663kJ 394kcals", "Fat": "10.2g", "Saturated Fat": "3.9g", "Carbohydrate": "66.9g", "Sugars": "25.2g", "Protein": "8.7g", "Salt": "1.1g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK06042017-Martha-Collison-hot-cross-buns.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}