{"title": "Martha Collison's espresso martini macarons", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "35 macarons"}, "ingredients": [{"item": "160g ground almonds"}, {"item": "180g icing sugar"}, {"item": "1 tsp instant coffee powder"}, {"item": "120g white (from about 3 large eggs)"}, {"item": "160g caster sugar"}, {"item": "50g unsalted butter, softened"}, {"item": "150g icing sugar"}, {"item": "1 tbsp vodka"}, {"item": "2 tbsp Kahlua or other coffee liqueur"}, {"item": "50g plain chocolate, melted"}], "instructions": [{"step": "Line 2 large baking trays with baking parchment and draw 70 x 3cm circles using a pencil, or use a printed template underneath the parchment."}, {"step": "Place the ground almonds, icing sugar and coffee powder into the bowl of a food processor. Blitz until the nuts are finely ground and well mixed into the sugar. Pour the mixture into a large bowl."}, {"step": "Mix half the egg whites into the finely ground almonds and icing sugar and stir until a stiff paste forms. Set this aside whilst you make the Italian meringue."}, {"step": "Place the caster sugar into a small saucepan with 3 tablespoons of water. Bring to the boil and stir until the sugar has dissolved. When the mixture is clear, stop stirring and heat until the syrup registers 118oC on a sugar thermometer. Meanwhile, put the remaining egg white into a clean, grease free bowl. As the syrup is nearing 118oC, start whisking the egg white on a high speed until it reaches soft peaks and just holds its shape on the whisk. Take the syrup off the heat as soon as it is up to temperature and slowly pour down the side of the bowl into the egg whites in a steady stream. Continue to whisk on high until the mixture has cooled slightly and the bowl is no longer hot to touch."}, {"step": "Use a spatula to scrape the mixture out of the bowl and onto the almond paste in the large bowl. Fold together until the mixture runs in a thick ribbon from the spatula, disappearing back into the mix within 10 seconds. Transfer the batter into a piping bag fitted with a 1cm round piping tip. Pipe 70 x 3cm circles onto the baking parchment, using the template or drawn circles as a guide."}, {"step": "Leave the macarons to dry for at least 30 minutes - 1 hour until a thin skin has formed on the top; it may take a little longer if the kitchen is humid. They should no longer be sticky to the touch and will have a matt appearance. The skin allows the macarons to withstand the oven temperature for long enough to rise and let the signature ‘foot’ (the lacy bit at the bottom of a macaron) peek out. Whilst you are waiting, preheat the oven to 150oC, gas mark 3."}, {"step": "Bake in the centre of the oven, one tray at a time, for 10-12 minutes. The shells should not have started to brown, but should be firm and sound hollow when lightly tapped. Leave to cool for a few minutes before peeling off the paper."}, {"step": "Place the soft butter in a large bowl and beat using an electric whisk. Gradually add the icing sugar until it forms a thick paste."}, {"step": "Add the vodka and Kahlua, a tablespoon at a time, into the mixture and whisk to combine it. Continue whisking the buttercream for a further 5 minutes to lighten it; it should be pale and fluffy. If the mixture looks like it has split, add a few tablespoons of icing sugar and it should come back together."}, {"step": "Transfer the icing into a piping bag. Melt the chocolate and drizzle over half the macaron shells. Fill each macaron with the buttercream, then enjoy. These macarons will keep for up to 1 week in an airtight container."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/default_waitrose_recipe.jpg"}