{"title": "Martha's pink grapefruit, cardamom & gin tart", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes + overnight chillingM", "cook_time": "PT30M", "total_time": "PT55-60 minutes + overnight chillingM", "serves": "10"}, "ingredients": [{"item": "For the pastry"}, {"item": "275g plain flour"}, {"item": "25g ground almonds"}, {"item": "50g icing sugar"}, {"item": "10 cardamom pods, husks discarded, black seeds crushed"}, {"item": "175g cold butter, diced"}, {"item": "1 British Blacktail Medium Free Range Egg, yolk only"}, {"item": "For the filling"}, {"item": "1 pink grapefruit"}, {"item": "400ml double cream"}, {"item": "100g caster sugar"}, {"item": "1 tbsp gin"}, {"item": "½ tbsp lemon juice"}, {"item": "To decorate"}, {"item": "100ml double cream"}, {"item": "Pistachios, chopped"}], "instructions": [{"step": "Place the flour, almonds, icing sugar, crushed cardamom and butter into the bowl of a food processor. Pulse the mixture until it resembles breadcrumbs. Alternatively, rub the butter into the flour mixture with your fingertips until it becomes breadcrumb-like. Add the egg yolk and pulse until the dough just starts to clump together, adding 1-2 tbsp of cold water if needed."}, {"step": "Tip the dough onto a clean work surface and lightly knead until the pastry is smooth and uniform. Wrap and chill in the fridge for at least 30 minutes."}, {"step": "Preheat the oven to 170ºC, gas mark 3. Place a 20-22cm tart ring (or loose-based round cake tin without the base) onto a baking tray. Roll out the pastry between two sheets of parchment into a large circle around 0.5cm in thickness and lower into the tart ring, pressing it into the edges. Trim away any excess pastry. Line with baking parchment, fill with baking beans or uncooked rice and bake for 15 minutes. Remove the baking beans and bake for a further 10-15 minutes until the pastry is cooked through. Remove from the oven and cool."}, {"step": "For the filling, wash and dry the grapefruit, then finely grate the zest and squeeze the juice (discarding any pips). Pour the cream into a large saucepan and add the sugar. Heat on a low heat until the grains of sugar have dissolved, then turn up the heat and bring to the boil for 3 minutes. The boiling cream will double or triple in size, so make sure you’ve chosen a large enough pan."}, {"step": "Remove from the heat and leave to cool for 2 minutes. Add the grapefruit juice, half the zest, gin and lemon juice and mix thoroughly. The mixture will thicken slightly and turn creamy as the acid is added to the cream. Cool to room temperature, then pour the mixture into the blind-baked tart case and chill for at least 6 hours or preferably overnight, until set."}, {"step": "To decorate, whip the 100ml cream to soft peaks and spoon into a piping bag fitted with a star nozzle. Pipe stars of different sizes in a crescent shape on one half of the tart and decorate with the remaining zest and chopped pistachios. Refrigerate until ready to serve. This tart will keep for up to 3 days stored in the fridge."}], "nutrition": {"Energy": "2,432kJ 586kcal", "Fat": "45g", "Saturated Fat": "26g", "Carbohydrate": "38g", "Sugars": "18g", "Protein": "5.2g", "Salt": "0.4g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's pink grapefruit, cardamom & gin tart.tif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}