{"title": "Martha Collison's fab lolly brownies", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT40 minutes + coolingM", "cook_time": "PT20-25 minutes + coolingM", "total_time": "PT1 hour to 1 hour 5 minutes + coolingM", "serves": "16"}, "ingredients": [{"item": "100g light brown soft sugar"}, {"item": "150g caster sugar"}, {"item": "150g butter"}, {"item": "100g dark chocolate, chopped"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "100g plain flour"}, {"item": "25g cocoa powder"}, {"item": "75g raspberries"}, {"item": "300g fondant icing sugar"}, {"item": "25g cocoa powder"}, {"item": "Cooks’ Homebaking Glitter Strands or sprinkles to decorate"}, {"item": "16 lolly sticks"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5 and line a brownie tray (about 20 x 35cm) with baking parchment. Place the sugars and the butter into a large saucepan and heat on medium until the butter has melted. Simmer the mixture for 5 minutes to allow the sugar to begin to melt, stirring all the time, then remove from the heat."}, {"step": "Add the chopped dark chocolate into the warm sugar and butter mixture and stir it in until it is completely melted. Allow to cool to room temperature."}, {"step": "When the mixture is cool enough to touch, beat in the eggs. Add the flour and cocoa powder before stirring briefly to combine. Scrape into the prepared tin and use a spatula to smooth over the top."}, {"step": "Bake for 20-25 minutes or until the top is shiny and slightly cracked. Leave to cool completely in the tin, and then chill in the fridge or freezer for at least an hour."}, {"step": "Trim the edges of the brownie to make a 16cm x 30cm rectangle and then slice into 16 equally sized rectangles, about 4cm x 7.5cm bars."}, {"step": "Place the raspberries into a saucepan with 1 tablespoon of water and boil for 3-4 minutes or until the raspberries are soft. Press the mixture through a sieve and collect the raspberry juice in a small jug."}, {"step": "Divide the icing sugar between 3 bowls. Add the cocoa powder and 1½ tablespoons of cold water to one bowl, 1 tablespoon of the raspberry juice to another, and 1 tablespoon of water to the final bowl. Stir each bowl to form a thick icing – the consistency of golden syrup. Spoon into 3 separate piping bags."}, {"step": "Decorate the brownies by icing each third a different colour, then cover the chocolate third with coloured sprinkles. Poke a lolly stick into the bottom of each brownie."}], "nutrition": {"Energy": "1,254kJ 299kcals", "Fat": "12.1g", "Saturated Fat": "7.3g", "Carbohydrate": "44.7g", "Sugars": "38.6g", "Protein": "2.7g", "Salt": "0.3g", "Fibre": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK250816-Martha-fab-lollies.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}