{"title": "Martha's Raspberry ripple éclairs", "tags": null, "planning": {"prep_time": "PT45M", "cook_time": "PT30M", "total_time": null, "serves": "12"}, "ingredients": [{"item": "60g unsalted butter, diced"}, {"item": "¼ tsp salt"}, {"item": "1 tsp caster sugar"}, {"item": "40g plain flour"}, {"item": "50g strong bread flour"}, {"item": "2-3 large eggs"}, {"item": "150g punnet of raspberries"}, {"item": "1 tbsp icing sugar"}, {"item": "1 tsp vanilla bean paste"}, {"item": "300ml double cream"}, {"item": "250g fondant icing sugar"}, {"item": "6 raspberries, sliced in half"}], "instructions": [{"step": "Preheat the oven to 160oC. Line a large baking tray with parchment."}, {"step": "Place the butter, salt, sugar and 125ml of water into a small saucepan over a medium-high heat. Bring the mixture to a rolling boil, and when all the butter has melted, add the flour and vigorously beat the mixture with a wooden spoon until a smooth ball of dough forms."}, {"step": "Keep the pan on the heat and stir rapidly for a further minute. This cooks the flour and helps dry out the dough so it absorbs more egg, which helps the pastry expand properly when baked. Tip the dough into a bowl and leave to cool until it has stopped steaming."}, {"step": "Beat the eggs together in a small jug. Add the eggs to the cooled dough a little at a time, mixing well after each addition. The choux pastry probably won’t need all the egg; you want a shiny dough that falls in a ‘v’ shape when lifted up with a spatula. If you add too much egg, the dough will collapse in the oven, so be careful at this stage. Put the dough into a piping bag and pipe twelve 10cm éclairs onto the tray, leaving space for them to expand in the oven."}, {"step": "Brush each éclair with beaten egg (I use the remainder from the dough) and bake in the oven for 25-30 minutes, or until golden brown and crisp. When they are crisp, turn the oven off and allow the éclairs to cool in the oven for at least 30 minutes. This helps ensure that any remaining moisture is gently evaporated off so they stay crisp."}, {"step": "To make the filling, whip the cream with the icing sugar and vanilla into gentle peaks. In a small bowl, crush the raspberries with a fork. Carefully fold the raspberries through the cream; you want a ripple effect so don’t overmix. Save the bowl that you crushed the raspberries in for the icing."}, {"step": "Use a serrated knife to cut the éclairs in half. Transfer the cream into a piping bag fitted with a closed star nozzle and pipe a tight zigzag onto the bottom half of each éclair."}, {"step": "Mix 200g of the fondant icing sugar with enough water to make a thick paste. Add the remaining 50g of sugar to the bowl you used to crush the raspberries and mix. This should create a pale pink icing that can be used to decorate the top."}, {"step": "I find it easiest to decorate the éclairs before constructing them, so pipe a thick line of white icing onto the top éclair shells. Use a small palate knife to spread evenly over the top. Pipe a drizzle of pink icing down the middle of each one. Top the cream with the top éclair shell and finish each with half a raspberry. These are best served as soon as they are assembled."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Eclairs_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}