{"title": "Martha Collison's Eton mess concorde cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT40M", "cook_time": "PT1 hour 30 minutes to 1 hour 45 minutesM", "total_time": "PT2 hours 10 minutes to 2 hours 25 minutesM", "serves": "10 - 12"}, "ingredients": [{"item": "7 medium Waitrose British Blacktail Free Range Eggs, whites only"}, {"item": "280g caster sugar"}, {"item": "70g icing sugar"}, {"item": "600ml double cream"}, {"item": "1 tsp vanilla bean paste"}, {"item": "320g raspberries"}, {"item": "450g strawberries, quartered"}], "instructions": [{"step": "Preheat the oven to 100°C, gas mark ½ and line 3 baking trays with baking parchment. Use a pencil to draw 3 x 18cm circles onto the back of the parchment."}, {"step": "Place the egg whites into a large grease-free bowl or the bowl of a stand mixer and whisk until stiff peaks form."}, {"step": "Combine the sugars in a small bowl and add to the beaten egg whites a third at a time, beating well after each addition. Continue to beat the meringue on high speed for 5 minutes until it is thick and glossy."}, {"step": "Spoon the meringue mixture into a piping bag and pipe 3 x 18cm rounds, starting in the middle and working outwards towards the pencil line you have drawn. Pipe the remaining meringue into as many long sticks as you can (you will cut them later to surround the cake)."}, {"step": "Bake the meringues until crisp – 1½ to 1¾ hours. Turn the oven off and allow to cool completely."}, {"step": "Meanwhile, whip the cream and vanilla together into soft peaks. Place 100g of the raspberries in a small bowl and crush them with a fork to make a raspberry coulis."}, {"step": "Take the bottom layer of meringue and attach it to the serving plate using a blob of the whipped cream. Using a palate knife, spread a layer of cream over the top, then sprinkle over a few strawberries, raspberries and a tablespoon of raspberry coulis. Top with the next layer of meringue and repeat, before placing the final layer of meringue on."}, {"step": "Cover the top and sides of the meringue stack with the remaining cream. Use a serrated knife to gently slice the meringue sticks into pieces long enough to cover the side of the cake. You can slice them all the same length or alternate long and short for a staggered look. Pile the centre high with berries and drizzle with any remaining coulis. Serve immediately."}], "nutrition": {"Energy": "1,849kJ 443kcals", "Fat": "28.6g", "Saturated Fat": "17.9g", "Carbohydrate": "42.5g", "Sugars": "42.4g", "Protein": "4g", "Salt": "0.2g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK-260516-Martha-Eton-mess-concorde-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}