{"title": "Martha's Crunchy Nut French toast", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT10M", "cook_time": "PT12M", "total_time": "PT22M", "serves": "4"}, "ingredients": [{"item": "250ml whole milk"}, {"item": "2 British Blacktail Large Free Range Eggs"}, {"item": "1 tsp vanilla extract"}, {"item": "50g caster sugar"}, {"item": "Pinch of sea salt"}, {"item": "200g challa or brioche loaf, a few days old"}, {"item": "100g Crunchy Nut Cornflakes"}, {"item": "50g butter"}, {"item": "Fresh raspberries, sliced banana, honey and Greek yogurt, to serve"}], "instructions": [{"step": "Beat together the milk, eggs and vanilla extract in a wide rectangular dish that is big enough to hold two pieces of bread. Add the sugar and salt into the mix and beat again."}, {"step": "Cut the bread into 4 thick slices about 2.5cm thick and set to one side. Place the cornflakes into a bowl and cover with a bowl the same size to crush. You want them quite finely crushed, then sprinkle out into another rectangular dish."}, {"step": "Melt the butter in a large frying or griddle pan over a medium heat. Dip a slice of bread into the egg mixture and soak for 30 seconds on each side until saturated, then lay into the crushed cornflakes and coat on both sides."}, {"step": "Fry, in batches, for 3-4 minutes – reducing the heat if necessary – until golden and caramelised on the bottom, then flip over. Keep a close eye to make sure the cornflakes don’t catch underneath. Cook for a further minute or two on the other side until puffed up and cooked through, then remove from the pan and keep warm in the oven until ready to serve. Repeat with the remaining bread until all the egg mixture is used up."}, {"step": "Top with berries, banana and a drizzle of honey and serve with Greek yogurt."}], "nutrition": {"Energy": "2,416kJ 575kcal", "Fat": "20g", "Saturated Fat": "9.5g", "Carbohydrate": "81g", "Sugars": "45g", "Protein": "14g", "Salt": "1.6g", "Fibre": "6.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's Crunchy Nut French toast.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}