{"title": "Martha's Mini egg cake", "tags": null, "planning": {"prep_time": "PT30 minutes plus coolingM", "cook_time": "PT1 hour 10 minutesM", "total_time": null, "serves": "12"}, "ingredients": [{"item": "250g unsalted butter, softened"}, {"item": "250g caster sugar"}, {"item": "1 tsp vanilla bean paste"}, {"item": "5 large eggs"}, {"item": "100g full fat Greek yoghurt"}, {"item": "310g self-raising flour"}, {"item": "½ tsp salt"}, {"item": "3 tbsp whole milk"}, {"item": "150g white chocolate"}, {"item": "250g icing sugar"}, {"item": "250g unsalted butter, softened"}, {"item": "2 x 328g packs mini eggs"}], "instructions": [{"step": "Grease and line a deep 18cm round cake tin. Preheat the oven to 160°C, gas mark 3."}, {"step": "Place the butter, sugar and vanilla into a stand mixer fitted with the paddle attachment and beat together until pale and fluffy, about 3-4 minutes. Scrape down the sides of the bowl using a spatula, and beat in the eggs one at a time. Add 1 tbsp of flour if the mixture starts to curdle."}, {"step": "Beat in the yoghurt, and then fold in the flour with the salt, beating on a medium speed until the mixture is thick and smooth. Finally, mix in the milk, then spoon into the tin and bake for 1 hour 10 minutes or until risen and golden. A skewer inserted should come out clean."}, {"step": "Leave the cake to cool in the tin for 20 minutes, and then turn out onto a wire rack to cool."}, {"step": "Make the buttercream by first melting the white chocolate carefully in the microwave, or in a bowl set over a pan of simmering water. Use an electric whisk to soften the butter in a large bowl, and then gradually add the icing sugar and whisk until paler in colour. Beat in the white chocolate until the mixture looks pale and fluffy."}, {"step": "Level off the cake, and then use a serrated knife to divide into three equal layers. Place the bottom layer on a cake stand and spread with a quarter of the icing using a palette knife. Repeat with the second layer before placing the final layer on top. Apply a thin layer of icing over the whole cake to seal in the crumbs, then refrigerate for 20 minutes."}, {"step": "Remove the cake from the fridge, and then apply the final layer of icing all over the cake using a palette knife."}, {"step": "Starting at the base of the cake, begin sticking the eggs to the cake in colour pairs, repeating the pattern all around the cake. For the second row of eggs, repeat the same pattern of colour pairs but shift the pattern one egg to the right."}, {"step": "Build up the layers of eggs one row at a time, shifting to the right each time, until the whole cake is covered. Use the remaining eggs to decorate the top of the cake."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/TV/martha2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}