{"title": "Martha's perfect peanut butter & chocolate chip cookies", "tags": [{"tag": "Children's"}, {"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT14M", "total_time": "PT29M", "serves": "15 cookies"}, "ingredients": [{"item": "140g butter, softened"}, {"item": "125g light brown soft sugar"}, {"item": "100g caster sugar"}, {"item": "125g crunchy peanut butter"}, {"item": "1 British Blacktail Large Free Range Egg, beaten"}, {"item": "250g plain flour"}, {"item": "1/2 tsp bicarbonate of soda"}, {"item": "1/2 tsp baking powder"}, {"item": "125g dark chocolate, chopped into small chunks"}, {"item": "Sea salt flakes, to sprinkle"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3. Grease and line 2 large baking trays with baking parchment or a silicon baking sheet. In a large bowl, beat together the soft butter with both the sugars using a wooden spoon until well combined – there is no need for it to be light and fluffy. Stir in the peanut butter and the beaten egg."}, {"step": "In a separate bowl, combine the flour and raising agents.You need the raising agents to be evenly distributed throughout the cookie dough, so make sure they are well mixed. Add the chocolate. Pour the dry ingredients into the wet mixture and fold in using a spatula until a stiff dough forms."}, {"step": "Use a mechanical ice-cream scoop (a teaspoon or tablespoon will work too, but they won’t be as regularly shaped), to form balls of dough and place onto the trays, leaving enough space for each to spread out. Try not to roll them, as the ragged top created by the scoop will give the cookies their traditional cracked surface."}, {"step": "Bake the cookies for 12-14 minutes, or until the mixture has spread out and browned around the edges. Remove from the oven – they should look undercooked in the middle but they will firm up – sprinkle with sea salt and allow to cool for at least 10 minutes before moving to a cooling rack."}], "nutrition": {"Energy": "1,201kJ 287kcal", "Fat": "16g", "Saturated Fat": "7.8g", "Carbohydrate": "30g", "Sugars": "18g", "Protein": "5.1g", "Salt": "1.3g", "Fibre": "2.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's perfect peanut butter & chocolate chip cookies.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}