{"title": "Martha's homemade pizzas", "tags": [{"tag": "Children's"}], "planning": {"prep_time": "PT30 minutes + proving timeM", "cook_time": "PT12M", "total_time": "PT40-42 minutes + proving timeM", "serves": "4"}, "ingredients": [{"item": "500g strong white bread flour, plus extra for dusting"}, {"item": "7g sachet dried yeast"}, {"item": "10g salt"}, {"item": "2 tbsp olive oil, plus extra for greasing"}, {"item": "Semolina, for dusting (optional)"}, {"item": "½ x 500g pack passata"}, {"item": "400g pack mozzarella, sliced"}, {"item": "Basil leaves, to garnish"}], "instructions": [{"step": "Make the dough by placing the flour, yeast and salt into a large bowl. Make a well in the centre of the flour and pour in the oil, plus 325ml lukewarm water in a steady stream. With the other hand (or with the dough hook attachment on a stand mixer) begin to incorporate the flour into the liquid to form a dough. It should be sticky but not wet."}, {"step": "When the mixture has come together, tip the dough out onto a lightly oiled surface and knead for 10 minutes, or until stretchy. (If using a mixer, knead for 6-8 minutes on medium speed.) It is ready when you are able to perform the ‘windowpane test’ (see tip, below left)."}, {"step": "Shape the dough into a ball and place into an oiled bowl. Cover with a clean tea towel and place in a warm place for 1-2 hours, or until doubled in size."}, {"step": "Dust a tray with a mixture of semolina (if using) and flour. Then turn the risen dough out onto a lightly oiled surface and knead briefly to knock out any irregular air bubbles. Shape into 4 balls, tucking the edges under tightly to form a taut, smooth surface. Place the dough onto the tray, cover and leave to rise for about 45-60 minutes, or until puffy and almost doubled in size."}, {"step": "Meanwhile, preheat the oven to 230°C, gas mark 8 and place a baking sheet or pizza stone in to heat up. With floured hands, take a ball of risen dough and carefully stretch it into a large circle – using the knuckles of both hands, clenched into fists, gradually stretch the dough from underneath until it is as thin as possible without tearing. The dough should be thicker around the edges than it is in the centre."}, {"step": "Transfer the stretched dough floured side down onto a large baking sheet dusted with more semolina or flour. Use your fingers to stretch it as much as possible, then use the back of a spoon to spread a thin layer of passata over the top. Sprinkle with mozzarella and any other topping ingredients, taking care not to overload the pizza."}, {"step": "Place the tray into the oven onto the preheated stone/tray to ensure a crisp base. Bake, checking every few minutes, for 10-12 minutes, or until golden and cooked through."}, {"step": "Serve immediately, cut into slices. Repeat with the remaining dough and toppings (or try my variations, below)."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's homemade pizzas.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}