{"title": "Martha Collison's Mojito macarons", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "35"}, "ingredients": [{"item": "160g ground almonds"}, {"item": "180g icing sugar"}, {"item": "120g egg white (from about 3 large eggs)"}, {"item": "160g caster sugar"}, {"item": "gel food colouring (optional)"}, {"item": "4 tbsp lime curd"}, {"item": "Sprig of fresh mint or peppermint extract"}, {"item": "50g unsalted butter, softened"}, {"item": "150g icing sugar"}, {"item": "4 tbsp white rum"}, {"item": "Zest of 1 unwaxed lime"}, {"item": "75g caster sugar"}], "instructions": [{"step": "Put two 4cm circle templates (see page 81) on two baking trays then cover each with a layer of baking parchment. (Or draw around something roughly 4cm in diameter directly onto the baking parchment.)"}, {"step": "Place the ground almonds and icing sugar into the bowl of a food processor. Blitz until the nuts are really finely ground and well mixed into the sugar. I used to skip this step, thinking it unnecessary, but it is the key to smooth, even macarons. Coarse bits of almond in the batter weigh it down, making it grainy. Transfer the mixture into a large bowl."}, {"step": "Mix half the egg white (60g) into the finely ground almonds and icing sugar and stir until a stiff paste forms. Set this aside while you make the Italian meringue."}, {"step": "Place the caster sugar into a small saucepan with 3 tablespoons of water. Bring to the boil and stir until the sugar has dissolved. When the mixture is clear, stop stirring and heat until the syrup registers 118°C on a sugar thermometer. Meanwhile, put the remaining egg white into a clean, grease-free bowl (any droplets of fat can deflate meringue). As the syrup is nearing 118°C, start whisking the egg white on a high speed in astand mixer or with an electric hand-held whisk until it reaches soft peaks and just holds its shape on the whisk."}, {"step": "Take the syrup off the heat as soon as it is up to temperature and, with the whisk on low, slowly pour the syrup into the egg whites in a steady stream. Make sure you don’t stop whisking, and try to avoid pouring the syrup onto the beaters or it will get messy. Continue to whisk on a high speed until the mixture has cooled slightly and the bowl is no longer hot to touch. It should be thick and glossy. Add any gel food colouring now, if using, as it is easiest to mix it through the macaron mixture at this stage."}, {"step": "Use a spatula to scrape the meringue out of the bowl and onto the almond paste in the large bowl. Fold together until the mixture runs in a thick ribbon from the spatula, disappearing back into the mix within ten seconds. If the mixture is too thick, the piping bag will leave peaks and the shells will not be smooth. Transfer to a piping bag fitted with a 1cm- round nozzle. Pipe 4cm circles onto the baking parchment, using the templates (ordrawn circles) as a guide."}, {"step": "Leave the macarons to dry for at least 30 minutes until a thin skin forms on top; it may take a little longer if the kitchen is humid. They should no longer be sticky to the touch and will have a matt appearance. The skin allows the macarons to withstand the oven temperature for long enough to rise and let the signature ‘foot’ (the lacy bit at the bottom of a macaron) peek out. While you are waiting, preheat the oven to 170°C/150°C fan/gas 2."}, {"step": "Bake in the centre of the oven, one tray at a time, for ten minutes. The shells should not have started to brown, but they should be firm and sound hollow when lightly tapped. Leave to cool for a few minutes before peeling off the parchment."}, {"step": "Put the lime curd into a small bowl and stir briefly to loosen."}, {"step": "Finely chop the mint leaves, then stir them into the curd and mix until well combined. You will end up with a green, speckled curd. One or two drops of peppermint extract will also work, but this will give a much stronger flavour so take care when adding it to the curd. Set aside until needed."}, {"step": "To make the buttercream, put the softened butter and icing sugar into a large bowl and beat using an electric hand-held whisk until it forms a thickpaste."}, {"step": "Add the white rum to the mixture, a tablespoon at a time, and whisk to combine. Continue whisking for a further five minutes to lighten the buttercream; it should be pale and fluffy. If the mixture looks like it has split, addafewtablespoons oficing sugar and it should come back together. Transfer the icing to a piping bag and refrigerate until needed."}, {"step": "Combine the lime zest and caster sugar in a small bowl."}, {"step": "Arrange the shells in pairs, discarding any misshapen or cracked shells. Pipe a ring of buttercream onto half of the shells, then fill the gap in the centre of each with a teaspoonful of lime and mint curd. Sandwich together with the other macaron shells then gently roll in the lime and sugar to give it a crunchy edge. Store them on their sides in the fridge to prevent the filling seeping through for up to four days."}, {"step": "Recipe taken from Twist by Martha Collison, HarperCollins, 2016."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha_Favourite-Macarons_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}