{"title": "Martha Collison's Chocolate Florentine Tarts", "tags": null, "planning": {"prep_time": "PT35M", "cook_time": "PT10M", "total_time": null, "serves": "8"}, "ingredients": [{"item": "50g butter"}, {"item": "50g golden syrup"}, {"item": "50g demerara sugar"}, {"item": "20g mixed peel"}, {"item": "30g dried apricots, finely chopped"}, {"item": "50g dried cranberries, finely chopped"}, {"item": "50g plain flour"}, {"item": "60g flaked almonds"}, {"item": "150ml double cream"}, {"item": "15g unsalted butter"}, {"item": "150g dark chocolate, chopped into small chunks"}, {"item": "Pieces of chopped dried apricot, cranberry and almond to top"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line two baking trays with baking parchment and grease a 12-hole muffin tray with butter."}, {"step": "Weigh the butter, golden syrup and sugar into a large saucepan and heat until the butter has melted and the mixture starts to bubble. Remove from the heat, then add the dried fruit, flour and flaked almonds and mix with a wooden spoon until the mix comes together."}, {"step": "Use a dessert spoon to form 8 small balls out of the Florentine mixture. Place 4 onto each baking tray, making sure that they aren’t too close together as they will spread during baking, and flatten each one slightly. Bake the trays one at a time (if you try to do both together you won’t be able to work quickly enough when shaping the tarts) for 8-10 minutes."}, {"step": "When the Florentines have spread and are golden brown around the edges, remove from the oven and leave to cool for 1-2 minutes or until pliable enough to move without breaking. They will still be very hot, so be careful. Use a palate knife to move the flat Florentine over a hole in the muffin tin and gently push it in. I use a small vanilla bottle that is just smaller than the hole to push the biscuit down firmly, and then use your fingers to mould any gaps closed. Repeat with the remaining Florentines, then leave to cool completely in the tin."}, {"step": "For the filling, warm the cream and butter in a small saucepan until steaming (don’t let it boil). Place the chocolate into a medium bowl, then pour over the hot cream mixture and leave to stand for a few minutes before mixing to form a smooth, shiny ganache."}, {"step": "Fill each Florentine cup up to the top with ganache, then top with a sprinkling of dried fruit and an almond flake. These will keep for a few days in the fridge and are best served at room temperature."}], "nutrition": {"Energy": "1,762kj 423kcal", "Fat": "29.7g", "Saturated Fat": "15.6g", "Carbohydrate": "34.2g", "Sugars": "25.6g", "Protein": "4.8g", "Salt": "0.2g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha-florentine_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}