{"title": "Martha Collison's Malted millionaire's slices", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "24 Slices"}, "ingredients": [{"item": "250g malted milk biscuits or digestive biscuits"}, {"item": "50g Maltesers"}, {"item": "100g butter, plus extra for greasing"}, {"item": "100g soft light brown sugar"}, {"item": "100g butter"}, {"item": "1 x 397g tin condensed milk"}, {"item": "50g golden syrup 1 tbsp malt extract (optional)"}, {"item": "200g dark chocolate, chopped"}, {"item": "50g white chocolate, chopped"}, {"item": "25g Maltesers, halved"}, {"item": "You will also need a 20 x 30cm baking tin and a disposable piping bag (if using)."}], "instructions": [{"step": "Grease the tin and line it with baking parchment. To make the base, blitz the biscuits with the Maltesers in a food processor until they resemble ﬁne breadcrumbs. Alternatively, place the biscuits and Maltesers in a plastic bag, seal the bag and bash them with a rolling pin. Transfer the crumbs to a bowl."}, {"step": "Melt the butter in a saucepan or in the microwave, then pour it into the crumbs and stir so the ingredients are really well combined. Tip the buttered crumbs into the prepared tin and use a spatula to ﬁrmly press them down into an even layer. Pop the tin into the fridge or freezer to chill while you make the caramel."}, {"step": "Place the light brown sugar, butter, condensed milk, golden syrup and malt extract (if using) in a large saucepan and heat gently, stirring until the butter has melted. Turn the heat up and allow to simmer for 10–12 minutes, stirring all the time, until the mixture is thick and has a golden caramel colour."}, {"step": "Pour the hot caramel ﬁlling over the chilled base, leave it to cool for a couple of minutes and return it to the fridge or freezer for 10–15 minutes until it sets ﬁrm."}, {"step": "When the caramel has set, melt the dark chocolate in a heatproof bowl set over a pan of simmering water or in the microwave. Melt the white chocolate in the same way and spoon it into a piping bag (if you wish). Pour the dark chocolate over the set base, then drizzle over the white chocolate and run a skewer or cocktail stick across the top to marble the chocolate. Press in the halved Maltesers and leave to set, then remove from the tin and cut into 24 slices. The millionaire's slices will keep, stored in an airtight container, for up to 1 week."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/MarthaCollison-malted-short_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}