{"title": "Martha Collison's Easter nest cupcakes", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT20M", "total_time": null, "serves": "12 cakes"}, "ingredients": [{"item": "125g butter, softened"}, {"item": "125g light brown soft sugar"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "75g clear honey"}, {"item": "225g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "1 tsp mixed spice"}, {"item": "75ml milk"}, {"item": "75g dark chocolate"}, {"item": "3 x vermicelli nests"}, {"item": "80g pack Mini Eggs"}, {"item": "125g unsalted butter, softened"}, {"item": "250g icing sugar"}, {"item": "2 tbsp milk"}, {"item": "Food colourings"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4, and line a 12-hole muffin tin with 12 muffin cases."}, {"step": "Cream together the butter and brown sugar until pale and fluffy, about 4-5 minutes, using an electric whisk. Beat in the eggs, one at a time, followed by the honey."}, {"step": "In a separate bowl, combine the flour, baking powder and mixed spice. Add this gradually into the butter and egg mixture until a thick batter forms. Finally, stir in the milk."}, {"step": "Divide the mixture between the cupcake cases and bake for 20 minutes, or until the cakes are risen, golden and a skewer inserted comes out clean. Allow the cupcakes to cool completely before decorating."}, {"step": "To make the nests, line a 12-hole mini muffin tin or eggcups with clingfilm. Melt the chocolate over a bain marie or in the microwave until smooth. Carefully separate the vermicelli and stir through the chocolate using a spoon or your hands until completely coated. Divide between the lined holes, not pressing down too firmly, to create messy nests. Make an indent in the centre of each one, then place into the fridge to set."}, {"step": "To make the buttercream, use an electric hand whisk to cream the butter and icing sugar together. When combined, add the milk and whisk again until smooth and light. Add a small amount of food colouring of your desired colour to create a pastel shade."}, {"step": "Use a palette knife to decorate each cupcake, then top with a chocolate nest and a few chocolate eggs."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha-Easter_Waitrose-TV-Easter-Cupcakes_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}