{"title": "Martha Collison's crusty white loaf", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT25M", "total_time": "PT45M", "serves": "1 large loaf (approx 14 slices)"}, "ingredients": [{"item": "500g strong white bread flour"}, {"item": "7g sachet fast-action dried yeast"}, {"item": "10g fine sea salt"}, {"item": "30ml olive oil, plus extra for greasing"}, {"item": "Flour, polenta or semolina, to dust"}], "instructions": [{"step": "Place the flour into a large bowl. Add the yeast to one side of the bowl and the salt to the other. Pour in the olive oil and 250ml warm water then use your hands, a metal spoon or the dough hook attachment on a stand mixer to mix, adding up to 75ml more warm water slowly until a smooth dough forms — you might not need all the water, or you may need a little more."}, {"step": "Knead the dough on a lightly floured surface, or use a stand mixer, until a smooth and elastic dough forms (around 10 minutes by hand and 5 minutes with a mixer). Place the dough into an oiled bowl, cover with oiled clingfilm and leave to rise until doubled in size — at least 1 hour and 30 minutes. The longer you leave it, the better the flavour."}, {"step": "Once the dough has risen, turn it out onto a lightly oiled surface and fold it over on itself a couple of times to knock it back. Shape into a large, taut ball by folding the dough into the middle, then place seam-down on a baking tray dusted with flour, polenta or semolina. Cover with a plastic bag or oiled clingfilm and leave to rise for 45 minutes, or until noticeably larger. When there is 20 minutes left, preheat the oven to 220°C, gas mark 6, and put a roasting tin in the bottom."}, {"step": "When ready to bake, use a serrated knife to slash the top of the bread. Place into the centre of the oven and fill the hot roasting tin with water (this creates steam that stops the bread forming a crust too quickly). Bake for 20-25 minutes, or until a deep golden brown. If you tap the bottom, the bread should sound hollow. Allow to cool on a wire rack before slicing."}], "nutrition": {"Energy": "745kJ 177kcals", "Fat": "3.1g", "Saturated Fat": "0.5g", "Carbohydrate": "31g", "Sugars": "0.2g", "Protein": "5.5g", "Salt": "0.8g", "Fibre": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK-Martha-Collison-crusty-loaf.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}