{"title": "Martha's shortbread Battenberg biscuit", "tags": null, "planning": {"prep_time": "PT30 minutes + chillingM", "cook_time": "PT12M", "total_time": "PT40-42 minutes + chillingM", "serves": "12 biscuits"}, "ingredients": [{"item": "175g plain flour"}, {"item": "50g ground almonds"}, {"item": "75g caster sugar"}, {"item": "150g butter"}, {"item": "1 tsp milk, if needed"}, {"item": "2 tsp Cooks’ Ingredients Raspberry Dust"}, {"item": "Pink food colouring (optional)"}, {"item": "½ tsp almond extract"}], "instructions": [{"step": "Place the flour, ground almonds, caster sugar and butter into a large bowl and use your fingers to rub the butter into the flour. When the mixture resembles fine breadcrumbs, start squeezing it together with your fingers to form clumps. If the mixture is too dry, add a teaspoon"}, {"step": "of milk to the dough to help it come together. Divide the dough equally between two bowls."}, {"step": "To create contrasting colours, stir the raspberry powder and food colouring (if using) through one bowl of mixture and add the almond extract to the other. Knead briefly, then shape into oblongs and wrap in clingfilm. Chill in the fridge for at least 30 minutes to firm up."}, {"step": "Unwrap the pieces of dough and roll each one out into a large rectangle measuring exactly 1cm thick. Try to get the two pieces to roughly the same size (about 10x14cm), then rewrap and place into the fridge to firm up for another 15 minutes."}, {"step": "Apply a very small amount of water to moisten the top of one sheet of dough and carefully press the second layer on top. Trim the edges with a sharp knife to get a perfect rectangle, about 8x12cm. Slice the dough lengthways into 8x1cm strips. Use a little more water to stick 8 pieces of dough together to form a large rectangular 4x4 block of alternating colours, then wrap in clingfilm again and chill for at least 15 minutes, or until ready to bake."}, {"step": "Preheat the oven to 180°C, gas mark 4. Using a sharp knife, slice the block of dough into 12x1cm pieces. Arrange on a parchment-lined baking tray and bake for 10-12 minutes until just beginning to brown. Remove from the oven (they will still feel quite soft) and leave to cool completely and harden."}], "nutrition": {"Energy": "837kJ 201kcal", "Fat": "13g", "Saturated Fat": "6.8g", "Carbohydrate": "18g", "Sugars": "7.2g", "Protein": "2.6g", "Salt": "0.3g", "Fibre": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's shortbread Battenberg biscuits.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}