{"title": "Martha's orange jaffa cakes", "tags": null, "planning": {"prep_time": "PT30 minutes + chilling timeM", "cook_time": "PT10M", "total_time": "PT38-40 minutes + chilling timeM", "serves": "12"}, "ingredients": [{"item": "For the cakes"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "50g caster sugar"}, {"item": "50g plain flour"}, {"item": "1 tbsp olive oil, plus extra for greasing"}, {"item": "200g dark chocolate, finely chopped"}, {"item": "For the jelly"}, {"item": "3 sheets gelatine (5g)"}, {"item": "175ml blush orange juice (2½-3 oranges)"}, {"item": "Zest of 1 orange"}, {"item": "25g caster sugar"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and grease a 12-hole muffin tin with oil. Crack the eggs into a large bowl, or the bowl of a stand mixer fitted with the whisk attachment, and add the sugar. Whisk for around 6-7 minutes on a high speed using an electric whisk – you are looking for the mixture to be thick and foamy, and to leave a trail that lasts for a few seconds."}, {"step": "Sieve the flour over the top of the mixture and carefully fold through, trying to retain as much air as possible. Add the olive oil and mix until combined. Divide the mixture between the holes of the prepared tin and bake for 8-10 minutes, or until spongy and golden. Turn out onto a wire rack and leave to cool completely."}, {"step": "To make the jelly, soak the gelatine leaves in cold water for 5 minutes. Line a 20x20cm baking tray with clingfilm. Zest one of the oranges into a small saucepan and add the orange juice. Add the sugar to the saucepan and gently heat, stirring until the granules have completely dissolved. Remove the pan from the heat. Squeeze any excess water out of the soaked gelatine leaves and add them to the warm juice. Stir until they’re completely melted. Pour the jelly into the lined baking tray and refrigerate, making sure the tray is completely flat, for at least 45 minutes or until set."}, {"step": "Melt the chocolate in a heatproof bowl set over a pan of simmering water, then set to one side to cool slightly so the heat of the chocolate doesn’t melt the jelly. Using a round cutter slightly smaller than the cakes (approx 4.5cm) cut 12 circles of orange jelly and carefully place on top of each cake. Cover with melted chocolate and use a fork to create the hash effect on the top. Allow the chocolate to harden at room temperature before serving. These jaffa cakes will keep for 3 days stored in an airtight container, but are best eaten on the day they are made."}], "nutrition": {"Energy": "709kJ 170kcal", "Fat": "8.9g", "Saturated Fat": "4.6g", "Carbohydrate": "18g", "Sugars": "12g", "Protein": "3.7g", "Salt": "0.1g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's orange Jaffa cakes.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}