{"title": "Martha Collison's bonfire cake", "tags": null, "planning": {"prep_time": "PT1–2 hours + chillingM", "cook_time": "PT35M", "total_time": "PT2 to 3 hours + chillingM", "serves": "12 - 14"}, "ingredients": [{"item": "200g butter"}, {"item": "250g dark muscavado sugar"}, {"item": "100g black treacle"}, {"item": "100g golden syrup"}, {"item": "200ml milk"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "250g plain flour"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "1 tsp ground ginger"}, {"item": "1 tsp ground cinnamon"}, {"item": "250ml double cream"}, {"item": "1 tbsp black treacle"}, {"item": "150g demerera sugar"}, {"item": "100g butter"}, {"item": "200g unsalted butter, softened"}, {"item": "300g icing sugar"}, {"item": "100ml treacle toffee sauce"}, {"item": "100g pecan nuts"}, {"item": "150g caster sugar"}, {"item": "50g marshmallows"}, {"item": "25g pecan nuts"}, {"item": "Waitrose Party Star Sparklers"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 3 and grease and line 3 x 18cm sandwich tins with baking parchment. Heat the butter, sugar, treacle and syrup together in a large saucepan, stirring until the butter is melted and the sugar has dissolved."}, {"step": "Pour and whisk the milk into the saucepan with the hot mixture and then beat in the eggs until well combined. Sift the flour, bicarbonate of soda and spices together into the saucepan and whisk together until smooth."}, {"step": "Pour into the tins and bake in the preheated oven for 30-35 minutes, or until firm and a skewer inserted comes out clean. Leave to cool briefly in the tins before transferring to a wire to cool completely."}, {"step": "While the cakes are cooking, make the treacle toffee sauce. Place the double cream, treacle, sugar and butter into a saucepan and heat gently until the grains of sugar have dissolved. Turn up the heat and allow to boil for 5 minutes, or until the sauce thickly coats the back of a metal spoon. Pour into a jug and place into the fridge until ready to use."}, {"step": "To make the buttercream, put the butter into a large bowl or bowl of a stand mixer. Beat briefly to soften, and then add the icing sugar in a few batches, making sure all the sugar is well incorporated before adding more. Beat for 5-10 minutes until really light and fluffy, then add 100ml of the cool toffee sauce and beat for a few more minutes."}, {"step": "For the pecan brittle, line a baking tray with baking parchment and spread the pecans out over it. Mix together the sugar with 2 tbsp of water in a small saucepan, then heat gently until"}, {"step": "the sugar has dissolved. Turn up the heat and boil without stirring until the caramel turns a deep amber colour, then pour the hot caramel over the pecans and allow to cool completely."}, {"step": "To assemble the cake, place the first layer onto a cake stand and top with about 1/5th of the buttercream. Use a palette knife to spread the buttercream right to the edges of the cake and then top with the second layer of sponge. Repeat the buttercream process and then place the final layer on top. Cover the top and sides of the cake with buttercream, scraping the excess away from the sides with a large palette knife so they are thinly coated and the layers show through. The top should be smooth and the edges crisp. Place the cake into the fridge for at least 30 minutes for the buttercream to set."}, {"step": "Gently heat the remaining caramel sauce in the microwave until it is just pourable, but not warm enough to melt the buttercream. Pour the sauce directly into the centre of the cake and push it right to the edges, gently teasing it down the edges to create drips. Blowtorch the marshmallows to toast them and break the brittle into tall shards. Arrange them on top of the cake and scatter over the brittle crumbs and whole pecan nuts. Add the sparklers just before serving."}], "nutrition": {"Energy": "3,462kJ 828kcals", "Fat": "46.2g", "Saturated Fat": "25.2g", "Carbohydrate": "98g", "Sugars": "82.8g", "Protein": "5.1g", "Salt": "0.8g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK011016-Martha-bonfire-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}