{"title": "Martha Collison's Nutty chocolate babka", "tags": null, "planning": {"prep_time": "PT1 hour plus proving timeM", "cook_time": "PT35M", "total_time": null, "serves": "1 loaf"}, "ingredients": [{"item": "300g strong white bread ﬂour, plus extra for dusting"}, {"item": "1 x 7g sachet fast- action dried yeast"}, {"item": "1 tsp ﬁne salt"}, {"item": "50g caster sugar"}, {"item": "100ml milk"}, {"item": "1 egg"}, {"item": "75g butter, plus extra for greasing"}, {"item": "Oil, for greasing"}, {"item": "100g butter"}, {"item": "150g soft light brown sugar"}, {"item": "75g dark chocolate, chopped"}, {"item": "2 tbsp cocoa powder"}, {"item": "100g toasted mixed nuts (I use almonds, hazelnuts and pecans), roughly chopped"}, {"item": "75g soft light brown sugar"}, {"item": "You will also need a 1 litre loaf tin."}], "instructions": [{"step": "Place the ﬂour in a large bowl, or the bowl of a stand mixer ﬁtted with the dough-hook attachment, and add the yeast to one side of the bowl and the salt and sugar to the other. If you put the salt directly on the yeast it may kill it, which will stop your dough from rising."}, {"step": "Combine the milk and egg in a small jug, then gradually pour the mixture into the bowl with the ﬂour, mixing all the time using your hands or the dough-hook attachment, until a stiff dough forms. Melt the butter, pour it into the dough and mix thoroughly until it is all worked in and the dough is smooth and stiff."}, {"step": "Dust the worktop with ﬂour, tip out the dough and knead it for 5 minutes (or use the dough hook on the stand mixer) until it comes together to form a ball. Grease the bowl you used to mix the dough together with oil, then place the dough back into the bowl, cover with cling ﬁlm or a tea towel and leave to rise for at least 3 hours at room temperature or overnight in the fridge. The dough will rise slowly but won’t fully double. If you chill the dough overnight, make sure to bring it back to room temperature before using."}, {"step": "While the dough is rising, make the ﬁlling. Place the butter and brown sugar in a small saucepan over a medium heat, stirring until the butter has melted, the sugar has dissolved and the mixture is no longer grainy. Remove from the heat and stir in the chocolate until completely melted, then mix in the cocoa powder."}, {"step": "Tip the risen dough out of the bowl on to a lightly ﬂoured worktop and roll it out into a large rectangle about 50cm long and as wide as you can make it. Spread the chocolate mixture over the surface of the dough, right to the edges, then sprinkle the nuts over in an even layer. Roll the dough up tightly into a log shape, beginning the spiral from the 50cm end."}, {"step": "Use a sharp knife to cut the dough in half lengthways. Twist the 2 pieces of dough together in a rope-like formation, with the ﬁlling pointing outwards. Pinch the edges together at both ends to seal the loaf."}, {"step": "Grease the loaf tin with butter and line it with a strip of baking parchment that overhangs at the edges (this will make it easier to remove the loaf), then place the babka into the tin. You might need to squash the dough slightly to make it the right size for the tin – it should ﬁt tightly. Cover the babka with a damp tea towel or plastic bag and leave to rise at room temperature for 1–2 hours, until the dough looks puffy and slightly risen."}, {"step": "While the babka is proving, make the syrup. Combine the sugar and 75ml of water in a small saucepan, and heat until the sugar has dissolved and you can no longer see any grains. Remove from the heat and allow to cool completely."}, {"step": "When you are almost ready to bake the babka, preheat the oven to 200°C/180°C fan/gas 6. Bake the babka for 15 minutes, then reduce the oven temperature to 180°C/160°C fan/gas 4 and bake for a further 15–20 minutes. If the loaf is baking unevenly, rotate it once halfway through the baking time. If the ﬁlling on the top is starting to burn, cover the loaf with a sheet of tin foil."}, {"step": "When the loaf is baked, remove it from the oven and brush it with the syrup. It may look like a lot of liquid to pour over the loaf, but it will keep the babka deliciously moist. Allow to cool completely in the tin before slicing and enjoying. The babka will keep for up to 3 days."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/b/MarthaCollison_babka_-2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}