{"title": "Martha Collison's Easter iced gems", "tags": [{"tag": "Children's"}], "planning": {"prep_time": "PT20-25 minutes  + chillingM", "cook_time": "PT8-10 minutesM", "total_time": null, "serves": "50 gems"}, "ingredients": [{"item": "75g butter, softened"}, {"item": "50g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "25g cornflour"}, {"item": "125g plain flour"}, {"item": "125g royal icing sugar"}, {"item": "50 Cadbury Mini Eggs"}, {"item": "Gel food colourings (optional)"}], "instructions": [{"step": "Preheat the oven to 190ºC, gas mark 5 and line 2 baking trays with baking paper."}, {"step": "Cream the butter, sugar and vanilla together until light and fluffy, and then sift in the cornflour and plain flour and gently mix until it forms a soft dough, adding 1-2 tsp water if too crumbly. You might have to squeeze the dough together with your hands. Wrap in clingfilm and chill for 20 minutes."}, {"step": "Roll out the dough to a 5mm thickness and use a 2.5cm round cutter to cut out tiny biscuits. I use the base of a metal piping nozzle. Arrange on the baking trays and bake for 8-10 minutes until cooked but not browned. They should hold their shape but remain soft. They will harden as they cool."}, {"step": "While the biscuits are cooling, make the topping. Whisk the royal icing sugar and 1 tbsp cold water together using an electric whisk until stiff peaks form, around 7-8 minutes. Add a little more sugar if it looks too wet, or a little more water if it seems too dry. If using, colour with food colouring gel to create a pastel shade."}, {"step": "Use a piping bag with a small closed star nozzle to pipe icing onto each biscuit, then stick a chocolate mini egg onto each one. Leave to harden for at least 2 hours before eating. These will keep in an airtight container for up to 2 weeks."}], "nutrition": {"Energy": "222kJ 53kcals", "Fat": "1.9g", "Saturated Fat": "1.2g", "Carbohydrate": "8.5g", "Sugars": "6.1g", "Protein": "0.4g", "Salt": "trace", "Fibre": "0.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/WRWK_06042017_Iced-Gems.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}