{"title": "Martha's Toffee apple pie", "tags": null, "planning": {"prep_time": "PT25 minutes plus 30 minutes chilling M", "cook_time": "PT35M", "total_time": null, "serves": null}, "ingredients": [{"item": "500g plain flour"}, {"item": "100g icing sugar"}, {"item": "2 tsp ground cinnamon"}, {"item": "250g butter"}, {"item": "2 large Waitrose British Blacktail"}, {"item": "Free Range Eggs"}, {"item": "1kg Bramley apples, about 4-5"}, {"item": "2 tbsp lemon juice"}, {"item": "140g caster sugar"}, {"item": "1 tsp ground cinnamon"}, {"item": "1 tbsp cornflour"}, {"item": "170g toffees, about 20 wrapped sweets 1 medium egg, beaten"}, {"item": "1 tbsp demerara sugar"}], "instructions": [{"step": "To make the pastry, place the flour, icing sugar and cinnamon into a food processor. Pulse briefly to combine. Add the butter in cubes, then continue to pulse the mixture until it resembles breadcrumbs. Beat the eggs in a small jug and pour into the pastry mixture, before pulsing until the pastry starts to clump together."}, {"step": "Tip the pastry onto a clean work surface. There will be some floury patches left at the bottom, so gently knead the mixture until it all comes together in one uniform ball. Divide into one third and two third pieces, wrap in cling film and chill in the fridge for at least 30 minutes."}, {"step": "Preheat the oven to 180°C, gas mark 4. Peel and core the apples and chop each one into 8 pieces. Toss in the lemon juice to stop the apples going brown. Mix in half the caster sugar and cinnamon and spread the apples out on a baking tray. Roast for 10 minutes. Drain off the excess juice and mix in the remaining caster sugar, corn flour and toffees."}, {"step": "Use the larger piece of chilled pastry to line the base of a 24cm pie dish or tart tin with a thin layer of pastry, leaving an overhang. Fill with the apple mixture."}, {"step": "Roll the remaining pastry to a 0.5cm thickness and slice into twelve 4x24cm strips. Create a lattice pattern over the pie, using beaten egg to stick the strips to the pastry base. Remove excess pastry from around the sides and brush the top with the beaten egg and a sprinkling of demerara sugar. Place the tin on a baking tray and bake in the oven for 35 minutes or until golden brown on top and the filling is bubbling."}, {"step": "Leave to sit for 10 minutes before serving to allow the sauce to thicken and cool slightly; you don’t want the toffees to be scalding hot when you eat the pie. Serve with vanilla ice cream or custard."}], "nutrition": {"Energy": "3,228kj 769Kcal", "Fat": "32.9g", "Saturated Fat": "19.1g", "Carbohydrate": "108.7g", "Sugars": "54.1g", "Protein": "9.6g", "Salt": "0.8g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Toffee apple pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}