{"title": "Martha's buttermilk pancakes", "tags": [{"tag": "Children's"}, {"tag": "Vegetarian"}], "planning": {"prep_time": "PT10M", "cook_time": "PT20M", "total_time": "PT30M", "serves": "10"}, "ingredients": [{"item": "125g plain flour"}, {"item": "1 tbsp caster sugar"}, {"item": "1 tsp baking powder"}, {"item": "1/2 tsp bicarbonate of soda"}, {"item": "250ml buttermilk"}, {"item": "1 British Blacktail Medium Free Range Egg"}, {"item": "25g butter, melted"}, {"item": "Butter and maple syrup, for greasing and serving"}], "instructions": [{"step": "In a medium-sized bowl, mix together the flour, caster sugar, baking powder and bicarbonate of soda. Beat together the buttermilk, egg and melted butter in a measuring jug."}, {"step": "Make a well in the centre of the dry ingredients and slowly pour in the wet ingredients, whisking all the time. Continue to mix until a smooth batter forms with no lumps."}, {"step": "Heat a pan over a medium heat and grease lightly with butter, wiping out any excess with kitchen paper. Spoon a few teaspoons of the mixture into the pan as mini test pancakes and see how they cook. Adjust the temperature of the pan accordingly."}, {"step": "When the pan is at the right temperature, use a ladle or ice-cream scoop to dollop the mixture into the pan (not too close together as it will spread). Cook until bubbles appear on the surface and the underside of the pancakes are golden brown, then flip over to cook for another 1-2 minutes, or until they feel spongy and cooked through."}, {"step": "Transfer to a warm plate and cook the rest of the batter in the same way, greasing the pan with butter as needed. Top the pancakes with a knob of butter and drizzle with maple syrup before serving."}], "nutrition": {"Energy": "599kJ 143kcal", "Fat": "7g", "Saturated Fat": "4.2g", "Carbohydrate": "17g", "Sugars": "7g", "Protein": "2.9g", "Salt": "0.5g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's buttermilk pancakes.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}