{"title": "Martha's coffee & walnut glazed cruffin", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT2 hours 30 minutesM", "cook_time": "PT25M", "total_time": "PT2 hours 50 minutes to 2 hours 55 minutesM", "serves": "8"}, "ingredients": [{"item": "100g plain flour"}, {"item": "150g strong white flour"}, {"item": "30g caster sugar, plus 2 tsp to top"}, {"item": "½ tsp salt"}, {"item": "7g sachet fast-action yeast"}, {"item": "200g unsalted butter, diced"}, {"item": "75ml whole milk"}, {"item": "100g icing sugar"}, {"item": "½ tsp espresso powder"}, {"item": "1 tbsp milk"}, {"item": "25g walnuts, chopped"}], "instructions": [{"step": "In the bowl of a food processor, place the flours, sugar, salt, yeast and 100g of the butter. Pulse once or twice, until the butter is coated in flour but is still in fairly large lumps. You need to be able to see chunks of butter, or the dough won’t puff when it is baked."}, {"step": "Remove the bowl from the processor and take out the blade, and then pour 75ml water and milk a little bit at a time into the flour and butter mixture. Use a spatula to gently mix the liquid in until a loose dough forms. You might need to add a few drops more water to mop up any excess flour. Shape the dough into a rectangle and place into the fridge for 45 minutes. Wrap the remaining butter in clingfilm and place into the freezer to chill before the next step."}, {"step": "Lightly flour a clean work surface and tip the chilled dough out onto it. Roll out into a large rectangle three times as long as it is wide, and grate the frozen butter over the top two thirds. Fold the bottom third up over the middle third, and then fold the top third down over that, as if you were folding a letter. Wrap the dough in clingfilm and chill in the fridge for 20 minutes."}, {"step": "Remove the dough from the fridge and turn it 90° so the open end is facing you. Roll the dough out into a rectangle and repeat the folding process again, ending with chilling the dough for 20 minutes. Repeat twice more, so the dough is folded a total of 4 times."}, {"step": "Roll the dough out into a rectangle that is 15 x 40 cm wide. Trim the edges with a sharp knife to help achieve the best puff. Divide the dough lengthways into 8, so you have 8 identical rectangular pieces that measure 5 x 15 cm. Starting at a slight angle, roll each rectangle up tightly into a swirl and place into a muffin tin. Starting at an angle should mean you have more of a cone shape, rather than an ordinary spiral. Repeat with all the dough, then loosely cover and leave to prove for 20-30 minutes."}, {"step": "Preheat the oven to 180°C, gas mark 4. Sprinkle the risen cruffins with caster sugar, then bake in the centre of the oven for 20-25 minutes or until they are a dark golden brown in colour."}, {"step": "While the cruffins are baking, make the glaze. Sieve the icing sugar and espresso powder together in a small bowl, then add the milk and mix thoroughly to form a thick paste."}, {"step": "When the cruffins are baked, leave them to cool in the tin for 5 minutes, then spread the espresso icing on the top while they are still warm. It should drip down into the cruffin, infusing the coffee flavour all the way through. Sprinkle the chopped walnuts over the top and enjoy slightly warm."}], "nutrition": {"Energy": "1,772kJ 425kcals", "Fat": "25.8g", "Saturated Fat": "14.2g", "Carbohydrate": "43g", "Sugars": "19.4g", "Protein": "5.1g", "Salt": "0.3g", "Fibre": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Waitrose-Weekend_Martha_Cruffin.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}