{"title": "Martha's brownie ice-cream sandwich", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "12 large sandwichs"}, "ingredients": [{"item": "1 x My Favourite Brownie"}, {"item": "200ml condensed milk 600ml double cream"}, {"item": "1 tsp vanilla bean paste 100g Oreos, or biscuit of your choice"}, {"item": "You will also need two or three 20 x 30cm brownie tins and an electric hand-held whisk."}], "instructions": [{"step": "Line one 20 x 30cm tin with cling film."}, {"step": "In a large bowl, whisk together the condensed milk, double cream and vanilla using an electric hand-held whisk until the mixture thickens and holds its shape when you take the whisk out. Put the biscuits into a plastic bag and bash them with a rolling pin to make crumbs. If you want larger chunks, you could crumble them by hand. Fold the biscuit crumbs into the ice-cream mixture, then scrape into the prepared tin. Use a spatula to smooth it out, then freeze for at least two hours or until firm."}, {"step": "Preheat the oven to 180°C/160°C fan/gas 4. Make My Favourite Brownie recipe up to step 4, but don’t put the mixture in the tin yet."}, {"step": "Divide the brownie mixture between two lined 20 x 30cm brownie tins (or use one and bake two batches) and use a spatula to spread the batter right into the edges. It will be very thin, as these will be your sandwich layers. Bake each tray for ten minutes, then remove from the oven and leave to cool completely in the tin."}, {"step": "Remove the brownie layers from the tins and re-line one of the tins with another sheet of baking parchment. Put one brownie layer into the tin, then press the ice-cream layer on the top of it. Add the final layer then return to the freezer for at least 30 minutes."}, {"step": "Remove the ice-cream sandwich slab from the freezer about ten minutes before serving. Use a sharp knife or pastry cutter to cut shapes – I like the effect of a circular cutter."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/BrownieIceCreamSandwich_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}