{"title": "Martha's hassleback squash with mojo de ajo", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT20M", "cook_time": "PT50M", "total_time": "PT70M", "serves": "2"}, "ingredients": [{"item": "1 large golden butternut squash"}, {"item": "75ml olive oil, plus 1 tbsp for drizzling"}, {"item": "1 bulb garlic"}, {"item": "Juice of ½ orange"}, {"item": "Juice of 2 limes"}, {"item": "1 tsp pul biber or chilli flakes"}], "instructions": [{"step": "Preheat the oven to 180ºC, gas mark 4. Slice the butternut squash in half lengthways and scoop out the seeds and innards."}, {"step": "Place one half of the squash, skin-side down, on a chopping board. If it rocks, turn it over and slice off a thin layer of the underside so it sits flat. Take two wooden spoons or spatulas of a similar thickness and place either side of the squash (these will act as a buffer to stop you slicing all the way through)."}, {"step": "Use a sharp knife to make thin 3mm thick cuts all the way up the length of the squash, slicing almost all the way through, but not completely. Repeat the process with the second half. Place the squash, cut-side up, onto a baking tray and drizzle with the 1 tbsp olive oil. Bake for 45-50 minutes, or until tender but not mushy."}, {"step": "Meanwhile, make the mojo de ajo. Separate the bulb of garlic into cloves, discard the loose bits of papery husk but don’t peel the individual cloves. Place the garlic into a small roasting tin and pour over 75ml olive oil, or enough so the garlic is submerged. Place the tin into the bottom of the oven and bake for 25-30 minutes. The outside skin of the garlic should turn a golden brown colour and the garlic should feel soft when pressed when it is ready. Remove from the oven, carefully discard the skins and use a fork to mash the caramelised garlic to a pulp in the oil. Stir in the orange juice, lime juice, pul biber or chilli flakes and salt and return to the oven for 5 minutes."}, {"step": "Remove the squash from the oven. Use a spoon to coat the squash with 5-6 tbsp sauce, then return to the oven for 5 -10 minutes to brown slightly. Keep any leftover mojo de ajo in a sealed jar in the fridge where it will keep for up to 1 week."}], "nutrition": {"Energy": "2,223kJ 535kcals", "Fat": "38g", "Saturated Fat": "5.4g", "Carbohydrate": "36g", "Sugars": "20g", "Protein": "5.3g", "Salt": "0.1g", "Fibre": "9.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Waitrose-Weekend_Wk475_Martha-Seasonal-Recipes_Hassleback-Squash-Mojo-De-Ajo.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}