{"title": "Martha's honey & rye bread", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes + proofingM", "cook_time": "PT35M", "total_time": "PT60-65 minutes + provingM", "serves": "1 large loaf"}, "ingredients": [{"item": "200g strong white flour"}, {"item": "200g dark rye flour"}, {"item": "3 tsp fast-action yeast"}, {"item": "2 tbsp cocoa powder"}, {"item": "1 tsp salt"}, {"item": "75g honey"}, {"item": "75g black treacle"}, {"item": "25g butter"}, {"item": "Oil, for greasing"}, {"item": "Semolina, to dust"}, {"item": "2 tbsp jumbo oats"}], "instructions": [{"step": "Mix the flours together in a large bowl. Add the yeast to one side of the bowl and the cocoa powder and salt to the other. Place the honey, treacle and butter into a small pan and heat gently until the butter"}, {"step": "has melted and the mixture is runny. Make a well in the centre of the flour and pour in the honey and treacle, along with 125ml warm water."}, {"step": "Mix together using a round-ended knife until a rough dough forms. Add another 100ml warm water and use one hand to bring it together into a smooth, slightly sticky dough. Oil the work surface lightly, then knead the dough for at least 10 minutes until smooth and elastic. Place into a lightly oiled bowl, cover with clingfilm and leave to prove for about 2 hours, or until doubled in size."}, {"step": "Turn out onto the work surface and knead briefly to knock out any large air bubbles, then shape into a tight round loaf. Place onto a semolina-dusted baking tray and allow to prove, covered with oiled clingfilm, for a further hour."}, {"step": "Preheat the oven to 220°C, gas mark 7 and dust a baking tray with semolina. Place a roasting tin into the bottom of the oven to heat up and boil the kettle. Tip the dough out onto the dusted baking tray, brush the top with a little water and sprinkle with oats. Pour"}, {"step": "a mug of boiling water into the roasting tin in the oven to create a steamy environment, then add the bread on its tray to the shelf above."}, {"step": "Bake for 30-35 minutes, or until the loaf is dark brown and sounds hollow when the underside is tapped. If you’re worried the bread is colouring too quickly, reduce the temperature to 190°C, gas mark 5 for the final 10 minutes of baking. Allow the loaf to cool to room temperature before slicing and enjoying with generous amounts of sea-salted butter. Don’t be tempted to rip it while it’s still piping hot or the structure of the bread won’t have time to set."}], "nutrition": {"Energy": "749kJ 178kcal", "Fat": "3.6g", "Saturated Fat": "1.5g", "Carbohydrate": "30g", "Sugars": "7.9g", "Protein": "4.4g", "Salt": "0.5g", "Fibre": "3.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's honey & rye bread.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}