{"title": "Martha Collison's focaccia", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20-30 minutes + provingM", "cook_time": "PT25-30 minutesM", "total_time": "PT45-60 minutes + provingM", "serves": "12"}, "ingredients": [{"item": "500g strong white bread flour"}, {"item": "7g sachet easy-bake yeast"}, {"item": "2 tsp salt"}, {"item": "50ml olive oil, plus extra for greasing"}, {"item": "Extra virgin olive oil, for drizzling"}], "instructions": [{"step": "Place the flour into a large bowl or the bowl of a stand mixer. Add the yeast to one side of the bowl and the salt to the other. If you put the salt directly onto the yeast, it may kill it, which will stop your dough from rising."}, {"step": "Add 50ml oil and 225ml lukewarm water. Stir the ingredients together using your hands or the dough hook attachment on the mixer until they start to form a rough dough. Gradually add another 75ml warm water. The dough will be very wet, but this is what creates the irregular holes in a focaccia."}, {"step": "Knead for about 10 minutes in your mixer (or liberally oil your worktop, tip the dough out onto it and knead by hand, oiling your hands and the surfaces as necessary) until the dough is really smooth and stretchy. I find it easiest to use a dough scraper to stop it sticking. When you pull the dough apart, the strands should stretch and not break. Oil the bowl, then place the dough back into it and leave to rise until doubled in size – this will take between 1 and 3 hours. While the dough is rising, generously grease a 30x20cm baking tray with olive oil."}, {"step": "Carefully remove the dough from the bowl and turn it onto the baking tray. You don’t want to handle the dough too much at this stage, so don’t knead it, just stretch it out into a large rectangle. Spread it right to the edges of the tray, and use your fingers to make indentations over the surface. Cover loosely with oiled clingfilm and leave to rise for another 30 minutes. The dough should look puffy when it is ready to bake."}, {"step": "Preheat the oven to 220°C, gas mark 7. When the focaccia is risen, press a few more indentations into the surface, drizzle with oil and top with the topping of your choice. Bake for 25-30 minutes until golden brown. Drizzle with extra virgin olive oil as soon as it comes out of the oven, then allow to cool on a cooling rack."}], "nutrition": {"Energy": "857kJ 204kcals", "Fat": "6.7g", "Saturated Fat": "1g", "Carbohydrate": "30g", "Sugars": "trace g", "Protein": "5.3g", "Salt": "0.8g", "Fibre": "1.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK020818 Martha Collison focaccia.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}