{"title": "Martha's malted milk piñata cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "12"}, "ingredients": [{"item": "120g butter, plus extra for greasing"}, {"item": "125g caster sugar"}, {"item": "250g soft light brown sugar"}, {"item": "300g plain flour"}, {"item": "3 tsp baking powder"}, {"item": "2 tbsp Horlicks or other malted milk powder"}, {"item": "½ tsp salt"}, {"item": "300ml whole milk 3 eggs"}, {"item": "1 tsp vanilla bean paste"}, {"item": "50ml whole milk"}, {"item": "2 tbsp Horlicks or other malted milk powder"}, {"item": "150g unsalted butter, softened"}, {"item": "350g icing sugar"}, {"item": "Approx 300g milk bottle sweets (ideally the floury kind, they are less sticky)"}, {"item": "Coloured paper straws"}, {"item": "You will also need three 18cm round tins and a stand mixer or an electric hand-held whisk."}], "instructions": [{"step": "Preheat the oven to 180°C/160°C fan/gas 4. Grease three 18cm tins and line with baking parchment."}, {"step": "Put the butter, sugars, flour, baking powder, Horlicks and salt into the bowl of a stand mixer fitted with the paddle attachment. Mix on low until all the butter is rubbed into the dry mixture and it has a sandy texture. Alternatively, rub the butter into the dry ingredients by hand, as if you were making pastry."}, {"step": "In a small jug, beat together the milk, eggs and vanilla. Pour the mixture down the side of the bowl into the dry ingredients and beat until everything is mixed together. When all the liquid has been added, beat on a high speed for two minutes until it is well combined and smooth. Alternatively, you could use an electric hand-held whisk."}, {"step": "Divide the mixture evenly between the prepared tins and bake in the preheated oven for 25–30 minutes until golden brown. The cake will look slightly darker than you might expect with the added malted milk powder, so be more vigilant in checking that it is ready."}, {"step": "To make the buttercream, heat the milk and malted milk powder in a small saucepan. Whisk until all the lumps of powder have dissolved and the mixture has thickened slightly. Set aside to cool. Beat the butter in a large bowl until smooth, then gradually add the icing sugar and cool malted milk paste. Use an electric hand-held whisk to beat the buttercream for 5–10 minutes until light and fluffy. It should hold its shape but still be fairly soft."}, {"step": "To assemble the cake, stack the bottom two layers on top of each other and use a circular 9cm cutter to remove the middle. Press through both layers at once to make sure the holes line up."}, {"step": "Put the bottom ring on a cake stand and cover the top with a layer of buttercream using a palette knife. Try not to get icing too close to the middle, because moisture on the sweets will cause them to become sticky."}, {"step": "Put the second ring on top of the first and fill the hole with milk bottle sweets. Make sure it is filled to the same level as the sponge or the top sponge will cave in. Cover the second ring with buttercream then add the final sponge. Thinly cover the whole cake with some of the buttercream to trap any crumbs, then chill for a minimum of 30 minutes."}, {"step": "Cover the cake with the remaining buttercream, placing a large dollop on the top to create a swirl. Decorate using more milk bottle sweets and coloured paper straws."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/MaltedMilkBottleCake_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}