{"title": "Martha Collison's Blackberry & honeycomb ombre cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "10 - 12"}, "ingredients": [{"item": "butter, for greasing"}, {"item": "2 x My Favourite Chocolate Cake recipe"}, {"item": "150g blackberries 100g caster sugar"}, {"item": "100g caster sugar"}, {"item": "4 tbsp golden syrup"}, {"item": "11⁄2 tsp bicarbonate of soda"}, {"item": "250g unsalted butter, softened"}, {"item": "600g icing sugar 1 tsp milk"}, {"item": "TO DECORATE 12 blackberries"}, {"item": "Mint leaves (optional)"}, {"item": "You will also need three 18cm round tins and an electric hand-held whisk."}], "instructions": [{"step": "Preheat the oven to 180°C/160°C fan/ gas 4 then grease three 18cm tins and line with baking parchment."}, {"step": "Make two batches of My Favourite Chocolate Cake recipe and divide between the three tins."}, {"step": "Bake for 25–30 minutes until risen and a skewer inserted comes out clean. Leave to cool in the tins for ten minutes before turning out onto a cooling rack."}, {"step": "To make the jam, put the blackberries, sugar and 50ml of water into a small saucepan and simmer for 15 minutes. Stir often, gently crushing the blackberries so they release their colour. Drain the purple syrup into a small heatproof jug using a sieve, and reserve the pulp to fill the cakes."}, {"step": "To make the honeycomb, put the sugar and golden syrup into a medium saucepan. Boil until it turns a dark golden colour, then remove from the heat and quickly whisk in the bicarbonate of soda. The mixture will froth up and is extremely hot, so be careful. Pour out onto a piece of baking parchment and leave to harden before breaking into shards."}, {"step": "To make the buttercream, beat the butter and icing sugar together until smooth and light. This takes around ten minutes with an electric hand-held whisk. Put one third of the icing into a small bowl and add five teaspoons of the blackberry syrup. Repeat with another third in a separate bowl, only using one teaspoon of syrup this time. If the icing splits, add a few tablespoons of icing sugar and it should come back together. Add the milk to the remaining white icing to loosen it slightly. You should now have three different shades of icing that are all the same consistency."}, {"step": "Take the cooled sponges and sandwich them together with a little of the white icing and the pulp leftover from making the syrup. Cover the top and sides of the top layer of the cake with the white icing, applying it thickly as a lot will be scraped off later."}, {"step": "Cover the bottom third of the cake with a thick layer of the darkest icing, then fill in the gap between the two colours with the pale purple. Use a large palette knife, set at a 45° angle to the cake, to scrape off the excess icing and create a smooth finish. The colours should blend together slightly, creating the ombre effect."}, {"step": "Transfer the leftover icing into a piping bag fitted with a closed star nozzle. You can gently mix all the colours together to get a rippled effect. Pipe a wiggly border around the top of the cake, then decorate with honeycomb, blackberries and a few mint leaves, if you like."}, {"step": "Recipe taken from Twist by Martha Collison, HarperCollins, 2016."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/OmbreCake_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}