{"title": "Martha's cinnamon rolls", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes + provingM", "cook_time": "PT15M", "total_time": "PT42 to 45 minutes + provingM", "serves": "12"}, "ingredients": [{"item": "For the dough"}, {"item": "75g butter"}, {"item": "100ml semi-skimmed milk"}, {"item": "250g plain flour"}, {"item": "250g strong plain flour"}, {"item": "7g easy bake/quick yeast"}, {"item": "25g caster sugar"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "Oil, for greasing"}, {"item": "For the filling"}, {"item": "125g butter, softened"}, {"item": "150g dark brown soft sugar"}, {"item": "1½ tsp ground cinnamon"}, {"item": "½ tsp ground nutmeg"}, {"item": "For the topping"}, {"item": "25g butter, softened"}, {"item": "50g cream cheese"}, {"item": "100g icing sugar"}, {"item": "½ tsp vanilla extract"}], "instructions": [{"step": "Cut the butter into cubes and place into a saucepan with the milk. Warm over a low heat until the butter melts, then set to one side to allow the mixture to cool."}, {"step": "Place the flours into a large bowl and add the yeast and sugar. Add 100ml warm water to the milk and butter mixture, then beat in the eggs. Gradually add this to the dry mixture, stirring all the time, until a sticky dough forms. You may not need all the milk mixture – you want to add just enough so you have a sticky but not wet dough."}, {"step": "Turn the dough out onto a lightly oiled surface and knead for 10-15 minutes or until it is no longer sticky and has become smooth and elastic. Place into an oiled bowl, cover, and leave in a warm place for 1-2 hours or until the dough doubles in size."}, {"step": "To make the cinnamon filling, beat together the soft butter with the sugar, cinnamon and nutmeg until it is a smooth paste. Set aside. When the dough has risen, turn it out onto the oiled surface and fold it in on itself a couple of times to knock out any large air bubbles. Then roll it out to a large rectangle approximately 40x60cm (1.5 times as long as it is wide), getting it as thin as possible."}, {"step": "Use a spatula or palette knife to spread the cinnamon filling over the dough in an even layer. Then, starting at the shorter edge, tightly roll the dough up into a log. Trim the ends and divide the dough into 12 even-sized pieces (see cook’s tip, below). Place into a baking tin leaving a few centimetres between each to allow them to rise."}, {"step": "Cover the buns loosely with a clean tea towel and leave to rise for 30 minutes or until puffy and visibly larger in size. While the buns are rising, preheat the oven to 200°C, gas mark 6. Prepare the topping by beating together all the ingredients until smooth."}, {"step": "Bake the buns for 12-15 minutes or until golden brown on top and beautifully risen. Allow to cool for a few minutes (the cinnamon sugar will have bubbled up) then smear with the topping while the buns are warm so it drips into all the crevices. Allow to harden slightly, then serve as soon as possible!"}], "nutrition": {"Energy": "1,703kJ 406kcal", "Fat": "18g", "Saturated Fat": "11g", "Carbohydrate": "54g", "Sugars": "23g", "Protein": "6g", "Salt": "0.4g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's cinnamon buns.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}