{"title": "Martha's rhubarb & custard tartlets", "tags": null, "planning": {"prep_time": "PT40 minutes, plus 45 minutes chilling timeM", "cook_time": "PT25-30 minutesM", "total_time": "PT1h 10 minutes, plus 45 minutes chilling timeM", "serves": "4 small tartlets"}, "ingredients": [{"item": "275g plain flour"}, {"item": "25g ground almonds"}, {"item": "50g icing sugar"}, {"item": "175g cold, unsalted butter, diced"}, {"item": "¼ tsp salt"}, {"item": "1 medium Waitrose British Blacktail Egg, yolk only"}, {"item": "250g rhubarb"}, {"item": "25g caster sugar"}, {"item": "2 tbsp clear honey"}, {"item": "Juice of half a lemon"}, {"item": "1 tsp vanilla bean paste"}, {"item": "4 medium Waitrose British Blacktail Eggs, yolks only"}, {"item": "50g caster sugar"}, {"item": "125ml double cream"}, {"item": "125ml whole milk"}, {"item": "1 tsp vanilla bean paste"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and grease 4 x 11cm diameter and 4cm deep tartlet tins with butter."}, {"step": "Put the flour, almonds, icing sugar, butter and salt into the bowl of a food processor. Pulse the butter into the flour until it resembles coarse breadcrumbs – it is fine to still have a few lumps of butter. Alternatively, you could rub the butter into the flour mixture with your fingertips if you don’t have a processor. Add the egg yolk and"}, {"step": "tbsp of cold water and pulse until the dough just starts to come together. You might need to add a bit more water if it looks too dry."}, {"step": "Tip the dough out on to the work surface and lightly knead until the pastry is smooth and just uniform. Chill in the fridge for at least 30 minutes before rolling out."}, {"step": "While the pastry is chilling, chop the rhubarb into small pieces and place into a saucepan with the sugar, honey, lemon juice and vanilla bean paste. Simmer over a medium heat for 20-30 minutes until it is thick and jam-like. Remove the compote from the heat and leave to cool."}, {"step": "Remove the pastry from the fridge and roll out until it is about 0.5cm thick. (I roll pastry between 2 pieces of clingfilm to stop it sticking to the work surface.) Use the pastry to line the prepared tartlet tins, then return the tarts to the fridge to chill for a further 15 minutes. Prick the pastry with a fork, then place a square of baking parchment and some baking beans into each. Bake for 15 minutes, then remove the beans and parchment and bake for"}, {"step": "a further 10 minutes until the pastry cases are a light golden brown. Set to one side to cool and lower the oven to 140°C, gas mark 3."}, {"step": "For the custard, whisk the egg yolks and sugar together until pale and well combined. Place the cream and milk into a saucepan and add the vanilla. Heat over a medium heat until almost boiling, and then pour the hot mixture into the eggs in a steady stream, whisking all the time or the eggs will curdle."}, {"step": "Spread a thin layer of the compote into the bottom of each tart case, and transfer the remainder into a piping bag. Bring the tarts as close to the oven as possible, then carefully fill with the egg custard. Bake for 25-30 minutes, or until the custard is set but slightly wobbles in the middle. After 15 minutes baking, open the oven and carefully pull out the tarts. They should be set enough so you can pipe a heart on to the top of each. Return the tarts to the oven for the last 15 minutes’ baking time."}, {"step": "Once set, take them out of the oven, leave to cool completely, then remove from the tins and serve."}], "nutrition": {"Energy": "3,536kJ 851kcals", "Fat": "62.9g", "Saturated Fat": "36g", "Carbohydrate": "62g", "Sugars": "47.5g", "Protein": "9.1g", "Salt": "0.4g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Marth---Rhubarb-&-custard-tartlets-WEB.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}