{"title": "Martha's white chocolate joy cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes + coolingM", "cook_time": "PT30M", "total_time": "PT55-60 minutes + coolingM", "serves": "12"}, "ingredients": [{"item": "For the sponge"}, {"item": "175g white chocolate, chopped"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "225ml milk"}, {"item": "375g plain flour"}, {"item": "250g caster sugar"}, {"item": "1 tbsp baking powder"}, {"item": "150g butter, diced and softened"}, {"item": "1 tsp vanilla extract"}, {"item": "For the syrup"}, {"item": "150g passion fruit pulp (about 6 fruits)"}, {"item": "50g caster sugar"}, {"item": "For the buttercream"}, {"item": "175g white chocolate, chopped"}, {"item": "225g unsalted butter, diced and softened"}, {"item": "225g icing sugar"}, {"item": "75ml double cream"}, {"item": "Pomegranate seeds and white chocolate balls, to decorate"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3. Grease and line 3x18cm round loose-bottomed tins with baking parchment."}, {"step": "Melt the chocolate for the sponge in a heatproof bowl, set over a pan of simmering water, then set aside. Place all the remaining sponge ingredients into a large bowl and beat for 2-3 minutes, or until a smooth, thick batter forms. Fold in the melted chocolate, then spoon into the 3 prepared tins (see tip)."}, {"step": "Smooth the tops, then bake for 25-30 minutes, or until a skewer inserted into the centre of each cake comes out clean and they are golden brown. Cool for 5 minutes in the tins, then transfer to a wire rack and allow to cool completely."}, {"step": "For the syrup, scoop the passion fruit pulp (reserving 2 of the empty skins for decoration) into a saucepan and add the caster sugar. Heat gently until the seeds are shiny and the liquid is bubbling, then remove from the heat and allow to cool completely."}, {"step": "For the buttercream icing, melt the white chocolate in a heatproof bowl over a pan of simmering water, then set aside. Use an electric whisk to beat the butter, then gradually add the icing sugar until combined. Add the double cream and beat for 5 minutes until light and fluffy, then beat in the cooled chocolate until smooth."}, {"step": "Stack the sponges, layering with buttercream and passion fruit syrup, then spread the top with the remaining buttercream. Drizzle with syrup and cover with pomegranate seeds, passion fruit skins filled with syrup and white chocolate balls. This cake will keep for 2-3 days in the fridge, but is best eaten immediately."}], "nutrition": {"Energy": "3,091kJ 739kcal", "Fat": "40g", "Saturated Fat": "24g", "Carbohydrate": "87g", "Sugars": "63g", "Protein": "7.4g", "Salt": "0.8g", "Fibre": "2.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's white chocolate joy cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}