{"title": "Martha Collison's Mint chocolate ice cream cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "10 - 12"}, "ingredients": [{"item": "Butter, for greasing"}, {"item": "2 x My Favourite Chocolate Cake recipe"}, {"item": "250g unsalted butter, softened"}, {"item": "600g icing sugar"}, {"item": "1 tsp peppermint extract"}, {"item": "1-2 tsp milk"}, {"item": "Green gel food colouring"}, {"item": "25g dark chocolate, chopped into very small cubes"}, {"item": "100g dark chocolate, chopped"}, {"item": "1 ice cream cone"}, {"item": "Sprinkles, to decorate"}, {"item": "125g dark chocolate, chopped"}, {"item": "75g butter"}, {"item": "You will also need three 18cm round tins and an electric hand-held whisk."}], "instructions": [{"step": "Preheat the oven to 180°C/160°C fan/gas 4 then grease three 18cm tins and line with baking parchment."}, {"step": "Make two batches of My Favourite Chocolate Cake recipe, divide between the tins then bake for 25–30 minutes until risen and a skewer inserted comes out clean. Leave to cool in the tin for ten minutes before turning  out onto a cooling rack."}, {"step": "To make the buttercream, beat the butter and icing sugar together using an electric hand-held whisk until really light and fluffy. Start on a slow speed to mix in the sugar, then turn up the speed to incorporate as much air as possible. Add the peppermint extract and enough milk to loosen  the icing a little. Add a tiny amount of green food colouring, being really careful to tint the icing just enough to resemble the classic ice-cream – you don’t want it too dark."}, {"step": "Sift the dark chocolate cubes to remove any chocolate dust or flakes as these will turn the icing brown and make it look less authentic. Fold the chips into the icing by hand."}, {"step": "Use a palette knife to spread some of the mint buttercream onto each cake, then stack the layers on top of each other. Cover the whole cake  with the remaining icing, smoothing the top and sides as much as possible. You don’t need to crumb coat this cake, as the chocolate crumbs will blend into the mint chocolate chip icing. Chill the cake for at least 30 minutes."}, {"step": "To make the ice-cream ball, melt the chocolate in a small heatproof bowl over a pan of simmering water. When it is completely melted, add1 tablespoon of water and stir quickly. The chocolate will seize and go grainy, which while usually undesirable, creates a great ball of ‘ice- cream’. You may need to add a little more water. When the mixture is thick, use an ice-cream scoop to make a large ball. Gently put into the cone and leave to cool."}, {"step": "To make the chocolate drizzle, melt the chocolate and butter together in another small heatproof bowl over a pan of simmering water. When smooth, leave to cool for five minutes before carefully pouring over the top of the chilled cake. Use the back of a spoon to encourage the glaze to run over the edges of the cake."}, {"step": "Put the ice-cream cone face down into the middle of the glaze, then arrange a few sprinkles around the centre."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/IceCreamCake_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}