{"title": "Martha's peach & raspberry Battenberg", "tags": null, "planning": {"prep_time": "PT45 minutes + coolingM", "cook_time": "PT25M", "total_time": "PT65-70 minutes + coolingM", "serves": "8 - 10"}, "ingredients": [{"item": "410g can essential Waitrose Peach Halves In Fruit Juice, drained and chopped"}, {"item": "1 tsp vanilla bean paste"}, {"item": "150g raspberries"}, {"item": "175g butter, softened"}, {"item": "175g caster sugar, extra to decorate"}, {"item": "3 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "175g self-raising flour"}, {"item": "40g ground almonds"}, {"item": "Orange and pink food colours, such as Dr Oetker Gel Food Colour"}, {"item": "4 tbsp apricot jam"}, {"item": "500g golden marzipan"}, {"item": "Fresh raspberries, to decorate"}], "instructions": [{"step": "Place the chopped peaches into a saucepan with the vanilla and heat over a medium heat, mashing the peaches with a fork until they are pulpy and soft, about 3-5 minutes. Then push the mixture through a sieve (or blend in a small food processor) until you have a smooth purée. Return the purée to the saucepan and boil for a further 5-10 minutes to condense and concentrate the mixture until about 100g remains. Repeat with the raspberries, sieving out the seeds and then condensing the mixture until 75g remains. Allow both fruit purées to cool to room temperature before using."}, {"step": "Preheat the oven to 180°C, gas mark 4, and grease and line a 20cm square tin with baking parchment. To divide the tin, fold a tall pleat in the centre of the baking parchment, pulling it up to separate the two halves."}, {"step": "Cream together the butter and sugar until pale and fluffy, about 4-5 minutes using an electric whisk. Beat in the eggs, one at a time. If the mixture curdles, add a tablespoon or two of the flour to bring it together."}, {"step": "In a separate bowl, combine the flour and ground almonds. Add this gradually to the butter and egg mixture until a thick batter forms. Scoop half the mixture into a separate bowl."}, {"step": "Add the peach purée and a small amount of orange food colouring to one half of the batter, and do the same to the other half with the raspberry purée and pink food colouring. Spread the pink mixture into one half of the tin and the orange mixture into the other half, with the parchment dividing them, and bake for 20-25 minutes or until risen and golden. Allow the cakes to cool completely on a wire rack."}, {"step": "Use a serrated knife to trim the edges and then cut two strips, 2cm square, from each cake. I use a ruler to measure accurately."}, {"step": "Gently warm the apricot jam and sieve it to remove any lumps. Stick one peach and one raspberry strip of cake together using the jam, then stack the alternate colour on top of the bottom layer to create the chequerboard effect."}, {"step": "Roll out the marzipan into a large rectangle, trimming the edges so the rectangle is approximately 18cm x 20cm. Brush the top and sides of the assembled cake with the remaining jam and then place top-side down onto the marzipan along the short edge. Brush the face-up side of the cake with jam before tightly rolling it up in the marzipan until it is covered."}, {"step": "Trim the ends of the cake using a serrated knife and move the Battenberg onto a presentation plate. Decorate using fresh raspberries and a sprinkling of sugar on top."}], "nutrition": {"Energy": "2,287kJ 546kcals", "Fat": "25.2g", "Saturated Fat": "10.4g", "Carbohydrate": "72g", "Sugars": "58.9g", "Protein": "7.7g", "Salt": "0.5g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Waitrose-Weekend_Wk307_Matha_Peach-&-Raspberry-Battenberg-Cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}