{"title": "Martha's chocolate & raspberry torte", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT45-50 minutesM", "cook_time": "PT20 minutes + chillingM", "total_time": "PT65 minutes + chillingM", "serves": "12"}, "ingredients": [{"item": "200g butter"}, {"item": "200g plain chocolate"}, {"item": "150g ground almonds"}, {"item": "6 medium Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "175g caster sugar"}, {"item": "300g raspberries"}, {"item": "100g butter"}, {"item": "140g plain chocolate"}, {"item": "1 tbsp golden syrup"}, {"item": "120ml double cream"}], "instructions": [{"step": "Grease and line the base of a 20cm springform or loose-bottomed cake tin with baking parchment. Preheat the oven to 180°C, gas mark 4."}, {"step": "In a large glass bowl set over a saucepan of boiling water, melt the butter and chocolate over a low heat. Stir in the ground almonds, then allow to cool for 5 minutes."}, {"step": "Whisk the egg whites in a very clean bowl with an electric whisk until stiff peaks form. In a separate bowl, beat together the egg yolks and sugar using the electric whisk until pale and creamy (there’s no need to wash the beaters between whisking egg whites and the yolks). Stir the egg yolk and sugar mixture into the chocolate mixture until combined."}, {"step": "Add a large spoonful of whisked egg whites to the chocolate mixture to loosen it then, using a large metal spoon, carefully fold in the rest. Spoon the batter into the cake tin and bake on the middle shelf for 45-50 minutes until the cake is risen and firm to the touch. Leave the cake to cool in the tin for 15 minutes, then turn out onto a wire rack to cool completely."}, {"step": "To make the ganache, melt together the butter, chocolate and golden syrup in a large glass bowl over a saucepan of boiling water. When the ingredients are fully melted, stir in the cream and place into the fridge to set."}, {"step": "When the cake is completely cold, melt half the ganache in the microwave in a small jug. Place the cake on a wire rack over a large bowl or tray and pour the melted ganache over the cake to glaze. Encourage it down the sides using a palette knife. Return the cake to the fridge for 30 minutes to set."}, {"step": "Transfer the remaining unmelted ganache into a disposable piping bag fitted with a closed star nozzle and pipe vertical lines across the top of the cake. Alternate lines of ganache and raspberries, and then chill until ready to serve. This will keep for up to 2 days in the fridge."}], "nutrition": {"Energy": "2,431kJ 585kcals", "Fat": "45.4g", "Saturated Fat": "23.6g", "Carbohydrate": "35.4g", "Sugars": "33.5g", "Protein": "8.8g", "Salt": "0.5g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha's Chocolate & Raspberry Torte.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}