{"title": "Martha Collison's Lemon meringue profiteroles", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "About 30 profiteroles"}, "ingredients": [{"item": "75g butter, diced 1 tsp caster sugar 50g plain ﬂour"}, {"item": "50g strong bread ﬂour 3 eggs"}, {"item": "250ml double cream 100g lemon curd, plus 2 tbsp for drizzling"}, {"item": "Grated zest of 1 unwaxed lemon"}, {"item": "150g caster sugar 2 egg whites"}, {"item": "You will also need three disposable piping bags, a sugar thermometer and a blowtorch."}], "instructions": [{"step": "Preheat the oven to 180°C/160°C fan/gas 4 and line 2 large baking sheets with baking parchment."}, {"step": "To make the pastry, place the butter, sugar and 125ml of water in a small saucepan over a medium–high heat. Bring the mixture to a rolling boil, and when all the butter has melted add the ﬂours and vigorously beat the mixture with a wooden spoon until a smooth ball of dough forms."}, {"step": "Keep the pan on the heat and continue to cook the dough, stirring rapidly, for a further minute. Tip the dough into a bowl and leave it to cool until it has stopped steaming, to avoid scrambling the eggs."}, {"step": "Beat the eggs together brieﬂy in a small jug. Add the eggs to the cooled dough in three separate additions, beating well between each one with a wooden spoon or spatula, mixing until it turns into a thick paste. You might not need to add all the egg so when you are adding the ﬁnal amount, add it slowly. Your mixture should fall off the spoon or spatula easily and leave a ‘V’ shape. Spoon the choux pastry into one of the piping bags."}, {"step": "Snip the end off the piping bag and pipe the dough into about thirty 2.5cm balls on the baking sheets, leaving enough space for them to spread out. Use a wet ﬁnger to smooth over any peaks. Bake for 20–25 minutes or until risen, golden brown and hollow, then turn off the oven and leave them in the oven (with the door closed) to cool completely. This will dry out the pastry."}, {"step": "While the pastry is drying, make the lemon cream ﬁlling. Whip the cream in a large bowl until it forms soft peaks, then fold it through the lemon curd and lemon zest. Spoon the mixture into a piping bag, and set it to one side."}, {"step": "To make the meringue topping, put the sugar in a small saucepan with 75ml of water over a medium heat and stir until the grains of sugar have dissolved, then bring the mixture to the boil and put a sugar thermometer in the pan."}, {"step": "While the syrup is heating up, whisk the egg whites in a clean, grease-free bowl using an electric hand-held whisk or a stand mixer until they form soft peaks."}, {"step": "When the sugar syrup reaches 1180C, pour it gradually down the side of the bowl into the whites, whisking all the time. Try to avoid pouring the syrup on to the beaters, as this will create hard sugar crystals. Continue to whisk the meringue for 10 minutes until it is really thick and glossy. Spoon the meringue mixture into the third piping bag so it is ready to use."}, {"step": "Pierce a small hole in the bottom of each cooled proﬁterole, snip the end off the lemon-cream piping bag and ﬁll the proﬁteroles with the lemon cream. Arrange about 10 proﬁteroles on a large serving plate as the bottom layer. Construct a pyramid, using a little meringue as glue."}, {"step": "Pipe the meringue mixture around the proﬁterole stack. Use a blowtorch to brown the meringue to get the full lemon-meringue effect! Drizzle lemon curd over the top of the stack as a ﬁnishing touch."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/profiteroles_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}