{"title": "Martha Collison's fondant fancies", "tags": null, "planning": {"prep_time": "PT1 hour + 1 hour chillingM", "cook_time": "PT30M", "total_time": "PT2 hours 30 minutesM", "serves": "20"}, "ingredients": [{"item": "200g unsalted butter, softened"}, {"item": "200g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "4 medium essential Waitrose Free Range Eggs"}, {"item": "200g self-raising flour"}, {"item": "½ tsp salt"}, {"item": "1 tsp baking powder"}, {"item": "200g marzipan"}, {"item": "150g unsalted butter, softened"}, {"item": "175g icing sugar"}, {"item": "1kg white fondant icing"}, {"item": "150ml water"}, {"item": "½ tsp rosewater (optional)"}, {"item": "Pink and yellow gel food colouring"}, {"item": "50g plain chocolate"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4 and grease and line a 20cm square tin with baking parchment."}, {"step": "Using an electric whisk or stand mixer, cream together the butter and sugar until light and fluffy. Add the vanilla extract and then the eggs, one at a time, mixing well between each addition. Don’t worry if the mixture curdles – it will come back together when you add the flour."}, {"step": "Combine the flour, salt and baking powder in a small bowl, then beat into the egg and butter mixture. Mix for a further minute until you get a smooth, thick batter. Spread the mixture into the prepared tin and bake for 30 minutes, or until a skewer inserted comes out clean. Allow the cake to cool in the tin, then remove and freeze for at least 30 minutes. Meanwhile, roll out the marzipan between 2 pieces of baking parchment into a large square shape the same size as the cake."}, {"step": "To make the buttercream, beat the softened butter with the icing sugar using an electric whisk until light and fluffy."}, {"step": "Spread a thin layer of buttercream on the top of the cold cake, then apply the marzipan over the buttercream in a smooth layer. Trim the edges of the cake neatly using a serrated knife – all the edges must be straight and neat. Use a ruler to slice the cake into 20 4cm x 4cm squares (you will have some cake left over) and cover the vertical sides of each cake with a thin layer of buttercream. Transfer the remaining buttercream to a piping bag and pipe a small blob on top of the marzipan on each cake. Chill the cakes again for at least 30 minutes, or until the buttercream is firm."}, {"step": "To make the icing, break the fondant into small chunks and place into the bowl of a stand mixer with the paddle attachment. With the mixer on low speed, gradually add the water, churning until the fondant starts to break down. The icing will become smooth and more liquid – you want it to be pourable. Add the rosewater, if using, and split the mixture in two before adding each food colour separately. (If you want to drizzle the cakes with a white icing, put 2 tablespoons of the icing into a piping bag before adding the colouring.)"}, {"step": "Set the chilled cakes on a wire rack with a sheet of baking parchment underneath. Dip the cakes into the icing using a fork, or spoon the icing over the cakes to cover them. Place back onto the wire rack and allow to drip. You can give them a second coat if the icing looks a bit thin."}, {"step": "Melt the plain chocolate in the microwave, then pipe the chocolate or white icing over the top of the cakes in a zigzag pattern. Allow to set at room temperature for at least 3-4 hours before serving."}], "nutrition": {"Energy": "2,080kJ 495kcals", "Fat": "18.4g", "Saturated Fat": "10.6g", "Carbohydrate": "78.5g", "Sugars": "70.2g", "Protein": "3.78g", "Salt": "0.4g", "Fibre": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK280416-Martha-fondant-fancies.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}