{"title": "Martha's Ice cream cone cupcakes", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "12"}, "ingredients": [{"item": "12 flat-bottomed ice cream cup cones"}, {"item": "12 squares of dark chocolate"}, {"item": "125g unsalted butter, softened"}, {"item": "125g caster sugar"}, {"item": "2 eggs"}, {"item": "1 tsp vanilla bean paste"}, {"item": "125g self-raising flour"}, {"item": "½ tsp baking powder"}, {"item": "¼ tsp salt"}, {"item": "5 tbsp milk"}, {"item": "120g caster sugar"}, {"item": "80g golden syrup"}, {"item": "2 large egg whites"}, {"item": "½ teaspoon vanilla extract"}, {"item": "4 Cadbury’s Flake bars, each cut into three pieces"}, {"item": "Coloured sprinkles"}], "instructions": [{"step": "Preheat the oven to 170°C. Place one ice cream cup cone into each hole of a muffin tin. Cut 12 long strips of aluminium foil, and then gently crush them into long snake-shaped pieces. Wrap these around the bottom of each cone to stabilise them whilst they are cooking."}, {"step": "Place one square of chocolate into the bottom of each cone and place them into the preheating oven for 5 minutes, or until the chocolate is slightly melted. Take them out of the oven and spread the melted squares so they cover the whole bottom of the cone, then set aside to cool."}, {"step": "Using an electric whisk or electric stand mixer, beat the soft butter and sugar together until pale and fluffy. Add the eggs one at a time, and if the mixture starts to curdle, add a few tablespoons of flour to bring the mixture back together. Mix in the vanilla extract."}, {"step": "In a separate bowl, combine the flour, baking powder and salt. Add to the wet mixture a few tablespoons at a time until the batter is thick and well mixed. Mix in the milk to make the batter easier to spoon into the cones."}, {"step": "Evenly distribute the cake batter between each cone, making sure not to fill them too much or the batter will spill over whilst cooking. Place into the oven and bake for 20-25 minutes, or until risen and golden, with a skewer coming out clean."}, {"step": "For the icing, place the sugar, golden syrup and 2 tablespoons of water into a saucepan and cook on a medium-high heat without stirring until the mixture reaches the soft-ball stage (118oC on a sugar thermometer). If you don’t have a thermometer, the mixture is ready when the bubbles start to stick together and it drips off a spoon in a steady stream. Remove from the heat."}, {"step": "Place the egg whites into the bowl of a stand mixer fitted with the whisk attachment, and whisk until soft peaks form. With the mixer on low speed, carefully pour the hot sugar into the bowl. When all the sugar has been added, increase the mixer to high speed and whip until the sides of the bowl feel only slightly warm and the mixture is thick and glossy. Add the vanilla extract at the end."}, {"step": "Use a serrated knife to level off the cooled cupcakes to the same level as the cones. Spoon the icing into a piping bag fitted with a closed star nozzle and pipe a classic ice-cream style swirl. Top with a piece of Cadbury’s Flake and coloured sprinkles."}], "nutrition": {"Energy": "1,882kJ 449kcals", "Fat": "21.4g", "Saturated Fat": "13g", "Carbohydrate": "57.8g", "Sugars": "45.4g", "Protein": "6.3g", "Salt": "0.6g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/Martha_IceCreamCupcakes_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}