{"title": "Mary Berry's Korma-Style Chicken Curry", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT30M", "total_time": "PT40M", "serves": "4-6"}, "ingredients": [{"item": "5 skinless and boneless chicken breasts, sliced into thin strips"}, {"item": "3 tbsp sunflower oil"}, {"item": "2 onions, thinly sliced"}, {"item": "2 garlic cloves, crushed"}, {"item": "1⁄2 fresh red chilli, deseeded and finely chopped"}, {"item": "2 tbsp medium curry powder"}, {"item": "1 tsp ground cumin"}, {"item": "10 green cardamom pods, crushed to remove the seeds (see recipe introduction)"}, {"item": "450ml (15 oz) chicken stock"}, {"item": "125g (41⁄2oz) ground almonds"}, {"item": "2 tbsp mango chutney"}, {"item": "juice of 1⁄2 lemon"}, {"item": "200g (7oz) full-fat natural yoghurt"}, {"item": "coriander leaves, to garnish"}], "instructions": [{"step": "Season the chicken pieces with salt and pepper."}, {"step": "Heat a large, deep non-stick frying or sauté pan until piping"}, {"step": "hot and add 2 tablespoons of the oil. Quickly fry the chicken for 4–6 minutes until sealed and slightly golden. (You may need to cook the chicken pieces in batches if they don’t t in your pan in a single layer.) Remove with a slotted spoon and set aside."}, {"step": "Add the remaining oil to the pan with the onions, garlic and chilli and fry over a medium–high heat for 10 minutes, or until the onions are golden brown (see note). Add the spices and fry for another minute, stirring well to coat the onions. Stir in the stock, ground almonds and mango chutney, then bring to the boil and allow to bubble for 2–3 minutes."}, {"step": "Return the chicken to the pan and stir in. Reduce the heat, cover with a lid and simmer for about 5–7 minutes, until the chicken is cooked through."}, {"step": "Stir in the lemon juice and the yoghurt, check the seasoning and serve with boiled or steamed rice and garnished with coriander leaves."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/maryberrycurry.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}