{"title": "Marzipan & chocolate frangipane tart", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25 minutes + chilling and coolingM", "cook_time": "PT1 hour 5 minutesM", "total_time": "PT1 hour 30 minutes + chilling and coolingM", "serves": "12"}, "ingredients": [{"item": "180g plain flour"}, {"item": "150g unsalted butter, cubed and chilled"}, {"item": "40g cocoa powder"}, {"item": "40g icing sugar"}, {"item": "½ tsp sea salt flakes"}, {"item": "1 tsp cider vinegar"}, {"item": "Frangipane filling"}, {"item": "200g unsalted butter, cubed and softened"}, {"item": "200g golden caster sugar"}, {"item": "3 eggs"}, {"item": "1 large orange (scrubbed), zest"}, {"item": "200g ground almonds"}, {"item": "50g plain flour"}, {"item": "150g No.1 Single Origin Milk Chocolate (49%), in 1cm pieces"}, {"item": "80g golden marzipan, cubed then rolled into 20-25 small marbles"}, {"item": "25g flaked almonds"}, {"item": "Icing sugar, to dust"}, {"item": "Crème fraîche, to serve (optional)"}], "instructions": [{"step": "Using your fingertips, rub together the flour, butter, cocoa powder, icing sugar and salt into a fine breadcrumb-like consistency (or pulse briefly in a food processor). Add the vinegar and 2 tbsp cold water and press together into a ball (use an extra 1 tbsp water if necessary). Wrap the pastry in baking parchment, then shape into a disc around 2cm thick. Chill for at least 1 hour."}, {"step": "Unwrap the pastry and, between 2 sheets of baking parchment, roll out to  a 28cm circle with a thickness of 0.3cm. Use to line a 3-4cm deep, 24cm loose-bottomed tart tin, leaving a 1cm overhang, then chill for 30 minutes. Preheat the oven to 200˚C, gas mark 6; put a baking tray in to heat up. When chilled, line the pastry with baking parchment, fill with baking beans or rice*, put on the hot baking tray and bake for 10 minutes. Remove the paper and its contents, then bake for a further 10 minutes. Using a sharp or serrated knife, trim away the overhanging pastry to create a neat edge; leave to cool to room temperature."}, {"step": "Meanwhile, make the filling. Beat the butter and sugar in a freestanding mixer with the paddle attachment (or use a bowl and electric beaters) until light in colour and texture. With the paddle (or beaters) running at a slow-medium pace, add the eggs one at a time, beating until fully incorporated before adding the next. Use a spatula or wooden spoon to fold in the orange zest, then ½ the ground almonds, then the remaining ground almonds, and subsequently the flour and chopped chocolate. Preheat the oven to 170˚C, gas mark 3."}, {"step": "Fill the pastry case with the frangipane, pushing it to the edges and levelling with a palette knife or back of a spoon. Arrange the marzipan balls on top, starting  with one in the middle and forming concentric circles around it. Push the balls into the filling so just their tops show, then sprinkle over the flaked almonds. Bake for 40-45 minutes until golden and domed (it will flatten as it cools). Serve warm, cooled or chilled, dusted with icing sugar, with a spoonful of crème fraîche, if liked."}], "nutrition": {"Energy": "2,583kJ 620kcals", "Fat": "42g", "Saturated Fat": "19g", "Carbohydrate": "49g", "Sugars": "33g", "Protein": "11g", "Salt": "0.3g", "Fibre": "4.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Tart_087.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}