{"title": "Marzipan hot cross buns", "tags": null, "planning": {"prep_time": "PT25 minutes, plus rising and provingM", "cook_time": "PT25M", "total_time": "PT50 minutes, plus rising and provingM", "serves": "16"}, "ingredients": [{"item": "225g mixed dried fruit"}, {"item": "1 orange, juice and 2 tsp grated zest"}, {"item": "250ml whole milk"}, {"item": "75g unsalted butter"}, {"item": "500g strong white flour, plus extra for kneading"}, {"item": "10g fast-action/easy-blend yeast"}, {"item": "75g golden caster sugar"}, {"item": "2 rounded tsp mixed spice"}, {"item": "1⁄2 tsp salt"}, {"item": "1 large egg, beaten"}, {"item": "150g marzipan, grated"}, {"item": "1 egg"}, {"item": "2 tsp whole milk"}, {"item": "3 tbsp plain flour"}, {"item": "2 tbsp caster sugar"}], "instructions": [{"step": "Put the dried fruit and orange juice and zest in a small pan. Warm over a low heat; set aside for the fruit to absorb the liquid."}, {"step": "Heat the milk in a separate pan (or in the microwave) until warm, then add the butter and stir until melted. Mix the flour, yeast, caster sugar, mixed spice and salt together in a large bowl. Make a well in the middle and pour in the milk mixture. Add the egg and stir until well combined. Tip onto a clean, lightly floured work surface and knead for about 5 minutes, until silky smooth and elastic. (Or use a freestanding mixer tted with a dough hook.)"}, {"step": "Shape the dough into a ball, put in a clean bowl and cover with cling film. Leave in a warm, draught-free place for about 2 hours or until doubled in size. You can also prove the dough overnight in the fridge; bring it back to room temperature before continuing with the recipe below."}, {"step": "Add the soaked fruit and grated marzipan to the dough and knead by hand until thoroughly combined. Divide the dough into 16 even pieces – roughly 80g each – and shape into buns. Arrange the buns, smooth-side up, on 2 parchment-covered baking sheets, cover loosely with cling film and leave in a warm place for about 1 hour until the buns have doubled in size again, are well risen and springy to the touch."}, {"step": "Preheat the oven to 180 ̊C, gas mark 4. To decorate the buns, lightly whisk the egg and milk together and gently brush over the tops of the buns. In another small bowl, beat the plain flour with enough water (about 2-3 tbsp) to make a thick but pipeable paste. Scoop into"}, {"step": "a freezer bag or disposable piping bag, snip off the corner to create a nozzle and pipe a neat cross on top of each bun."}, {"step": "Bake the buns on the middle shelf of the oven for about 20-25 minutes until golden. Mix the caster sugar with 1 tbsp boiling water until dissolved to make a glaze. Brush over the buns as soon as they come out of the oven. Cool slightly, then serve with slightly salted butter."}], "nutrition": {"Energy": "1,245kJ 295kcals", "Fat": "7.1g", "Saturated Fat": "3.4g", "Carbohydrate": "51.3g", "Sugars": "25.3g", "Protein": "6.5g", "Salt": "0.2g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/HotCrossBuns6919_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}