{"title": "Masala omelette with avocado and coriander salsa", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT20M", "total_time": "PT40M", "serves": "4"}, "ingredients": [{"item": "1 tsp cumin seeds"}, {"item": "12 Waitrose & Partners Free Range Omega 3 Rich Eggs"}, {"item": "1 tsp ground turmeric"}, {"item": "½ tsp garam masala 1 green chilli, finely sliced (deseeded, if liked)"}, {"item": "1 small red onion, finely chopped"}, {"item": "¼ x 100g pack fresh coriander, stalks finely chopped, leaves torn"}, {"item": "2 tomatoes, deseeded and finely chopped"}, {"item": "2-3 tbsp vegetable oil or ghee, to fry"}, {"item": "2 Waitrose & Partners Perfectly Ripe Avocados"}, {"item": "½ x 100g pack fresh coriander, leaves finely chopped"}, {"item": "1 green chilli, finely chopped"}, {"item": "15g fresh root ginger, finely grated"}, {"item": "1 small garlic clove, crushed"}, {"item": "2 limes, juice of 1, 1 cut into wedges"}], "instructions": [{"step": "Toast the cumin seeds in a frying pan until fragrant (about 1-2 minutes), then lightly crush with a pestle and mortar. Set aside half and put the other half in a large bowl with the eggs, turmeric and garam masala; whisk until smooth. Mix in the chilli, onion, coriander stalks and tomatoes; season."}, {"step": "To make the salsa, peel, de-stone and cut the avocados into 1½cm dice. In a small bowl, mix with the coriander, chilli, ginger and garlic. Stir in the lime juice and reserved cumin seeds from the omelette; season."}, {"step": "To cook the first omelette, heat a little oil or ghee in a non-stick frying pan, ladle in about ¼ of the egg mixture and cook over a medium heat, stirring now and again with a rubber spatula. Once the mixture is thick enough to just cover the flat area of the pan (it should still have a loose, runny texture), increase the heat to high for 15 seconds, then turn off."}, {"step": "Leave for 1 minute to set the egg. Carefully fold the omelette; transfer to a plate. Scatter over some coriander leaves and serve at once with the salsa and lime wedges for squeezing. Repeat for the other 3 omelettes. Serve with buttered toast, if liked."}], "nutrition": {"Energy": "2,059kJ 469kcals", "Fat": "39g", "Saturated Fat": "8.1g", "Carbohydrate": "6g", "Sugars": "3.5g", "Protein": "27g", "Salt": "0.87g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Masala-omelette.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}