{"title": "Mediterranean tear & share bread", "tags": null, "planning": {"prep_time": "PT30 minutes + 1 hour 30 minutes risingM", "cook_time": "PT30M", "total_time": "PT1 hour + 1 hour 30 minutes risingM", "serves": "8"}, "ingredients": [{"item": "500g LoveLife Oat & Linseed Bread Mix"}, {"item": "25g Stork for Biscuits & Pastry"}, {"item": "2 tbsp mixed seeds, plus extra for sprinkling"}, {"item": "2 tsp Cooks’ Ingredients Simple Sumac, plus extra for sprinkling"}, {"item": "12-14 Sun Drenched Tomatoes, drained and snipped"}, {"item": "1 small courgette, trimmed and coarsely grated"}, {"item": "200g essential Greek Light Salad Cheese, chopped Plain flour, for dusting"}, {"item": "Olive oil, for brushing"}], "instructions": [{"step": "Tip the bread mix into a large bowl. Using your fingertips, rub in the Stork until the mixture resembles breadcrumbs. Stir in 2 tbsp of the mixed seeds and 2 tsp of sumac. Add the tomatoes, grated courgette and ¾ of the cheese, and mix together."}, {"step": "Pour in 240ml room-temperature water and stir to mix. Using your hands, continue mixing to bring the dough together and into a ball. Tip the dough onto a floured surface and gently knead it for 5 minutes. It will be sticky but don’t worry; dust your hands and the surface with flour regularly. (You can knead the dough in a food mixer fitted with a dough hook if you have one.) Return the dough to the cleaned and lightly greased mixing bowl, cover with clingfilm and set aside in a warm place for an hour."}, {"step": "Tip the dough onto a floured surface. Cut it into eight even pieces and, using floured hands,roll each one into a ball."}, {"step": "Arrange the dough balls in a rectangle on an oiled baking sheet with about 1cm gap between them. Brush them lightly with oil, sprinkle with the remaining cheese, some seeds and a dusting of sumac. Set aside for 30 minutes. Preheat the oven to 230°C, gas mark 8."}, {"step": "Bake the bread for 25-30 minutes or until golden and risen. Serve warm."}], "nutrition": {"Energy": "1,691kJ 403kcals", "Fat": "13g", "Saturated Fat": "3.4g", "Carbohydrate": "48g", "Sugars": "3.1g", "Protein": "20g", "Salt": "1.3g", "Fibre": "7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK181018 Med tear share. bread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}