{"title": "Mexican chicken and rice by Pinch of Nom", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT35M", "total_time": "PT45M", "serves": "4"}, "ingredients": [{"item": "1 tbsp ground cumin"}, {"item": "2 tsp mild chilli powder"}, {"item": "1 tbsp smoked sweet paprika"}, {"item": "1 tbsp garlic granules"}, {"item": "2 tsp dried oregano"}, {"item": "8 skinless and boneless chicken thighs (all visible fat removed)"}, {"item": "sea salt and freshly ground black pepper"}, {"item": "low-calorie cooking spray"}, {"item": "1 red pepper, deseeded and diced"}, {"item": "1 green pepper, deseeded and diced"}, {"item": "1 red onion, diced"}, {"item": "1 fresh chilli, deseeded and chopped"}, {"item": "250g basmati rice, rinsed and drained"}, {"item": "1 x 400g tin chopped tomatoes"}, {"item": "juice of ½ lime"}, {"item": "250–500ml chicken stock (2 chicken stock cubes dissolved in 250–500ml boiling water)"}, {"item": "160g sweetcorn kernels (tinned or frozen)"}, {"item": "1 x 400g black beans, drained and rinsed"}, {"item": "small handful of fresh coriander, chopped"}], "instructions": [{"step": "Combine all the dry spices, garlic granules and oregano."}, {"step": "Season the chicken thighs with salt and pepper and place them in a bowl or food bag and add half of the spice mix. Mix well so all of the thighs are coated. Set aside. (If you like you can do this in advance.)"}, {"step": "Spray a large heavy-based frying pan with low-calorie cooking spray and place over a high heat. Add the chicken and fry for 2 minutes on each side. Remove from the pan and set aside."}, {"step": "Spray the pan with more low-calorie cooking spray, then add the peppers and onion and cook for 3–4 minutes over a medium heat until they start to soften. Add the fresh chilli and the remaining spice mix and stir well, then add the rice and stir until it is well coated. Add the tomatoes, lime juice and 500ml chicken stock, then stir and bring to the boil. Place the chicken thighs on top and turn the heat down to low. Cover and cook for 30 minutes, stirring halfway through."}, {"step": "When the rice and chicken are cooked, stir in the sweetcorn, black beans and half of the coriander. Replace the lid for a few minutes, then sprinkle with the remaining coriander and serve"}, {"step": "Combine all the dry spices, garlic granules and oregano."}, {"step": "Cut the chicken thighs into bite-sized pieces, season with salt and pepper and place in a bowl or food bag. Sprinkle half of the mix over the chicken. Stir well so all the chicken is coated. Set aside. (If you like you can do this in advance.)"}, {"step": "Spray the pressure cooker with some low-calorie cooking spray and set to Sauté/Browning."}, {"step": "When the pressure cooker is hot, add the chicken pieces and cook for 2–3 minutes, stirring occasionally to make sure they brown evenly."}, {"step": "Add the peppers, onion and chilli and continue cooking for another 3–4 minutes, or until the veg starts to soften. Add the rice to the pressure cooker."}, {"step": "Add the tinned tomatoes, lime juice, 250ml chicken stock, sweetcorn, black beans, half the coriander and the rest of the spice mix. Stir well and replace the lid."}, {"step": "Cook on Manual/Stew for 10 minutes, then allow the pressure to release naturally (Natural Pressure Release/NPR) for 8–10 minutes. Stir gently and serve, sprinkled with the remaining coriander."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/mexicanrice-recipe.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}