{"title": "Mexican chicken, lime and tortilla soup", "tags": [{"tag": "Low Fat"}], "planning": {"prep_time": "PT25M", "cook_time": "PT30M", "total_time": "PT55M", "serves": "4-6"}, "ingredients": [{"item": "4 chicken legs"}, {"item": "1 large onion, halved"}, {"item": "1 heaped tsp allspice berries"}, {"item": "¼ tsp black peppercorns"}, {"item": "1 bay leaf"}, {"item": "3 fresh jalapeno chillies, 2 halved and 1 sliced"}, {"item": "2 limes, pared zest and juice"}, {"item": "500ml fresh chicken stock"}, {"item": "6 tomatoes"}, {"item": "5 seeded tortilla wraps, each cut into quarters"}, {"item": "1 large green pepper, cut into 0.5cm pieces"}, {"item": "28g pack coriander, stalks finely chopped, leaves torn"}], "instructions": [{"step": "Put the chicken legs, onion, allspice berries, peppercorns, bay leaf, halved jalapenos and pared lime zest in a large pan with a pinch of salt. Pour over the chicken stock and 1 litre cold water. Bring to the boil, then simmer for 20-25 minutes, until the chicken is cooked through; skim off any scum as it cooks."}, {"step": "Meanwhile, cut a small cross in the base of each tomato, put in a bowl, cover with boiling water and leave for 30 seconds. Rinse under cold water until cool. Peel and chop into 0.5cm pieces discarding the skin and seeds."}, {"step": "Dry-fry the tortilla pieces in a smoking hot pan for 1 minute on each side, until golden. Cool, then cut into strips and set aside. Remove the chicken from the broth and once cool enough to handle, shred the flesh, discarding the skin and bones. Strain the broth into a clean pan and add the diced tomatoes and pepper, coriander stalks and lime juice; season with salt."}, {"step": "Ladle the hot broth into bowls, topping each with some chicken, coriander leaves and sliced jalapeno. Serve with the tortillas and extra lime wedges, if liked."}], "nutrition": {"Energy": "1,646kJ 391kcals", "Fat": "13.8g", "Saturated Fat": "4.2g", "Carbohydrate": "30.6g", "Sugars": "5.3g", "Protein": "36.2g", "Salt": "0.8g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/tortilla_soup_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}