{"title": "Mincemeat and apple crostata recipe | Waitrose", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT1 hour 15 minutes, plus chillingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT2 hour 25 minutes, plus chillingM", "serves": "8-10"}, "ingredients": [{"item": "250g plain flour, plus extra for dusting"}, {"item": "50g fine semolina"}, {"item": "185g unsalted butter, chilled and diced"}, {"item": "75g caster sugar, plus extra for sprinkling on top"}, {"item": "½ lemon, zest, and 1 tsp juice"}, {"item": "1 whole egg and 1 egg yolk, beaten"}, {"item": "2 tbsp whole milk, for glazing"}, {"item": "icing sugar, for dusting on top"}, {"item": "1 bramley apple, peeled and coarsely grated"}, {"item": "100g raisins"}, {"item": "100g sultanas"}, {"item": "100g currants"}, {"item": "30g dried cranberries"}, {"item": "30g chopped mixed peel"}, {"item": "100g soft dark brown sugar"}, {"item": "½ lemon, zest and juice"}, {"item": "½ orange, zest and juice"}, {"item": "50g whole almonds, roughly chopped"}, {"item": "1 tsp ground cinnamon"}, {"item": "¼ tsp ground allspice"}, {"item": "a good grating of nutmeg"}, {"item": "3 tbsp calvados (or marsala)"}, {"item": "75g unsalted butter, diced"}], "instructions": [{"step": "Make the mincemeat, ideally the day before. Preheat the oven to 170˚C, gas mark 3. Add all the mincemeat ingredients, apart from the butter, to a large bowl and mix well with a good pinch of salt. Tip into a parchment-lined baking tin, cover with foil and cook for 20 minutes, stirring twice, until the fruit is plump and juicy. Stir in the butter and return to the oven for 5 minutes. Stir again, spoon into a clean bowl, and leave to cool and absorb any remaining liquid."}, {"step": "To make the pastry, tip the flour, semolina and a pinch of salt into a large mixing bowl. Add the butter and rub in using your fingers. Mix in the caster sugar and lemon zest. Make a well in the middle and add the eggs, lemon juice and 2 tbsp ice-cold water. Use a cutlery knife to bring the dough together – it will be quite sticky. Gather into a ball, flatten into a disc, cover with cling film and chill for at least 2 hours, or until firm."}, {"step": "Preheat the oven to 190˚C, gas mark 5, and place a baking sheet on the middle shelf of the oven. Cut off 1 / 3 of the dough and return to the fridge. Roll out the remaining 2 / 3 on a lightly floured work surface into a disc 2cm larger than a deep, fluted 23cm tart tin (about 4cm deep). Carefully line the tin, leaving any excess pastry hanging over the sides; chill while you prepare the lattice topping."}, {"step": "Roll out the remaining pastry into a disc slightly larger than the top of the tart tin and slide a piece of baking parchment under it. Cut the dough into strips of irregular thickness and chill for 10 minutes. Cover a baking sheet with parchment and arrange the dough strips together in a neat lattice; freeze for 10 minutes."}, {"step": "Fill the pastry case with the mincemeat – you may have a little left over – and brush the edge of the tart with a little water or milk. Carefully slide the pastry lattice top off the paper and onto the tart to neatly cover the mincemeat. Press the edges together to seal and slice off any excess pastry with a sharp knife. Brush the top of the lattice with milk and sprinkle with caster sugar."}, {"step": "Slide the crostata onto the hot baking sheet, reduce the oven temperature to 180˚C, gas mark 4, and bake for 40-45 minutes, until the pastry is crisp and golden. Leave to cool slightly, then serve, dusted with icing sugar and with the cinnamon custard."}], "nutrition": {"Energy": "2,297kJ 548kcals", "Fat": "26.3g", "Saturated Fat": "14.8g", "Carbohydrate": "71.9g", "Sugars": "48g", "Protein": "6g", "Salt": "0.1g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/MinceMeatCrostata2791_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}