{"title": "Mini baguettes", "tags": [{"tag": "Vegan"}], "planning": {"prep_time": "PT20 minutes, plus resting and provingM", "cook_time": "PT12 to 15 minutesM", "total_time": "PT35 minutes, plus resting and provingM", "serves": "8"}, "ingredients": [{"item": "7g sachet easy-bake yeast"}, {"item": "500g strong white bread flour"}, {"item": "360ml water"}, {"item": "10g salt"}, {"item": "50g white flour, for dusting"}], "instructions": [{"step": "Put the flour and easy-bake yeast into a large mixing bowl. Add the salt and 360ml water. Hold the bowl with one hand and mix the ingredients around with the other hand or with the rounded end of a plastic scraper for 2–3 minutes, until the dough starts to form. Pour the dough onto an unfloured work surface. It will feel soft and moist, and look like sticky porridge. Forget the way you might think you knead dough. Don’t pummel it with the heels of your hands: instead slide your fingers under it like two forks with your thumbs on top, swing it upwards and slap it back down away from you. Stretch the front of the dough towards you, then lift it back over itself in an arc. Repeat until the dough feels smooth, silky and elastic. Allow 5–10 minutes. Lightly flour the surface of the dough and fold the edges over to make a ball. Turn it over so the top is smooth. Lightly flour a bowl and place the dough in it. Cover the bowl with a clean tea towel and leave it to rise for 1 hour, until almost doubled in size. Preheat the oven to 240°C/gas 9 (or as high as your oven will go). Line a baking tray with a lightly floured, clean tea towel. Once the dough has rested, use the rounded end of a plastic scraper to turn the dough out onto a floured work surface. Using the sharp side of the scraper, cut the dough into 8 pieces, roll each one into a ball and rest for 5 minutes. Lightly dust your worktop with flour. Turn the first ball upside down and, with the heel of your hand, flatten it into an oval. Fold the longer side of the dough into the middle and use the heel of your hand to press it down and seal. Bring the other side over to the middle and press down to seal. Fold in half lengthways and seal the edges to make a log shape. Roll to extend to the length of your baking tray. Repeat with the other balls. Lay the baguettes on the tray, pleating the tea towel between them. Prove for 45–60 minutes, until they double in size. Transfer to another baking tray; make 3 or 4 diagonal cuts on the top of each baguette. Bake for 12–15 minutes until golden."}], "nutrition": {"Energy": "1,025kJ 242kcal", "Fat": "0.9g", "Saturated Fat": "0.2g", "Carbohydrate": "48g", "Sugars": "1.5g", "Protein": "9.3g", "Salt": "1.2g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Bread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}