{"title": "Miso chicken & grapefruit brown rice bowl", "tags": null, "planning": {"prep_time": "PT30 minutes + marinating, cooling and restingM", "cook_time": "PT25M", "total_time": "PT55 minutes + marinating, cooling and restingM", "serves": "2"}, "ingredients": [{"item": "2 tbsp sweet white miso"}, {"item": "4 tbsp Cooks’ Ingredients Mirin Rice Wine"}, {"item": "2 tbsp clear honey, plus 1 tsp for the dressing"}, {"item": "4 chicken thigh fillets"}, {"item": "150g frozen soya beans"}, {"item": "250g pouch Tilda Steamed Brown Basmati Rice"}, {"item": "3 tbsp Cooks’ Ingredients Japanese Rice Vinegar"}, {"item": "1 pink or red grapefruit"}, {"item": "25g pickled sushi ginger, sliced, plus 1 tbsp pickling liquid"}, {"item": "½ tbsp toasted sesame oil"}, {"item": "½ tbsp tamari or dark soy sauce"}, {"item": "75g radishes, finely sliced"}, {"item": "2 tbsp sesame seeds, toasted"}], "instructions": [{"step": "In a large bowl, mix the miso and mirin with 1 tbsp honey. Add the chicken, making sure it’s covered in the marinade. Chill for at least 15 minutes (or overnight, if you have time). Meanwhile, cook the soya beans according to pack instructions. Drain, refresh under cold water, drain again and chill until needed."}, {"step": "Cook the rice according to pack instructions, then mix with the rice vinegar and the other 1 tbsp of honey and a large pinch of salt. Cover and chill until ready to serve."}, {"step": "For the dressing, segment the grapefruit over a bowl to catch the juice, squeezing the membranes as well. Tear the segments into small pieces. Add the sushi ginger and pickling liquid, 1 tsp honey, the sesame oil and tamari (or soy sauce), plus more to taste, if liked."}, {"step": "Remove the chicken from the fridge 15 minutes before cooking. Heat a heavy-based pan until smoking hot. Wipe any excess marinade from the chicken, then add the meat to the pan. Reduce the heat to low and cook for 5-7 minutes until the skin is caramelised. Turn over and repeat, until cooked through, the juices run clear and there is no pink meat. Set aside to rest under foil."}, {"step": "Wipe the pan clean. Return to a high heat and add any leftover marinade, bubbling for 1-2 minutes, to make a thick syrup (add a splash of water, if it’s too thick). Pour this over the chicken."}, {"step": "Slice and serve the chicken on the seasoned rice, spooning over the dressing and scattering with the soya beans, radishes and sesame seeds. Serve with seaweed thins or toasted nori sheets, if liked."}], "nutrition": {"Energy": "3,589kJ 854kcals", "Fat": "33.5g", "Saturated Fat": "7.2g", "Carbohydrate": "89.3g", "Sugars": "49g", "Protein": "48.9g", "Salt": "3.9g", "Fibre": "8.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Waitrose-Weekend_WK346_WKEnd-Menu_Sat-Lunch_Miso-Chicken-Grapefruit-Brown-Rice.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}