{"title": "Mocha chocolate torte", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT40M", "total_time": "PT55M", "serves": "8"}, "ingredients": [{"item": "200g plain chocolate"}, {"item": "150g Country Life Butter, diced"}, {"item": "3 tbsp milk"}, {"item": "1 1/2 tsp coffee extract"}, {"item": "5 medium eggs, separated"}, {"item": "150g caster sugar"}, {"item": "50g plain flour"}, {"item": "1 tsp baking powder"}, {"item": "300ml tub essential Waitrose Whipping cream"}, {"item": "300g fresh raspberries"}, {"item": "25g Billington’s Golden Icing Sugar + 1tsp for dusting"}, {"item": "300g fresh raspberries"}, {"item": "2 tsp cocoa powder, for dusting"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line the sides and base of a Waitrose Cooking non- stick 22cm round springform cake pan with baking parchment."}, {"step": "In a heatproof bowl place over a pan of simmering water (making sure the base of the bowl isn’t in contact with the water), melt the chocolate and butter together with the milk and coffee extract, stirring occasionally. Remove from the pan and allow to cool slightly."}, {"step": "Meanwhile, whisk the yolks and sugar until the mixture turns thick, creamy and pale, and leaves a soft trail when dripped from the whisk. Use a metal spoon to fold in the flour and baking powder."}, {"step": "Gradually pour the melted chocolate into the flour mixture, stirring gently to combine."}, {"step": "In a clean bowl, whisk the egg whites with a balloon or electric whisk until they form stiff peaks. Lightly fold the whites into the chocolate mixture using a metal spoon, until thoroughly combined. Pour into the tin and bake for 35-40 minutes, until the torte is risen and set on top, but moist inside. Cool in the tin - it will sink a little as it cools."}, {"step": "Remove from the tin, discard the paper and transfer the torte to a serving plate. Whip the cream until it is firm and holds soft peaks, then fold in the icing sugar, spoon this mix into a small serving bowl, pile  the raspberries over the torte, then using a sieve lightly dust the torte with cocoa powder followed by the icing sugar. Serve immediately, with the bowl of sweetened whipped cream."}], "nutrition": {"Energy": "870.272kJ 208kcals", "Fat": "6.5g", "Saturated Fat": "3.6g", "Carbohydrate": "34.7g", "Sugars": "20.8g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/e/Mocha-Torte-400x400.jpeg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}