{"title": "Muscovado alfajores", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT35M", "total_time": "PT55 minutes, plus coolingM", "serves": "18 sandwiched biscuits"}, "ingredients": [{"item": "200g unsalted butter, softened"}, {"item": "100g golden caster sugar"}, {"item": "1 egg plus 1 egg yolk, lightly beaten"}, {"item": "1 tsp vanilla extract"}, {"item": "¼ tsp salt"}, {"item": "225g plain flour, plus extra for rolling"}, {"item": "100g cornflour"}, {"item": "30g desiccated coconut (optional), to decorate"}, {"item": "75g unsalted butter"}, {"item": "125g light brown muscovado sugar"}, {"item": "100g dark brown muscovado sugar"}, {"item": "3 tbsp golden syrup"}, {"item": "150ml double cream"}], "instructions": [{"step": "Start by making the caramel fi lling. Put the butter, sugars and golden syrup in a large saucepan and melt together over a low heat, until smooth. Bring to a simmer, then add the cream in a slow trickle, stirring with a long-handled wooden spoon in case it spits a little. When the caramel reaches a full boil (it will climb up the pan and look frothy), cook for exactly 4 minutes, stirring often. Stir in a pinch of salt, then pour into a large heatproof bowl, cover the surface with lightly oiled cling fi lm and set aside for 2½ hours or until just warm. Avoid stirring as it will make it granular."}, {"step": "Meanwhile, make the biscuits. Using a wooden spoon, beat the butter and sugar together until pale, then beat in the egg, yolk, vanilla and salt. Sift in the flours, then mix to a soft dough. Divide between 2 pieces of cling film, shape into saucer-sized discs, then wrap and chill for 20 minutes, until fi rm."}, {"step": "Preheat the oven to 190˚C, gas mark 5; line 2 baking sheets with baking parchment. Lightly flour a work surface, then roll the dough out to about 0.5cm thick. Stamp out biscuits using a 6cm cutter and re-roll any trimmings to make about 36 biscuits in all. Bake for 10-12 minutes, in batches, until pale gold and sandy to the touch. Cool for 5 minutes, then transfer to a wire rack to cool completely."}, {"step": "When the caramel is very thick and warm to the touch, use it to sandwich the biscuits together. Roll the edges in the coconut, if using, before serving."}], "nutrition": {"Energy": "1,328kJ 318kcals", "Fat": "17.5g", "Saturated Fat": "11g", "Carbohydrate": "37.9g", "Sugars": "23.3g", "Protein": "2.1g", "Salt": "0.1g", "Fibre": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/05Muscavoado-alfajores-top_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}