{"title": "Mushroom & squash pithivier with  chestnut sauce, red chard & goat’s  cheese salad", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25 minutes + coolingM", "cook_time": "PT20M", "total_time": "PT45 minutes + coolingM", "serves": "4"}, "ingredients": [{"item": "For the squash"}, {"item": "350ml vegetable stock"}, {"item": "200g butternut squash, peeled and cut into 1.5cm dice"}, {"item": "For the CHESTNUT sauce"}, {"item": "100g chestnut purée"}, {"item": "90ml single cream"}, {"item": "For the mushrooms"}, {"item": "1 tbsp olive oil"}, {"item": "200g chestnut mushrooms, sliced"}, {"item": "20g unsalted butter"}, {"item": "½ tsp fresh thyme leaves, stalks discarded"}, {"item": "1 clove garlic, finely sliced"}, {"item": "40ml Madeira"}, {"item": "4 cooked whole chestnuts, sliced"}, {"item": "2 fresh sage leaves, finely sliced"}, {"item": "1 tbsp plain flour"}, {"item": "375g pack all butter puff pastry"}, {"item": "1 medium Waitrose British Blacktail Egg, beaten"}, {"item": "100g firm goat’s cheese, crumbled"}, {"item": "For the salad"}, {"item": "1 essential Waitrose Little Gem Lettuce, cut into quarters"}, {"item": "Olive oil, for greasing"}, {"item": "100g red or Swiss chard"}, {"item": "2 tbsp pumpkin seeds, toasted"}, {"item": "½ chicory, sliced lengthways"}, {"item": "Juice and finely grated zest of ½ lemon, to taste"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. For the squash, place a small saucepan over a medium heat, add the vegetable stock and bring to a simmer. Add the squash and cook for 10 minutes until just tender. Remove the squash from the stock using a slotted spoon. Reserve the stock and allow to cool."}, {"step": "For the chestnut sauce, whisk the chestnut purée with the cream in a small pan over a low heat. Season. Keep warm, covered."}, {"step": "For the mushrooms, heat the olive oil in a medium pan until very hot. Add the mushrooms and butter, then toss to combine. Cook the mushrooms until coloured, then stir in the thyme leaves and sliced garlic. Cook for a further 1 minute, then season."}, {"step": "Pour in three-quarters of the Madeira, bring to a simmer and continue to cook until the volume of liquid has reduced by half. Remove the pan from the heat and add the chestnuts and half of the sage. Tip the mixture onto a chopping board and dice finely. Transfer to a mixing bowl and fold through 2 tbsp of the chestnut sauce and all of the remaining Madeira."}, {"step": "To prepare the pastry, lightly dust your work surface with a pinch of the flour and roll out the pastry to a 2mm thickness."}, {"step": "To make the bases of the pies, use an 11cm pastry cutter to cut 4 discs. Place them on a baking tray lined with baking parchment. Re-roll the remaining pastry to a 2mm thickness."}, {"step": "To make the tops of the pies, use a 14cm pastry cutter to cut 4 more discs. Using a fork, evenly prick the surface of all 8 pastry discs."}, {"step": "Brush the smaller discs (the bases) with an even coating of the beaten egg wash."}, {"step": "To build the pies, stir the squash and mushroom mixture together, season and add the remaining sage. Divide the mixture evenly among the 4 smaller discs. Add half of the crumbled cheese, dividing it equally among the pies."}, {"step": "Place one large pastry disc over each filled pie base and seal the pastry tightly to the base of the pie. Brush the remaining egg wash over the pie tops and use a fork to crimp the edges of the pies. Bake in the oven for 20 minutes."}, {"step": "For the salad, heat a large frying pan over a medium heat. Brush the cut surfaces of the lettuce with a little olive oil and season with salt. Place the lettuces, cut-side down, into the pan to char, then remove from the pan and add the chard. Cook the chard until wilted, then add the pumpkin seeds and chicory. Toss to combine, then remove from the heat. Transfer to a bowl and season with a little salt and the lemon juice and lemon zest. Add the remaining crumbled goat’s cheese and season to taste."}, {"step": "Remove the pies from the oven and serve with the remaining warmed-through chestnut sauce, with the warm salad alongside."}], "nutrition": {"Energy": "2,940kJ 705kcals", "Fat": "45.7g", "Saturated Fat": "24.8g", "Carbohydrate": "54.9g", "Sugars": "8.4g", "Protein": "18.6g", "Salt": "2g", "Fibre": "4.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Squash-&-Mushroom-Pithivier_144457.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}