{"title": "Nadiya Hussain's Back-to-Front Baked Cheesecake", "tags": null, "planning": {"prep_time": "PT25 minutes plus cooling and chillingM", "cook_time": "PT1M", "total_time": "PT1 hour, 25 minutes plus cooling and chillingM", "serves": "9"}, "ingredients": [{"item": "Butter, for greasing"}, {"item": "900g full-fat cream cheese"}, {"item": "200g caster sugar"}, {"item": "150ml soured cream"}, {"item": "3 tbsp plain flour"}, {"item": "3 medium eggs, beaten"}, {"item": "2 tsp vanilla bean paste"}, {"item": "50g butter"}, {"item": "170g set honey"}, {"item": "300ml double cream"}, {"item": "½ tsp salt"}, {"item": "150g digestives, roughly crushed"}, {"item": "75g unsalted butter"}, {"item": "30g demerara sugar"}, {"item": "50g dark chocolate chips or chunks"}, {"item": "50g toasted hazelnuts, roughly chopped"}], "instructions": [{"step": "Preheat the oven to 160°C/140°C fan/gas mark 3. Grease the base of a 20cm round cake tin (it mustn’t be loose-bottomed, imagine the leakage!), and line it with baking paper."}, {"step": "Put the cream cheese, sugar, soured cream, flour, eggs and vanilla paste into a large bowl and give it all a good mix, just for a minute or so, until it is well combined. You don’t want to mix for too long and incorporate any air."}, {"step": "Pour the mixture into the prepared tin, tap it on the worktop to release any trapped air, then level the surface. Bake on the lower shelf of the oven"}, {"step": "for 1 hour."}, {"step": "As soon as the hour is up, open the oven door, leaving it slightly ajar. Pop a wooden spoon in the door to keep it just open and let out the heat slowly. Now turn the oven off."}, {"step": "Don’t take the cheesecake out until the oven is completely cold. This recipe is more about patience than anything else. (Something I am generally"}, {"step": "not good at!)"}, {"step": "Once the oven is cool, there’s more waiting, I’m afraid. Put the cheesecake into the fridge to chill overnight."}, {"step": "Next day, it’s time to make the honey salted caramel. Put the butter into a small pan on a medium heat. As soon as it has melted, add the honey and cook on a medium to high heat for 10 minutes, until the caramel is a golden brown. If it starts to catch, just turn the heat down slightly. After 10 minutes, pour in the cream, give it a mix and allow it to just come up to the boil. Take off the heat and stir in the salt. Set aside."}, {"step": "To make the tiffin crumble, put the biscuits into a zip-lock bag and crush them very roughly. I like a good mix of big pieces, small bits and lots of crumbs. Empty them into a bowl."}, {"step": "Melt the butter and pour it on to the biscuits. Leave to cool for about 10 minutes, while you take the cheesecake out of the fridge and turn it out on to a serving plate or platter."}, {"step": "Add the sugar, chocolate and hazelnuts to the buttery biscuit chunks."}, {"step": "Now for the back-to-front bit. Put the tiffin mixture on top of the cheesecake, but not in any neat fashion or packed tightly, just piled on top in peaks and troughs."}, {"step": "Reheat the caramel if it has cooled too much, and pour over the cheesecake."}, {"step": "For any of you who have had past cheesecakes fly across the table from the sheer brute force of fighting to cut a tight biscuit base, you are welcome!"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/n/nadiya-backtofront-cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}