{"title": "Normandy apple tart", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes + chillingM", "cook_time": "PT45M", "total_time": "PT60 to 65 minutes + chillingM", "serves": "8 - 10"}, "ingredients": [{"item": "For the pastry"}, {"item": "250g plain flour, plus extra for dusting"}, {"item": "125g butter"}, {"item": "¼ tsp salt"}, {"item": "2 Waitrose British Blacktail Medium Free Range Egg yolks"}, {"item": "For the filling"}, {"item": "100g butter, softened"}, {"item": "100g caster sugar"}, {"item": "1 Waitrose British Blacktail Medium Free Range Egg, lightly beaten"}, {"item": "1 Waitrose British Blacktail Medium Free Range Egg yolk, lightly beaten"}, {"item": "1 tbsp Calvados"}, {"item": "100g ground almonds"}, {"item": "2 tbsp plain flour"}, {"item": "3 dessert apples (I use Granny Smiths)"}, {"item": "1 tbsp caster sugar for sprinkling"}, {"item": "175ml apricot jam"}], "instructions": [{"step": "To make the pastry put everything, except the yolks, into a food processor and whizz until the mixture resembles breadcrumbs. Add the yolks and 1½ tbsp of very cold water and whizz again. If the mixture doesn’t come together in a ball add a little more water and whizz again until it does. Wrap in clingfilm and put in the fridge to rest for half an hour."}, {"step": "Preheat the oven to 200°C, gas mark 6 and put a metal baking sheet in to heat up. Roll the pastry out on a lightly floured surface and use to line a 23-25cm tart tin with a removable base. Prick the bottom lightly with a fork and put into the fridge or freezer to chill until firm."}, {"step": "To make the filling, cream the butter and sugar until light and fluffy. Gradually add the egg and the extra yolk, beating well after each addition. Add the Calvados, then stir in the almonds and flour. Spread this frangipane mixture in the bottom of the chilled pastry case. It will look as if there isn’t enough but it does puff up."}, {"step": "Peel, halve and core the apples. Cut the flesh into thin slices and arrange on the frangipane like the spokes of a wheel, each half radiating out from the centre. It is best to slice each apple half then transfer it to the tart, keeping the slices together, and carefully press into place, letting them fan out."}, {"step": "Bake the tart on the preheated baking sheet in the oven for 15 minutes, until the pastry is beginning to brown, then turn the heat down to 180°C, gas mark 4 and cook for another 20-25 minutes until the frangipane is set and the apples are tender. Ten minutes before the end of cooking sprinkle the tart with the caster sugar."}, {"step": "Melt the apricot jam in a pan with 2 tbsp water. When the mixture is smooth, push it through a sieve to get rid of the bits of fruit. Thickly paint the tart with this glaze and leave to cool. Serve warm or at room temperature, with some crème fraÎche on the side to cut through the sweetness."}], "nutrition": {"Energy": "2,066kJ 495kcals", "Fat": "27g", "Saturated Fat": "13g", "Carbohydrate": "52g", "Sugars": "31g", "Protein": "7.5g", "Salt": "0.6g", "Fibre": "3.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/n/Normandy-Apple-Tart_184449.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}