{"title": "Nutty simnel cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT50 minutes, plus cooling and overnight soakingM", "cook_time": "PT2 hours 10 minutesM", "total_time": "PT3 hours, plus cooling and overnight soakingM", "serves": "12"}, "ingredients": [{"item": "170g sultanas"}, {"item": "170g raisins"}, {"item": "170g currants"}, {"item": "1 orange, zest"}, {"item": "5 tbsp Disaronno amaretto (or rum or brandy)"}, {"item": "170g unsalted butter, at room temperature, plus extra for greasing"}, {"item": "170g mixed nuts (hazelnuts, pecans and almonds)"}, {"item": "170g light brown soft sugar"}, {"item": "4 large eggs, beaten"}, {"item": "170g plain flour"}, {"item": "85g ground almonds"}, {"item": "1 tsp ground cinnamon"}, {"item": "1 tsp mixed spice"}, {"item": "1 tsp ground cardamom (finely crushed seeds from 10-12 pods)"}, {"item": "1 tbsp sieved apricot jam"}, {"item": "150g blanched hazelnuts"}, {"item": "150g icing sugar"}, {"item": "1 tsp vanilla bean paste"}, {"item": "1 large egg white"}], "instructions": [{"step": "The day before baking the cake, put the dried fruit and orange zest in a bowl. Pour over the liqueur, cover the bowl with cling film and set aside overnight."}, {"step": "Preheat the oven to 200˚C, gas mark 6; lightly grease the base and sides of a deep 20cm round cake tin and line with a triple layer of baking parchment. Put the mixed nuts for the cake and the hazelnuts to be used in the marzipan on separate baking sheets and roast for about 8-10 minutes or until lightly toasted and fragrant. Set both aside to cool."}, {"step": "Lower the oven temperature to 150˚C, gas mark 2. For the cake batter, beat the butter and sugar until light and fluffy – about 5 minutes. Add the eggs a little at a time, beating until combined before adding more. Tip in the dry ingredients and a pinch of salt and fold together to combine. Chop the mixed nuts and add, with the dried fruit, mixing everything together. Scrape the batter into the prepared cake tin and bake for about 2 hours or until a skewer inserted into the middle of the cake comes out clean. Leave to cool in the tin for about 10 minutes before inverting onto a wire rack to cool completely."}, {"step": "While the cake is cooling, make the marzipan. Put the cooled, roasted hazelnuts in a food processor and pulse until finely ground. Add the icing sugar and a pinch of salt and pulse to combine, then add the vanilla. Pulse in the egg white a little at a time, adding just enough to form a soft and pliable, but not sticky, mixture. (If you add too much egg white, tip the marzipan onto the work surface, and knead in a little extra icing sugar until it’s no longer sticky). Press the marzipan into a round, wrap in cling film and chill until needed."}, {"step": "To decorate, put the apricot jam and 1 tsp water into a small saucepan and heat until warm. Brush over the top of the cake and set aside. Lightly dust the work surface with icing sugar and roll out 2 / 3 of the marzipan into a 20cm round, carefully placing on top of the cake. Roll the remaining marzipan into small balls (11 is traditional) and use any leftover jam to stick these around the edge of the cake. To finish, use your fingers to crimp the edge of the marzipan and lightly brown it with a kitchen blowtorch, if liked."}], "nutrition": {"Energy": "2,706kJ 647kcals", "Fat": "34.5g", "Saturated Fat": "10.4g", "Carbohydrate": "73g", "Sugars": "60.9g", "Protein": "11.1g", "Salt": "0.2g", "Fibre": "3.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/n/simnel-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}