{"title": "Onion Focaccia", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT30M", "total_time": "PT50M", "serves": "1 loaf (serves about 10)"}, "ingredients": [{"item": "1 tbsp quick yeast"}, {"item": "600g strong white bread flour"}, {"item": "1 tsp salt"}, {"item": "1 tbsp sugar"}, {"item": "100ml olive oil, plus extra for greasing"}, {"item": "Onion topping"}, {"item": "4 tbsp olive oil"}, {"item": "3 large onions, sliced"}, {"item": "1 tsp sugar"}, {"item": "1 tbsp balsamic vinegar"}, {"item": "1 tsp thyme leaves"}], "instructions": [{"step": "For the focaccia, combine all the ingredients apart from the oil in a bowl and make a well in the centre. Mix the oil and 300ml warm water in a jug and pour into the well, stirring until you have a soft dough. If the dough is too dry add a little more liquid, if too wet a little more flour."}, {"step": "Turn onto a lightly floured surface and knead for 10 minutes until elastic. Put the dough in a lightly oiled bowl, cover with oiled clingfi lm and leave to rise in a warm place for 45 minutes to 1 hour."}, {"step": "Meanwhile, prepare the onions. Heat half the oil in a large pan over a medium heat and cook the onions for 25 minutes, stirring occasionally, until soft and golden. Add the sugar and vinegar and cook for a further 3 minutes. Season and set aside."}, {"step": "Knock back the risen dough to its original size by punching it gently with your fist. Place on a lightly oiled baking sheet and stretch out to a square roughly 28cm x 28cm. Cover with lightly oiled clingfilm and leave to rise for another 30 minutes."}, {"step": "Preheat the oven to 220˚C, gas mark 7. Make dimples in the dough with your fingertips. Top with the onions and thyme, drizzle over the remaining olive oil and scatter over a little sea salt. Bake for 25-30 minutes until golden. Serve warm."}], "nutrition": {"Energy": "1410.008kJ 337kcals", "Fat": "12.6g", "Saturated Fat": "1.8g", "Carbohydrate": "48.7g", "Sugars": "5.3g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/o/2012wkwe-Jan-r03.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}