{"title": "Orange mocha cake", "tags": null, "planning": {"prep_time": "PT45M", "cook_time": "PT30M", "total_time": null, "serves": "12 - 14"}, "ingredients": [{"item": "200g unsalted butter, chopped, plus extra for greasing"}, {"item": "25g cocoa powder"}, {"item": "200g plain chocolate, roughly chopped"}, {"item": "3 tbsp instant coffee granules,dissolved in 1 tbsp boiling water"}, {"item": "180g light brown muscovado sugar"}, {"item": "180g caster sugar"}, {"item": "3 eggs"}, {"item": "3 tbsp single cream"}, {"item": "1 orange, zest and juice"}, {"item": "180g self-raising flour"}, {"item": "1 orange"}, {"item": "200g plain chocolate, broken into small pieces"}, {"item": "200ml double cream"}, {"item": "2 tbsp instant coffee granules, dissolved in 1 tbsp boiling water"}, {"item": "275g icing sugar"}, {"item": "230g unsalted butter, softened"}, {"item": "2 oranges, zest and 2 tbsp juice"}, {"item": "1 1⁄2 tsp orange blossom water"}, {"item": "45g caster sugar"}, {"item": "1 tbsp orange juice"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4. Grease 3 x 20cm cakes and line the bases with baking parchment. For the cake, put the butter, cocoa, chocolate and dissolved coffee in a bowl set over a pan of simmering water, stirring occasionally until melted. Remove from the heat and beat in the sugars until combined. In a separate bowl, combine the eggs, cream, orange zest and juice. Pour into the chocolate mixture, beating until mixed through. Fold in the flour and a pinch of salt, then divide the mixture equally between the three tins and bake for 25-30 minutes. Cool for 10 minutes, then remove from the tins, peel off the parchment and leave to cool completely on wire racks. Meanwhile, make the ganache. Use a vegetable peeler to pare long ribbons of zest from the orange and set aside for decoration. Juice the pared orange, then put the juice in a pan with the chocolate, cream, dissolved coffee and a pinch of salt. Set over a low-medium heat until melted. Pour into a bowl and chill for about an hour or until thick enough to spread. For the buttercream, beat all the ingredients together with electric beaters for about 4 minutes, until pale and fluffy; set aside. To prepare the decoration, put the sugar and orange juice in a heavy-based saucepan. Add the pared peel, set over a low heat and simmer for 10-15 minutes, until the peel is beginning to curl around the edges and the skin has started to darken. Remove with a fork, then leave to cool on a sheet of baking parchment. 6 To assemble the cake, spread half the buttercream on one sponge and sandwich another sponge on top. Repeat with the remaining buttercream and sponge, then cover the whole cake with the mocha ganache. Decorate with the candied peel and scatter with a few Cooks' Ingredients chocolate mocha beans, if liked."}], "nutrition": {"Energy": "3,118kj 748kcals", "Fat": "47.2g", "Saturated Fat": "29.7g", "Carbohydrate": "74.5g", "Sugars": "60.8g", "Protein": "6.2g", "Salt": "0.5g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/o/orange mocha cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}