{"title": "Orange & lemon meringue pudding", "tags": null, "planning": {"prep_time": "PT40M", "cook_time": "PT30M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 oranges"}, {"item": "75g slightly salted butter, softened"}, {"item": "125g golden caster sugar"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "100g ground almonds"}, {"item": "Finely grated zest 1 unwaxed lemon, plus 2 tbsp juice"}, {"item": "2 tbsp flaked almonds"}], "instructions": [{"step": "Put the whole oranges in a small saucepan and cover with water. Bring to a gentle simmer and cook for 40 minutes or until the oranges are just tender — a sharp knife should go through them quite easily. Drain the oranges from the water and leave to cool slightly."}, {"step": "Preheat the oven to 160°C, gas mark 3. Butter a 1-litre ovenproof dish or pie dish. Roughly chop the oranges, discarding all the pips, and blitz in a food processor until pulpy. The oranges needn’t be completely smooth — a little texture is nice."}, {"step": "Beat the butter and 75g of the sugar to a paste. Add the egg yolks, ground almonds, lemon zest and juice and blend until combined. Beat in the orange pulp and turn into the prepared dish. Level the surface and bake for 25 minutes. Remove from the oven and increase the temperature to 230°C, gas mark 8."}, {"step": "Whisk the egg whites in a thoroughly clean bowl until they form firm peaks. Gradually whisk in the remaining sugar, a tablespoonful at a time, until thick and turning glossy. Spread the meringue over the pudding, creating swirls and peaks with the back of a knife. Sprinkle with the flaked almonds and return to the oven for 3–5 minutes until the meringue is lightly toasted. Serve warm."}], "nutrition": {"Energy": "2,372kJ 569kcals", "Fat": "36.9g", "Saturated Fat": "12.3g", "Carbohydrate": "47.7g", "Sugars": "46.8g", "Protein": "11.5g", "Salt": "0.3g", "Fibre": "3.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/o/OrangeLemonMeringue_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}