{"title": "Orange & ginger crème brûlée with Cointreau-flambé oranges", "tags": null, "planning": {"prep_time": "PT15 minutesM", "cook_time": "PT45 minutesM", "total_time": "PT60 minutesM", "serves": "6"}, "ingredients": [{"item": "3 oranges"}, {"item": "600ml tub double cream"}, {"item": "100ml whole milk"}, {"item": "2 vanilla pods (split lengthways, seeds scraped out with a sharp knife)"}, {"item": "5cm piece fresh ginger, peeled and cut into 4 slices"}, {"item": "7 egg yolks"}, {"item": "160g caster sugar"}, {"item": "100ml Cointreau"}, {"item": "50g sugar"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. Using a very sharp knife or vegetable peeler, emove the zest from oranges and set aside."}, {"step": "In a heavy-based pan, heat the cream, milk, vanilla pods and seeds, ginger and orange zest over a low heat. Bring just to the boil then take off the heat and pass through a sieve."}, {"step": "Whisk the yolks and 100g of the caster sugar until pale and fluffy. Still whisking, add a third of the cream mixture until you get a smooth mix. Add the rest of the cream, stirring constantly."}, {"step": "Pour or ladle the mixture into 6x200ml ramekins. Place the ramekins in a deep baking tray and add water to the tray until it is halfway up the ramekins."}, {"step": "Bake in the oven for 35-40 minutes. They should be firm but still with a bit of movement. You can keep the brûlées in the fridge at this stage until they are ready to serve."}, {"step": "To serve, top with the remaining caster sugar and then flash under a very hot grill until the sugar melts and caramelises giving you a gorgeous crunchy crust. Or, if you have a chef's blow torch, use it to melt the sugar."}], "nutrition": {"Energy": "2974.824kJ 711kcals", "Fat": "54.4g", "Saturated Fat": "31.8g", "Carbohydrate": "49.2g", "Sugars": "49.1g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/o/2011_Dec_Wkend-r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}