{"title": "Overnight crumpets", "tags": null, "planning": {"prep_time": "PT15 minutes, plus risingM", "cook_time": "PT30M", "total_time": "PT45 minutes, plus risingM", "serves": "8-10"}, "ingredients": [{"item": "150ml semi-skimmed milk"}, {"item": "1 tsp honey, plus extra to serve"}, {"item": "1 tsp fast action yeast"}, {"item": "250g strong white bread flour"}, {"item": "¼ tsp bicarbonate of soda"}, {"item": "½ tsp salt"}, {"item": "vegetable oil, for frying"}, {"item": "salted butter, to serve"}], "instructions": [{"step": "Warm the milk with 150ml water until lukewarm, then whisk in the honey and yeast. Put the flour into a large, deep bowl, make a well, then pour in the liquid. Whisk into a batter, leave in a warm place for 30 minutes, then cover and chill overnight."}, {"step": "Take the batter out of the fridge – it should be risen and bubbly. Mix the bicarbonate of soda, salt and 6 tbsp cold water together in a small bowl. Whisk into the batter then leave for 30-45 minutes in a warm place until the batter has started to rise again and has lots of small bubbles."}, {"step": "When ready, set a heavy-based frying pan over a medium heat. Once hot, add 1 tsp oil and rub it over the pan with kitchen paper. Grease the crumpet rings too. Put the rings on the pan and ladle in a little batter until they are about 1 /3 full. Cook for 7-9 minutes until the bubbles have risen, popped and stay open. (The tops should look almost dry and the bottoms will be a deep golden brown. You can’t rush a good crumpet and the exact cooking time will depend on your pan.)"}, {"step": "Lift the rings away from the crumpets using 2 forks or similar, then flip them over and cook on the other side for 1 minute, until lightly golden. Use another 1 tsp oil for the next batch, and so on. Eat straight away or, for the best texture, cool on a rack then lightly toast before serving with butter and honey (or your favourite topping)."}], "nutrition": {"Energy": "Per crumpet with butter and honey (10) 940kJ 225kcals", "Fat": "12g", "Saturated Fat": "5.2g", "Carbohydrate": "25g", "Sugars": "6.8g", "Protein": "3.9g", "Salt": "0.5g", "Fibre": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/o/overnight-crumpets.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}