{"title": "Ox cheek & mushroom pies", "tags": null, "planning": {"prep_time": "PT1 hour, plus chillingM", "cook_time": "PT4 hours, plus coolingM", "total_time": "PT5 hours, plus coolingM", "serves": "4"}, "ingredients": [{"item": "2 Waitrose Ox Cheeks (600-800g each), trimmed of fat, at room temperature"}, {"item": "Few splashes of Filippo Berio"}, {"item": "Mild & Light Olive Oil"}, {"item": "300g chestnut mushrooms, sliced"}, {"item": "30g dried porcini mushrooms, soaked in 200ml boiling water for 20 minutes (reserve the liquid)"}, {"item": "1 large garlic clove, chopped"}, {"item": "330ml bottle pale ale"}, {"item": "500ml fresh beef or chicken stock"}, {"item": "2 bay leaves"}, {"item": "2 sprigs fresh thyme leaves"}, {"item": "15g McDougalls Plain Flour, plus extra for dusting"}, {"item": "15g butter, softened"}, {"item": "500g block shortcrust pastry"}, {"item": "1 egg yolk, beaten"}], "instructions": [{"step": "Heat a large lidded casserole over a high heat. Season the ox cheeks and rub with oil. Fry until browned, then remove to a plate."}, {"step": "Turn the heat down slightly, then add a little oil and the chestnut and soaked mushrooms to the pan and fry until golden. Stir in the garlic, then pour in the ale, mushroom liquid and stock. Add the herbs and return the beef to the pan."}, {"step": "Bring to the boil, then turn down to a simmer. Cover and cook for 3 hours until the meat is tender enough to be pulled apart with two forks. Put the beef on a plate, and pull it apart into smaller chunks."}, {"step": "In a bowl, make a beurre manié by mixing together the flour and the butter. Beat this into the sauce over a medium heat and simmer for 20 minutes until thick and glossy. Return the beef to the pan, season, then spoon into 4 x 300ml ovenproof pie dishes. Allow to cool slightly."}, {"step": "Preheat the oven to 220°C, gas mark 7. To make the pastry lids, divide the dough into 4. Take one piece (wrap the rest in clingfilm and chill) and, on a lightly floured worktop, roll out to a 0.5cm-thick oval shape that’s 2cm larger than the top of each pie dish. Repeat with the remaining pastry."}, {"step": "Cut a thin strip from around the edge of each pastry lid. Stick to the rim of the dishes using egg yolk, then brush with more yolk. Lift the lids onto the dishes and press to the strips to seal. Trim any excess pastry, then crimp the edges. Cut a cross in the pastry lids. Brush with more egg yolk. Chill for 10 minutes."}, {"step": "Use the remaining pastry to make a pattern for the top, if desired. Brush the pies with the remaining egg yolk. Bake on a baking sheet for 25 minutes until the pastry is golden."}, {"step": "Braise 4 ox cheeks using the same amount of liquid, herbs and beurre manié needed to make 4 pies. Cook until the sauce has reduced by half. Double the pastry. To stretch 2 ox cheeks to feed 8, fry whole, peeled, shallots before the mushrooms and double the quantity of mushrooms."}], "nutrition": {"Energy": "2,581 616", "Fat": "28.4g", "Saturated Fat": "10.7g", "Carbohydrate": "51.5g", "Sugars": "3.6g", "Protein": "38.5g", "Salt": "1.6g", "Fibre": "5.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/Ox_Cheek_Pies2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}