{"title": "Pain de campagne (Country loaf)", "tags": null, "planning": {"prep_time": "PT20 minutes, plus overnight proving, resting and risingM", "cook_time": "PT40M", "total_time": null, "serves": "900g loaf"}, "ingredients": [{"item": "150g strong white bread flour"}, {"item": "large pinch dried active yeast"}, {"item": "150g strong white bread flour, plus extra for dusting"}, {"item": "150g LOVE life crunchy mixed seed bread flour"}, {"item": "100g rye flour"}, {"item": "11⁄2 tsp fine salt"}, {"item": "1 tsp dried active yeast"}, {"item": "vegetable oil, for kneading"}], "instructions": [{"step": "The night before, prepare the poolish; in a deep bowl, beat together the flour and yeast with 150ml lukewarm water until combined. Scrape down the sides, cover with cling film and set aside at room temperature for 8-15 hours. The next day, mix the remaining flours, salt and yeast, then gradually incorporate into the poolish with another 175ml lukewarm water until you have a smooth, but slightly sticky dough. Knead vigorously on a well-oiled surface for 20 seconds, then lightly coat with oil and rest for 10 minutes; knead and rest again twice more. 3 Flatten the kneaded dough out into a long rectangle and fold the top and bottom thirds over each other like a book. Flatten the dough out into a long rectangle again and fold as before. Transfer to an oiled bowl, cover with cling film and leave to rise for about 1 hour; repeat the folding, then leave to rise for another hour. Now shape the dough. Flatten slightly on a lightly floured surface and, working around the dough, pull all the edges into the centre, then flip over. Rotate the dough a few times in your hands, pressing firmly to seal the base, and create a smooth domed surface. Place, seam-side up, in a floured proving basket. If you don’t have a proving basket, place, seam-side down, on a well-floured chopping board. Lightly flour the exposed surface of the bread, cover with a clean tea towel and leave to rise until doubled in size – about 1-2 hours. Preheat the oven to high. Place a deep baking tray of water in the bottom of your oven (this creates steam for the crust) and a baking stone (or flat baking sheet) on the middle shelf. If using a proving basket, flip the dough onto the hot stone or tray. If the bread has proved on a chopping board, run a knife under the dough to loosen it, then slide onto the hot surface. Quickly cut a few slashes into the top of the bread, then return to the oven. After 10 minutes, reduce the oven to 220 ̊C, gas mark 7, then bake for another 30 minutes, until golden and hollow- sounding when you tap the base. (If the bread browns too quickly, reduce the oven to 200 ̊C, gas mark 6.) Cool on a wire rack before slicing to serve."}], "nutrition": {"Energy": "753.12kJ 180kcal", "Fat": "1.5g", "Saturated Fat": "0.3g", "Carbohydrate": "35.6g", "Sugars": "0.6g", "Protein": "5.9g", "Salt": "0.2g", "Fibre": "2.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sourdough bread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}