{"title": "Pain Façon Beaucaire", "tags": null, "planning": {"prep_time": "PT20 minutes, plus 30 minutes provingM", "cook_time": "PT15M", "total_time": "PT35M", "serves": "8 small rolls"}, "ingredients": [{"item": "10g yeast or 7g dried easy-blend yeast"}, {"item": "500g strong bread flour"}, {"item": "10g salt"}, {"item": "50g white flour, for dusting"}, {"item": "50g wholemeal flour, for dusting"}], "instructions": [{"step": "Rub the yeast into the flour using your fingertips as if making a crumble (if using easy-blend, just mix it in). Add the salt and 350ml water. Hold the bowl with one hand and mix the ingredients around with the other hand or with the rounded end of a plastic scraper for 2–3 minutes, until the dough starts to form. Pour the dough onto an unfloured work surface. It will feel soft and moist, and look like sticky porridge.  Forget the way you might think you knead dough. Don’t pummel it with the heels of your hands: instead slide your fingers under it like two forks with your thumbs on top, swing it upwards and slap it back down away from you. Stretch the front of the dough towards you, then lift it back over itself in an arc. Repeat until the dough feels smooth, silky and elastic. Allow 5–10 minutes.  Lightly flour the surface of the dough and fold the edges over to make a ball. Turn it over so the top is smooth. Lightly flour a bowl and place the dough in it. Cover the bowl with a clean tea towel and leave it to rise for 1 hour, until almost doubled in size.  Preheat the oven to 240°C/gas 9 (or as high as your oven will go). Once the dough has rested, use the rounded end of a scraper to transfer the dough onto a work surface dusted with a little white flour and flatten it out with your hands into a 25cm x 35cm rectangle. Brush with a little water and sprinkle on some wholemeal flour. Fold the dough over lengthways, leaving 3cm of the bottom half exposed. Brush this edge with water, fold it back over the dough and seal.  Lay a well-floured, clean tea towel on the worktop. Place the dough, seam-side-down, on the tea towel and flour the exposed surface. Cover with another tea towel and leave to prove somewhere warm and draught-free for 30 minutes.  Cut the dough widthways into 8 x 3cm slices. Place the pieces on a baking tray on their side, open out the holes gently so they look a bit like oval doughnuts with smaller, thinner holes. Mist the inside of the oven with a water spray. Bake the rolls in the oven for 12–15 minutes until golden brown."}], "nutrition": {"Energy": "1054.368kJ 252.0kcal", "Fat": "1.1g", "Saturated Fat": "0.2g", "Sugars": "1.1g", "Salt": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/0807083-r03.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}