{"title": "Easy pancakes", "tags": null, "planning": {"prep_time": "PT10 minutes + 30 minutes restingM", "cook_time": "PT10M", "total_time": "PT20 minutes + 30 minutes restingM", "serves": null}, "ingredients": [{"item": "120g plain flour"}, {"item": "Pinch of salt"}, {"item": "1 medium egg, lightly beaten"}, {"item": "300ml milk"}, {"item": "Sunflower oil, for frying"}, {"item": "Caster sugar"}, {"item": "Lemon juice"}], "instructions": [{"step": "To begin, sift the flour and salt into a bowl. Make a well in the centre. Pour in the egg and about 50ml milk and start whisking, gradually incorporating the flour into the liquid. When you have a smooth batter in the middle, add a bit more milk and flour. Continue until all the milk is added, all the flour incorporated and the batter is slightly thicker than single cream. Add a touch more milk if needed. Incorporating the flour gradually like this is the best way to avoid lumps. Alternatively, make the batter in a food processor. Cover the batter and leave to stand for 30 minutes. This allows the starch in the batter to swell and soften, giving a lighter result. If it thickens while resting, add a little more milk to bring it back to the right consistency. The batter must be quite thin or you'll end up with thick pancakes with big holes in, as a result of not being able to swirl it around the pan quickly enough before it sets. Heat a heavy 18cm-20cm frying pan over a medium heat. When the pan is thoroughly heated, add 1 tbsp oil, swirl around then tip out any excess. Add enough batter to just coat the base of the pan (40-50ml), swirling it around quickly to make an even layer. Cook for 1-2 minutes, or until the edge begins to curl and the base is golden brown. Use a fish slice or palette knife to flip the pancake. Cook for 30-60 seconds more, then transfer to a warm plate. Return the pan to the heat, add a touch more oil, pour out any excess and repeat with the rest of the batter. The first one or two pancakes are reliably disastrous but the rest should be beautiful. Serve hot from the pan with lemon juice and caster sugar."}], "nutrition": {"Energy": "426.768kJ 102.0kcal", "Fat": "4.2g", "Saturated Fat": "0.9g", "Sugars": "5.7g", "Salt": "0.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Pancakes_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}