{"title": "Panna cotta with pastis-macerated strawberries", "tags": null, "planning": {"prep_time": "PT15 minutes, plus 5 hours chillingM", "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "1½ tsp icing sugar"}, {"item": "1 tsp pastis, such as Pernod"}, {"item": "1½ tsp balsamic vinegar"}, {"item": "A few mint leaves, cut into strips"}, {"item": "7g leaf gelatine"}, {"item": "200ml double cream"}, {"item": "200 ml milk"}, {"item": "80g caster sugar"}, {"item": "½ vanilla pod, halved and seeds scraped out"}, {"item": "½ orange, grated zest"}, {"item": "200g greek yogurt"}, {"item": "200g strawberries"}], "instructions": [{"step": "Put the gelatine leaves in a bowl with plenty of cold water and leave to soften for 5 minutes.  Pour the cream and milk into a small saucepan and add the sugar, vanilla seeds and pod and orange zest. Place on a medium heat, bring to a simmer, then take off the heat immediately. Remove the vanilla pod.  Put the yogurt in a mixing bowl and pour in the hot milk and cream in a slow stream, whisking constantly. Squeeze the water out of the gelatine, then add the softened leaves to the mixture and stir until completely dissolved. Pour into 4 x 150ml moulds (darioles or ramekins) and leave to set in the fridge for at least 5 hours, or overnight.  Hull the strawberries 1 hour before serving, halve lengthways, then cut each half into 3 wedges. Place in a mixing bowl with the icing sugar, pastis and balsamic vinegar, then stir gently and set aside.  Dip the moulds in a bowl of hot water for a few seconds to make it easier to tip out the puddings (you may also need to shake the moulds gently; don’t worry, the puddings will come out eventually). Once out, top with plenty of strawberries and their juices and garnish with the mint."}], "nutrition": {"Energy": "1891.168kJ 452.0kcal", "Fat": "34.0g", "Saturated Fat": "21.0g", "Sugars": "30.0g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/201006WKWE83r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}