{"title": "Pappardelle with slow cooked veal ragù", "tags": null, "planning": {"prep_time": "PT10 minutes, plus restingM", "cook_time": "PT110M", "total_time": "PT2 hours, plus restingM", "serves": "4"}, "ingredients": [{"item": "8 pieces (about 125-150g each) veal (or pork) osso bucco, well chilled"}, {"item": "4 tbsp olive oil"}, {"item": "250ml dry white wine"}, {"item": "½ x 400g pack Cooks’ Ingredients"}, {"item": "Soffritto Mix"}, {"item": "2 cloves garlic, crushed"}, {"item": "1 tbsp tomato purée"}, {"item": "2 sprigs rosemary"}, {"item": "500ml pack Cooks’ Ingredients Chicken Stock"}, {"item": "250g pack Giuseppe Cocco Pappardelle All’Uovo"}, {"item": "75g pecorino cheese, finely grated, plus extra to serve"}, {"item": "25g pack fresh flat leaf parsley, leaves only, roughly chopped"}], "instructions": [{"step": "Preheat the oven to 220ºC, gas mark 7. Place the meat into a large roasting tin and pour over the oil. Season well and turn the pieces to ensure they are well coated in oil. Roast in the oven for 20 minutes until browned."}, {"step": "Remove the tin from the oven and baste the meat with the pan juices. Pour the wine into the tin, followed by the soffritto, garlic, tomato purée, rosemary and stock. Mix well then cover the tin with foil."}, {"step": "Return to the oven and reduce the temperature to 180ºC, gas mark 4. Cook for 1½ hours until very tender. Remove from the oven and leave to rest with the foil still on."}, {"step": "Meanwhile, bring a large pan of lightly salted water to the boil. Add the pappardelle, bring back to the boil and cook for 5 minutes, until just tender. Separately, shred the veal very finely using two forks, discarding the bones, thick pieces of fat and the rosemary sprigs, but leaving the marrow from each bone."}, {"step": "Using some tongs lift the hot pasta straight from its cooking water into the veal tin. Add the pecorino and parsley and toss everything together, adding 3-6 tablespoons of the pasta cooking water. Season and serve with extra pecorino and the fennel salad."}], "nutrition": {"Energy": "2983.192kJ 713kcals", "Fat": "30.9g", "Saturated Fat": "9.6g", "Carbohydrate": "45.8g", "Sugars": "4.6g", "Salt": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/2013wked-December-r1vealragu.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}