{"title": "Parsnip, carrot & potato mash with roasted garlic", "tags": null, "planning": {"prep_time": "PT10 minutesM", "cook_time": "PT45-50 minutesM", "total_time": "PT55 minutesM", "serves": "6-8"}, "ingredients": [{"item": "1 bulb garlic"}, {"item": "Olive oil, to drizzle"}, {"item": "700g Duchy Organic Potatoes, peeled and cut into 3cm chunks"}, {"item": "300g Duchy Organic Carrots, peeled and cut into 3cm chunks"}, {"item": "300g Duchy Organic Parsnips, peeled and cut into 3cm chunks"}, {"item": "100ml full fat milk"}, {"item": "50g unsalted butter"}, {"item": "25ml extra virgin olive oil"}, {"item": "50ml double cream"}, {"item": "½ lemon, finely grated zest"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Place the garlic bulb on a square of foil. Crack it open, but do not peel, and drizzle with a little oil before wrapping it up into a parcel.  Roast for 45-50 minutes until the cloves are soft."}, {"step": "Boil the potatoes in salted water for about 15-20 minutes, or until tender. Meanwhile, boil the carrots and parsnips in another pan of salted water for about the same amount of time. Drain the potatoes in one sieve (keeping the pan) and carrots and parsnips in another. Allow to steam dry for a minute or so."}, {"step": "Push the potatoes through the sieve into a bowl. Using a stick blender or food processor blend the carrots and parsnips until smooth, squeeze the soft garlic cloves in and blend again to combine."}, {"step": "Pour the milk, butter, olive oil and cream into the empty potato pan and return to a low heat to warm through. Tip the potato into the pan with the carrot mixture, add the cream mixture and beat to combine. Stir in the lemon zest and season to taste before serving."}], "nutrition": {"Energy": "1,272kJ 305kcals", "Fat": "17g", "Saturated Fat": "8.1g", "Carbohydrate": "30g", "Sugars": "8.8g", "Protein": "5g", "Salt": "0.1g", "Fibre": "7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Parsnipmash.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}