{"title": "Passion fruit and vanilla layer cake", "tags": null, "planning": {"prep_time": "PT1 hour 30 minutes, plus cooling and chillingM", "cook_time": "PT55M", "total_time": "PT2 hours 25 minutes, plus cooling and chillingM", "serves": "10-12"}, "ingredients": [{"item": "300g unsalted butter, at room temperature, plus extra for greasing"}, {"item": "300g caster sugar"}, {"item": "5 eggs"}, {"item": "1 tsp vanilla bean paste"}, {"item": "200g self-raising flour"}, {"item": "100g ground almonds"}, {"item": "½ tsp salt"}, {"item": "1-2 tbsp whole milk"}, {"item": "8 large passion fruit"}, {"item": "1 tbsp lemon juice"}, {"item": "75g caster sugar"}, {"item": "3 egg yolks (reserve the whites for the meringue buttercream)"}, {"item": "1 egg"}, {"item": "90g unsalted butter, chilled"}, {"item": "3 egg whites (use the yolks in the passion fruit curd)"}, {"item": "200g caster sugar"}, {"item": "2 tsp vanilla bean paste"}, {"item": "¼ tsp fine salt"}, {"item": "300g unsalted butter, cubed, at room temperature"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease 3 x 18cm round sandwich tins and line the bases with baking parchment. For the cakes, use a freestanding mixer or electric beaters to cream the butter and sugar for 4-5 minutes until light and fluffy. Beat in the eggs, one at a time, then the vanilla. Fold in the flour, ground almonds and salt until combined. Fold in the milk, 1 tbsp at a time, until you get a batter that will drop off a spoon easily. Divide between the tins and level the tops with the back of a spoon. Bake for 22-25 minutes until golden, risen and just coming away at the edges. (If you’re baking them on more than 1 oven shelf, swap the cakes around after 20 minutes.) Leave to cool in the tins."}, {"step": "For the curd, scoop the pulp and seeds out of 7 passion fruit (the last one is for decoration). Sieve into a heatproof bowl, pushing the pulp through with a wooden spoon to extract as much juice as possible. Scrape any juice from the base of the sieve into the bowl and discard the seeds."}, {"step": "With a balloon whisk, beat the lemon juice, sugar, egg yolks, whole egg and a pinch of salt into the passion fruit juice until combined. Set the bowl over a pan of simmering water. Cut the chilled butter into cubes then add to the mixture, whisking continuously over a gentle simmer until it thickens into a curd – about 15 minutes. Remove the bowl from the pan, cool a little at room temperature, then cover the surface of the curd with baking parchment (or cling film); chill."}, {"step": "Once the cakes and curd are cool, make the buttercream. Put the egg whites, sugar and vanilla in a large heatproof bowl and set over a pan of simmering water. With a clean balloon whisk, continuously whisk the mixture lightly until the sugar has dissolved. To test, dip 2 fingers into the whites and rub together; if you can still feel sugar grains, it needs a little more time."}, {"step": "Remove the bowl from the heat and tip the mixture, along with the salt, into a freestanding mixer fitted with the whisk attachment (or use electric beaters). Whisk on medium-high for about 5-6 minutes until a thick, glossy meringue has formed and can hold its peaks. Continue to whisk, adding the butter a piece at a time. Once it’s all added you should have a silky buttercream. If there are lots of air bubbles, whisk on a low speed (or mix by hand with a spatula) until smooth. Transfer to a piping bag."}, {"step": "To assemble the cake, carefully remove the sponges from the tins. Pipe a small blob of buttercream onto the centre of a cake board or cake plate and secure the bottom sponge in place. (It’ll be easier if you set it on a cake turntable too.) Pipe a layer of buttercream over the top of the sponge and smooth out with a palette knife to a thin layer (about 0.5cm). Scrape the excess into a bowl and set aside. Then pipe a ring of buttercream around the edge to act as a barrier for the curd; chill for 10 minutes."}, {"step": "Remove the cake from the fridge. If the curd is a bit stiff, loosen with a few drops of water, then spoon about ¹⁄ ³ of the curd into the middle of the buttercream. Top with the second sponge and repeat the above method with the buttercream and curd. Set the final sponge on top and chill for 10 minutes."}, {"step": "Now you need a crumb coat – a thin layer of icing that seals the cake. Using any excess buttercream scraped into the bowl (adding in a bit more from the piping bag if needed), use a palette knife to apply a very thin layer all over the cake, creating an even, smooth shape and finish. Chill for 10 minutes."}, {"step": "For the final icing, pipe buttercream all around the sides of the cake and smooth out with the palette knife. Finally pipe buttercream in a spiral over the top of the cake and smooth out, creating a neat join at the top and sides. Chill again for 10 minutes. Mix the pulp from the final passion fruit into the remaining curd and spoon over the top of the cake, letting it drip down the edges in places (if there’s too much curd, reserve the extra to serve with the cake). Either serve immediately or chill until ready to eat, letting the cake sit at room temperature for about 30 minutes before slicing."}], "nutrition": {"Energy": "Per serving (12) 3313kJ 796kcals", "Fat": "56g", "Saturated Fat": "31g", "Carbohydrate": "63g", "Sugars": "50g", "Protein": "9.5g", "Salt": "0.6g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Passion-fruit-and-vanilla-layer-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}