{"title": "Pasta salad with roasted tomatoes and sweet pepper dressing", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes, plus coolingM", "cook_time": "PT45M", "total_time": null, "serves": null}, "ingredients": [{"item": "400g cherry tomatoes, halved, at room temperature"}, {"item": "2 packs Romano peppers"}, {"item": "1 tbsp sherry vinegar"}, {"item": "2 cloves garlic, roughly chopped"}, {"item": "3 tbsp extra virgin olive oil"}, {"item": "1 tsp demerara sugar"}, {"item": "Juice 1 lemon"}, {"item": "400g pasta shapes, such as fusilli or penne"}, {"item": "200g mixed pitted olives (such as Waitrose Greek Mixed Olives), roughly chopped"}, {"item": "25g pack fresh chives, roughly chopped"}, {"item": "25g pack fresh basil, leaves roughly torn"}, {"item": "70g pack Waitrose Wild Rocket, roughly chopped"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. Place the cherry tomatoes in a roasting tin and cook in the oven for 45 minutes, until slightly caramelised. Preheat the grill to high. Place the whole peppers into the grill pan and cook for 10 minutes, turning frequently, until blackened and charred (you could also do this on a barbecue, if you wish). Remove from the heat, place in a bowl and cover with clingfilm until cool enough to handle. Carefully rub off most of the blackened skin, then slit the peppers open with a knife and remove the seeds and stalk. Place the pepper flesh in a small food processor with the vinegar, garlic, olive oil, sugar and lemon juice. Blitz until smooth, season and set aside. Cook the pasta in a large pan of lightly salted boiling water for 10 minutes or until al dente. Drain well and toss in a large bowl with the dressing until coated then leave to cool to room temperature. Mix in the olives, herbs, rocket and roasted tomatoes, then serve."}], "nutrition": {"Energy": "1,810kj 431kcals", "Fat": "16.9g", "Saturated Fat": "2.4g", "Carbohydrate": "59g", "Sugars": "10.5g", "Protein": "10.7g", "Salt": "2g", "Fibre": "6.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/RoastedtomatoPastaSalad2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}