{"title": "Paul Hollywood's flourless chocolate and almond cake", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT45-50 minutesM", "total_time": "PT1 hour 10 minutesM", "serves": "12"}, "ingredients": [{"item": "265g Waitrose Belgian dark chocolate"}, {"item": "6 Waitrose British Blacktail eggs, 5 separated + 1 whole"}, {"item": "210g caster sugar"}, {"item": "150g ground almonds"}, {"item": "3 tbsp apricot jam"}, {"item": "120ml double cream"}, {"item": "120g Waitrose Belgian dark chocolate"}], "instructions": [{"step": "Pre-heat your oven to 180°C, gas mark 4. Grease and base line a 21cm round loose bottom cake tin. Melt the chocolate in a bowl over a pan of simmering water and then allow to cool a little."}, {"step": "Whisk the egg whites in a large bowl until stiff.  In another bowl using an electric whisk, beat the egg, egg yolks and sugar together until thick and pale. The mixture should leave a trail on the surface when the beaters are lifted."}, {"step": "Whisk the ground almonds, melted chocolate and 1tbsp of egg white into the egg yolk mixture. Using a metal spoon carefully fold the remaining egg whites into the chocolate mixture. Pour the mixture into the prepared tin."}, {"step": "Bake for 45-50 minutes, until the crust that forms on top of the cake is firm and the sides shrink away from the tin. Leave the cake to cool in the tin for at least 10 minutes. Then turn it out, upside down onto a clean tea towel on a wire rack. Remove the parchment from the cake and leave to cool completely. Turn the cake the right way up on the rack and remove the tea towel. Gently heat the jam and brush it evenly over the top and sides of the cake."}, {"step": "To make the topping, melt the cream and chocolate in a bowl over a pan of simmering water. Stir occasionally until smooth and glossy. Allow to cool so the topping begins to thicken, but don’t let it set. Pour onto the centre of the cake and allow it flow over the top and the sides of the cake. Use a palette knife to spread around the sides and completely coat the cake. Leave to set before serving."}, {"step": "© Copyright Paul Hollywood"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/PH_Flawless-chocolate-cake400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}