{"title": "Paul Hollywood's chocolate brioche doughnuts", "tags": null, "planning": {"prep_time": "PT20 minutes + proving overnightM", "cook_time": "PT30M", "total_time": "PT50 minutes + proving overnightM", "serves": "20 chocolate doughnuts"}, "ingredients": [{"item": "500g strong white bread flour, plus extra for dusting"}, {"item": "7g salt"}, {"item": "50g caster sugar"}, {"item": "10g instant yeast"}, {"item": "140ml warm full fat milk"}, {"item": "5 medium eggs"}, {"item": "250g unsalted butter, softened, plus extra for greasing"}, {"item": "200g Waitrose continental plain chocolate, broken into squares"}, {"item": "3 litres sunflower oil"}, {"item": "Caster sugar for dredging"}], "instructions": [{"step": "Put the flour and sugar into the bowl of the mixer, fitted with a dough hook, and add the salt to one side and the yeast to the other.  Add the milk and the eggs and mix for about 8 minutes until smooth."}, {"step": "Knead the dough on a slow speed for 5 minutes then gradually start to add the butter. Once all of the butter has been incorporated and the dough is smooth and sticky, increase the speed and knead for a further 6 minutes. Pour the dough into a large bowl (remember that the dough will almost double in size), cover with cling film and place in the fridge overnight."}, {"step": "Lightly dust the work surface with flour, turn out the dough and knock it back. Divide the dough into 20 balls (about 60g each).  Flatten each one out a little and put 10g of chocolate in the middle – you may have to break the chocolate into smaller pieces so it sits snugly in the middle. Form the dough into a ball around the chocolate and roll to smooth."}, {"step": "Place the balls on a lightly floured tray and cover with a clean plastic bag or cling film and leave to prove for an hour or until doubled in size."}, {"step": "Heat the oil in the fryer to 180C and gently place the doughnuts, 2 at a time, into the pan or the fryer.  They will puff up and float so you will need to turn them over periodically so that they cook evenly on all sides. They do take on colour quickly because of the sugar and butter in the dough, but you need to cook them for about 10-12 minutes so that they cook through and the chocolate melts."}, {"step": "Remove from the fryer with a slotted spoon and drain on kitchen paper.  Dredge with caster sugar and serve."}, {"step": "© Copyright Paul Hollywood"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/PH_Doughnuts400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}