{"title": "Paul Hollywood's chocolate Victoria sandwich cake", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT20-25 minutesM", "total_time": "PT45M", "serves": "10"}, "ingredients": [{"item": "4 medium eggs – weighed in their shell (about 245g)"}, {"item": "The weight of the eggs in butter, softened (about 245g)"}, {"item": "The weight of the eggs in caster sugar (about 245g)"}, {"item": "The weight of 3 eggs in Waitrose extra fine sponge flour (about 185g)"}, {"item": "The weight of 1 egg in cocoa powder (about 63g)"}, {"item": "1 tsp baking powder"}, {"item": "Splash of milk"}, {"item": "75g softened butter"}, {"item": "225g sieved icing sugar"}, {"item": "60g Waitrose Belgian dark chocolate – melted"}, {"item": "1 tbsp icing sugar mixed with 1 tsp cocoa powder to dust the top of the cake."}], "instructions": [{"step": "Preheat the oven to 180C, gas mark 4. Grease and base line two 21cm loose bottom cake tins. Cream the butter and sugar together until pale and fluffy. Beat the eggs together. Gradually add to the creamed butter and sugar until well incorporated."}, {"step": "Sieve the flour, cocoa and baking powder together.  Fold into the mixture. Add a splash of milk to loosen the mixture if it’s too stiff."}, {"step": "Divide the mixture between the two prepared tins. Smooth over the surface so it’s level. Bake for 20-25 minutes. The cake should be springy to touch and have shrunk from the sides of the tin. Leave to cool in the tins for a few minutes, and then remove from the tins and leave to cool on a wire rack."}, {"step": "To make the filling, beat the butter with the icing sugar until smooth. Pour in the melted chocolate and stir. Add 1tbsp milk if needed to make more spreadable."}, {"step": "When the cakes are completely cold, sandwich together with the chocolate butter cream. Place the icing sugar and cocoa powder in a sieve and dust over the top of the cake."}, {"step": "© Copyright Paul Hollywood"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/PH_Chocolate-cake400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}