{"title": "Peach and hazelnut frangipane tart", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus chillingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 35 minutes, plus chillingM", "serves": "8"}, "ingredients": [{"item": "150g blanched hazelnuts"}, {"item": "150g golden caster sugar"}, {"item": "150g unsalted butter, softened"}, {"item": "¼ tsp salt"}, {"item": "1 egg, plus 2 yolks, lightly beaten"}, {"item": "45g plain flour, plus extra to dust"}, {"item": "3 peaches, thinly sliced"}, {"item": "icing sugar, to dust"}, {"item": "110g white spelt flour"}, {"item": "115g plain flour"}, {"item": "120g unsalted butter, chilled and cut into cubes"}, {"item": "1 tbsp golden caster sugar"}, {"item": "1 medium orange, zest"}, {"item": "1 egg yolk"}], "instructions": [{"step": "For the pastry, put the flours, butter and a pinch of salt in a food processor and pulse until the mixture resembles breadcrumbs. Add the sugar, orange zest, egg yolk and 1½ tbsp cold water and pulse again. Bring the dough together with your hands (add another ½ tbsp cold water if needed), then shape into a disc. Wrap in cling film and chill for 20 minutes."}, {"step": "Preheat the oven to 200˚C, gas mark 6, and put a baking sheet in to heat up. On a lightly floured surface, roll out the pastry to fit a 24cm tart tin that’s about 3.5cm deep, leaving the excess overhanging. Prick the base, then line with baking parchment and baking beans; bake for 7 minutes on the hot baking sheet. Remove the paper and beans and bake for 7-9 minutes, until the base is sandy. Trim off the overhanging pastry with a serrated knife. Turn the oven down to 180°C, gas mark 4."}, {"step": "Meanwhile, for the filling, pulse the hazelnuts in a food processor to fine crumbs; tip onto a plate. Put the sugar, butter and salt in the processor and whizz until light and fluffy. Beat in the eggs, then add the ground hazelnuts and flour. Spoon into the pastry case, arrange the peach slices on top and bake for 50 minutes to 1 hour, until golden. Cool slightly in the tin, then remove and put on a wire rack to cool further. Dust with icing sugar and serve warm or at room temperature with crème fraîche, if liked."}], "nutrition": {"Energy": "2,685kJ 645kcals", "Fat": "43g", "Saturated Fat": "19g", "Carbohydrate": "52g", "Sugars": "28g", "Protein": "9.9g", "Salt": "0.1g", "Fibre": "5.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Peach-frangipane-tart.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}