{"title": "Peaches and cream salted caramel cake", "tags": null, "planning": {"prep_time": "PT25 minutes, plus coolingM", "cook_time": "PT20M", "total_time": "PT45 minutes, plus coolingM", "serves": "10 - 12"}, "ingredients": [{"item": "250g unsalted butter, softened plus extra for greasing"}, {"item": "250 g golden caster sugar"}, {"item": "4 eggs"}, {"item": "4 tbsp whole milk"}, {"item": "1 tsp vanilla extract"}, {"item": "1 tbsp lemon juice"}, {"item": "320g jar Waitrose seriously Buttery Caramel dipping sauce"}, {"item": "250g self-raising flour"}, {"item": "½ tsp salt"}, {"item": "60g pecan halves, roughly chopped"}, {"item": "½ tsp sea salt"}, {"item": "300ml double cream"}, {"item": "1 tsp vanilla bean paste or extract"}, {"item": "1 tbsp icing sugar, plus extra for dusting"}, {"item": "4 peaches, sliced"}], "instructions": [{"step": "Preheat the oven to 180 C, gas mark 4. Grease 3 x 20cm round cake tins and line the bases with baking parchment. Using electric beaters, cream the butter and sugar in a large bowl for 2-3 minutes until light and fluffy. In a jug, lightly whisk together the eggs, milk, vanilla extract and lemon juice; slowly pour into the creamed butter and sugar, beating until combined."}, {"step": "Gently beat in 2 tbsp caramel sauce, then the flour and salt. Divide between the tins; bake for 18-20 minutes until the cakes are golden and a skewer inserted into their centres comes out clean. Remove from the oven and let them cool in their tins on a wire rack. Toast the pecans on a baking tray in the oven for 5 minutes; set aside to cool."}, {"step": "Mix the sea salt with the remaining caramel sauce; set aside. In another bowl, whisk the cream, vanilla and icing sugar to soft peaks. Set aside a few nuts. Halve the caramel, cream and remaining nuts; divide the peaches into 3 piles. Set them all next to you ready for assembly."}, {"step": "Put 1 sponge on a plate. Top with ½ the caramel and pecans, and 1/3 of the peaches; spoon over ½ the cream. Put the second sponge on top, then the remaining caramel and pecans, another 1/3 peaches and the remaining cream. Put the last sponge on top, dust with icing sugar, pile the remaining peaches in the centre and scatter with the reserved nuts."}], "nutrition": {"Energy": "2627.552kJ 628Kcal", "Fat": "41.7g", "Saturated Fat": "23.8g", "Carbohydrate": "56.9g", "Sugars": "41.1g", "Protein": "6.3g", "Salt": "0.8g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Peaches and cream salted caramel cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}