{"title": "Peanut Butter Millionaire's Shortbread", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": "PT40M", "serves": "20"}, "ingredients": [{"item": "150g unsalted butter"}, {"item": "150g plain flour"}, {"item": "50g crunchy peanut butter"}, {"item": "100g caster sugar"}, {"item": "175g choppeed salted roasted peanuts"}, {"item": "75g dark brown soft sugar"}, {"item": "50g golden syrup"}, {"item": "100ml double cream"}, {"item": "1 tsp vanilla extract"}, {"item": "100g dark chocolate"}, {"item": "75g milk chocolate"}], "instructions": [{"step": "Preheat the oven to 190˚C, gas mark; grease and line a 20cm square cake tin."}, {"step": "Beat 100g softened and diced unsalted butter into plain flour, until just combined. Mix in crunchy peanut butter, 25g caster sugar and a pinch of salt; don’t over-mix."}, {"step": "Press evenly into the tin, then bake for 15 minutes, or until golden. Scatter over chopped salted roasted peanuts; set aside."}, {"step": "Next, make a caramel by heating dark brown soft sugar, golden syrup, 50g unsalted butter and double cream in a small pan over a low-medium heat. Let the sugar dissolve, then bring to the boil, stir until smooth and take off the heat."}, {"step": "Dissolve 75g caster sugar and 1-2 tbsp water in another pan over a low heat without stirring. Bring to the boil and cook to an amber-hued caramel 5 about minutes."}, {"step": "Take off the heat, carefully add the cream mixture, stir and return to the boil. Cook until it reaches 118˚C on a sugar thermometer. Immediately take off the heat; stir in tsp vanilla extract."}, {"step": "Spoon the caramel over the shortbread; cool completely. Melt dark chocolate with milk chocolate until smooth; cool for minutes."}, {"step": "Spoon over the caramel, leave to set, then cut into pieces."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/millionaire shortbread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}