{"title": "Pear, white chocolate and cardamom tart", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes, plus coolingM", "cook_time": "PT50-55 minutesM", "total_time": "PT1 hour 5 minutes - 1 hour 10 minutes, plus coolingM", "serves": "6-8"}, "ingredients": [{"item": "250g block Cooks' Ingredients Shortcrust Pastry, defrosted"}, {"item": "250g tub ricotta"}, {"item": "75g caster sugar"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "50g white chocolate"}, {"item": "100ml double cream"}, {"item": "1 tsp ground cardamom (from about 8-10 pods, seeds removed and crushed)"}, {"item": "2 large ripe pears, peeled, cored and quartered"}, {"item": "Icing sugar, for dusting (optional)"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6.  Roll out the pastry and use it to line a 23cm loose-bottomed flan tin.  Line with baking parchment and baking beans, then bake blind for 15 minutes.  Remove the beans and parchment then return to the oven for a further 5 minutes, until golden.  Remove and leave to cool completely. Beat the ricotta with the sugar until smooth, then beat in the eggs one at a time.  Gently melt the chocolate in the microwave or over a pan of simmering water and stir into the ricotta mixture.  Fold in the cream and ground cardamom. Arrange the pears over the base of the pastry case and pour over most of the ricotta mix.  Slide the flan into the oven on a baking sheet and top up the filling from a jug.  (This will avoid it spilling as you move the tart to the oven.)  Bake for 10 minutes then reduce the oven temperature to 170°C, gas mark 3 and continue to cool for a further 20-25 minutes until the filling is just set.  Turn off the oven and leave the tart to cool completely in the oven.  Chill until ready to serve.  Dust with icing sugar, if you wish.  Great with vanilla ice cream or cream."}], "nutrition": {"Energy": "1,451kj 348kcals", "Fat": "20.8g", "Saturated Fat": "12.7g", "Carbohydrate": "32.4g", "Sugars": "19.3g", "Protein": "7.7g", "Salt": "0.3g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Pear&CardamonTart_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}