{"title": "Pear and cardamom tarte tatin", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 30 minutes, plus coolingM", "serves": "8"}, "ingredients": [{"item": "10 cardamom pods, seeds removed and roughly crushed"}, {"item": "¼ tsp ground ginger"}, {"item": "¼ tsp ground cinnamon"}, {"item": "50g salted butter"}, {"item": "150g caster sugar"}, {"item": "4-5 conference, comice or concorde pears, peeled, halved and cored"}, {"item": "250g all butter puff pastry"}], "instructions": [{"step": "Preheat the oven to 220˚C, gas mark 7. Mix together the crushed cardamom seeds and spices. Melt the butter in a 20cm heavy-based, ovenproof frying pan. Remove from the heat, sprinkle in the sugar and stir. Set over a gentle heat until the sugar has dissolved, then turn up the heat a little and cook for about 5 minutes, giving it the odd shake, until it turns a mid-brown caramel."}, {"step": "Turn down the heat. Sprinkle in the spice mixture, then add the pear halves, rounded-side down; the fruit needs to be snug in the pan, so squeeze in an extra piece or two, if needed. Bubble very gently in the sauce for about 25 minutes, then transfer the pears to a plate and put the sauce back on a high heat, reducing until it is thick and syrupy. Rearrange the pears in the pan, still rounded-side down, and leave to cool for 5 minutes."}, {"step": "Roll out the pastry on a floured surface to the thickness of a £1 coin. Cut around a plate to make a circle 1cm wider than your pan. Place on top of the pears and tuck in around the edges. Prick all over with a fork and pierce a hole in the centre to help steam escape. Bake for 25-30 minutes, until well risen and golden. Cool for 10 minutes, then carefully invert onto a large plate. Serve warm, in slices, with crème fraîche, cream or vanilla ice cream, if liked. LH"}], "nutrition": {"Energy": "1,278kJ 305kcals", "Fat": "13g", "Saturated Fat": "7.9g", "Carbohydrate": "44.5g", "Sugars": "33.2g", "Protein": "2.4g", "Salt": "0.3g", "Fibre": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Waitrose_Harvest_October_7737LR2.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}