{"title": "Pineapple-coconut cake", "tags": null, "planning": {"prep_time": "PT35 minutes, plus coolingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 50 minutes, plus coolingM", "serves": "16"}, "ingredients": [{"item": "400g fresh pineapple flesh"}, {"item": "160g unsalted butter, softened, plus extra for greasing"}, {"item": "150g golden caster sugar"}, {"item": "3 large eggs"}, {"item": "5 tbsp coconut milk, stirred"}, {"item": "2 tsp vanilla extract"}, {"item": "275g self-raising flour"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "120g desiccated coconut"}, {"item": "175g golden icing sugar"}], "instructions": [{"step": "Finely chop the pineapple (reserving the juice from the chopping board) and put in a large frying pan with 10g butter. Cook over a medium heat, stirring often, for 10 minutes until any liquid released has evaporated and the pineapple has turned golden yellow. Set aside to cool."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Lightly butter a 20cm square cake tin (or a 23cm round, springform tin) and line with baking parchment. Put the remaining 150g butter in a mixing bowl with the caster sugar. Using electric beaters, cream until light and fluffy. Mix in the eggs, one by one, then add 2 tbsp coconut milk, the vanilla extract and a pinch of salt. Sift in the flour and bicarbonate of soda; add the desiccated coconut and cooled pineapple. Fold together with a large metal spoon or a spatula, until evenly combined. Pour into the cake tin and smooth the top. Bake in the centre of the oven for 1 hour-1 hour 5 minutes, until well risen, golden and firm in the centre. Cover loosely with foil if the top browns too quickly. Set aside to cool in the tin for 30 minutes until barely warm."}, {"step": "In a bowl, stir together the remaining 3 tbsp coconut milk with 1½ tbsp reserved pineapple juice until smooth (if you don't have enough juice, add boiled water to make up the amount). Sift over the icing sugar and whisk together to make a glaze. Pour over the just-warm cake, smoothing evenly, and leave to cool completely. Some of the icing will be absorbed into the surface of the sponge. Cut the cooled cake into 16 squares (or wedges if a round cake) to serve."}], "nutrition": {"Energy": "1,259kJ 301kcals", "Fat": "15g", "Saturated Fat": "10g", "Carbohydrate": "36g", "Sugars": "23g", "Protein": "3.8g", "Salt": "0.4g", "Fibre": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Pineapple-coconut-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}