{"title": "Pistachio & rose water semolina cake", "tags": null, "planning": {"prep_time": "PT45M", "cook_time": "PT60M", "total_time": "PT105M", "serves": "10"}, "ingredients": [{"item": "3 cardamom pods, seeds only"}, {"item": "150g pistachios, shelled, plus extra to serve"}, {"item": "100g ground almonds"}, {"item": "175g semolina"}, {"item": "1¼ tsp baking powder"}, {"item": "¼ tsp salt"}, {"item": "300g unsalted butter, at room temperature"}, {"item": "325g caster sugar"}, {"item": "4 Waitrose British Blacktail Free Range Medium Eggs, lightly beaten"}, {"item": "1 unwaxed lemon, grated zest, plus 1 tbsp juice"}, {"item": "1 tsp Nielsen-Massey Rose Water"}, {"item": "½ tsp vanilla essence"}, {"item": "200g Greek yogurt"}, {"item": "200g crème fraîche"}, {"item": "1 tbsp icing sugar"}, {"item": "½–1 tsp Nielsen-Massey Rose Water"}, {"item": "40 unsprayed red rose petals"}, {"item": "1 Waitrose British Blacktail Free Range Medium Egg white"}, {"item": "100g caster sugar"}, {"item": "120ml lemon juice"}, {"item": "1 tsp Nielsen-Massey Rose Water"}, {"item": "120g caster sugar"}], "instructions": [{"step": "Grease a round, 23cm, loose-bottomed cake tin and line with baking parchment. Preheat the oven to 170°C, gas 3. Put the cardamom seeds and pistachios in a food processor and grind to a powder. Add the ground almonds, semolina, baking powder and salt; mix again briefly. Beat the butter and sugar until pale and fluffy. Add the egg in small amounts, incorporating it well. Fold in the mixed dry ingredients, then the lemon zest and juice, rose water and vanilla. Put it into the lined tin, level and bake for 50 minutes to 1 hour until a skewer comes out oily but dry. Meanwhile, put all the ingredients for the syrup in a small saucepan; bring to the boil to dissolve the sugar, then remove from the heat. Remove the cake from the oven; while it is still hot, spoon all but 4 tbsp of hot syrup over. Allow the cake to cool, then take out of the tin. Reduce the oven to 80°C, gas ¼. Dip the rose petals in egg white, shake off any excess and scatter over the sugar. Transfer to an oven tray lined with greaseproof paper. Bake for 30–45 minutes until crisp, turning halfway. Whisk together all the rose cream ingredients. Slice the cake and drizzle with the reserved syrup; serve with the cream and scatter over some chopped pistachios and the petals."}], "nutrition": {"Energy": "3167.288kJ 757.0kcal", "Fat": "51.7g", "Saturated Fat": "25.0g", "Sugars": "51.1g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/0805056-r06.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}