{"title": "Martha's pistachio & lemon macaroons", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT60M", "cook_time": "PT13M", "total_time": "PT1 hour 10 minutes to 1 hour 13 minutesM", "serves": "About 40 macaroons"}, "ingredients": [{"item": "80g pistachios"}, {"item": "80g ground almonds"}, {"item": "180g icing sugar"}, {"item": "120ml egg white (from about 3"}, {"item": "large essential Waitrose Eggs)"}, {"item": "160g caster sugar"}, {"item": "Few drops Dr Oetker Green Gel Food Colour"}, {"item": "150g lemon curd"}], "instructions": [{"step": "Line 2 large baking trays with baking parchment, drawing 2cm circles on the back to help make all the macaroons the same size."}, {"step": "Place the pistachios in a food processor and blend until they are the same consistency as the almonds. Add the ground almonds and the icing sugar to the processor. Blitz until well mixed together, then pour the mixture into a large bowl."}, {"step": "Add half the egg white to the finely ground nuts and icing sugar, and stir until a stiff paste forms. Set aside while you make the Italian meringue."}, {"step": "Add the caster sugar to a small saucepan with 3 tablespoons of water. Bring to the boil and stir until the sugar has dissolved. Heat until the syrup registers 118°C on a sugar thermometer. Meanwhile, put the remaining egg white into the clean bowl of a stand-up mixer fitted with the whisk attachment. As the syrup is nearing 118°C, whisk the egg white on high speed until it reaches soft peaks and just holds its shape on the whisk."}, {"step": "Remove the syrup from the heat as soon as it reaches temperature and slowly pour down the side of the bowl into the egg whites in a steady stream, whisking continuously. Continue to whisk on high until the mixture has cooled slightly and the bowl is no longer hot to touch. The mixture should be thick and glossy. Add a small amount of gel food colouring into the meringue until you get a pale green colour."}, {"step": "Scrape the meringue into the mixed nut paste in the large bowl. Fold together until the mixture runs in a thick ribbon from the spatula, disappearing back into the mix within 10 seconds. Transfer the batter into a piping bag fitted with a 1cm round piping tip and pipe 80 circles onto the baking parchment, using the drawn circles as a guide and smoothing out any peaks."}, {"step": "Leave the macaroons to dry for at least 30 minutes until a thin skin has formed on top; it may take a little longer if the kitchen is humid. They should no longer be sticky to touch and will have a matt appearance. While you are waiting, preheat the oven to 150°C, gas mark 2."}, {"step": "Bake in the centre of the oven, one tray at a time, for 10-13 minutes. The shells should not have started to brown, but should be firm and sound hollow when lightly tapped. Leave to cool for a few minutes before peeling from the baking parchment."}, {"step": "When the macaroons are cool, pipe a small amount of lemon curd into the centre of one half and sandwich them together. The macaroons will keep for 3-4 days at room temperature in an airtight box."}], "nutrition": {"Energy": "318kJ 76kcals", "Fat": "3g", "Saturated Fat": "0.7g", "Carbohydrate": "11g", "Sugars": "10.2g", "Protein": "1.2g", "Salt": "trace g", "Fibre": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Pistachio-&-lemon-Macaroons_146364.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}