{"title": "Plum and almond cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 30 minutes, plus coolingM", "serves": "8"}, "ingredients": [{"item": "175g unsalted butter, softened"}, {"item": "300g plums, halved"}, {"item": "150g golden caster sugar"}, {"item": "3 eggs"}, {"item": "1 tsp almond extract"}, {"item": "125g self-raising flour"}, {"item": "100g ground almonds"}, {"item": "2 tbsp flaked almonds"}, {"item": "2 tbsp plum conserve"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Grease a 20cm cake tin and line the base with baking parchment. Chop 200g of the plums into 1cm dice, then slice the rest into wedges; set both aside separately."}, {"step": "Put the butter and sugar in a large bowl then, using electric beaters, cream together until light and fluffy. Beat in the eggs, one at a time, until combined, then beat in the almond extract."}, {"step": "In a separate bowl, mix together the flour, ground almonds and a large pinch of salt, then fold into the egg mixture until just combined. Spoon some of the mixture into the cake tin to just cover the base. Fold the diced plums through the remaining mixture, then spoon it all into the cake tin. Arrange the plum wedges on top and bake for 50-60 minutes until risen, golden and a skewer inserted into the centre comes out clean."}, {"step": "Cool in the tin for 10 minutes, then remove and put on a wire rack to cool completely. When ready to serve, toast the flaked almonds in a small frying pan until golden and fragrant; tip into a bowl. Add the jam and 1 tbsp water to the frying pan and heat through, stirring to combine. Brush the jam over the top of the cake and scatter with the flaked almonds."}], "nutrition": {"Energy": "2,003kj 481kcals", "Fat": "30g", "Saturated Fat": "13g", "Carbohydrate": "41g", "Sugars": "29g", "Protein": "9g", "Salt": "0.3g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Plum-and-almond-cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}