{"title": "Poached chicken and pink grapefruit salad with tamarind dressing", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT15M", "total_time": "PT40M", "serves": "4"}, "ingredients": [{"item": "2 lemon grass stalks"}, {"item": "100g natural roasted cashew nuts, toasted and roughly chopped"}, {"item": "90g palm sugar or soft brown sugar"}, {"item": "2cm fresh root ginger, ½ finely chopped, ½ in strips, peelings reserved"}, {"item": "2 red chillies, deseeded, 1 finely chopped, 1 in strips"}, {"item": "2 tbsp tamarind paste"}, {"item": "3 tbsp thai fish sauce"}, {"item": "160ml coconut cream"}, {"item": "1 lime, juice only"}, {"item": "3 skinless chicken breast fillets"}, {"item": "1 large carrot, peeled"}, {"item": "½ cucumber, peeled"}, {"item": "2 pink grapefruits"}, {"item": "2 shallots, halved and very finely sliced"}, {"item": "15g coriander leaves"}, {"item": "15g mint leaves"}], "instructions": [{"step": "Trim the woody ends from the lemon grass stalks; peel away the outer layer and reserve. Finely slice the softer core. Chop half the cashew nuts more finely.  Put the sugar in a frying pan with 2 tbsp water over a medium heat. Once the sugar has dissolved, add the chopped lemon grass, fi nely chopped cashews, chopped ginger and chopped chilli. Simmer, without stirring, for 2 minutes; stir in the tamarind, fish sauce and coconut cream. Simmer for 1 minute, take off the heat and stir in the lime juice. Adjust to taste – it should be hot, sweet, salty and sour. Cover and set aside.  Put the chicken in a pan and cover with cool water. Add the lemon grass trimmings, the ginger peelings and a pinch of salt. Bring to a boil, simmer for 8 minutes, then take off the heat and leave for 15 minutes. Drain.  Meanwhile, use a vegetable peeler to pare the carrot into a bowl, in strips. Do the same with the cucumber, discarding the core. Peel the grapefruit, cut out the segments from the membranes and add to the bowl.  Shred the chicken and add it with the shallots, herbs (reserving a few leaves) and dressing. Toss, divide onto plates and top with the reserved cashews, sliced chilli and ginger and the remaining herbs."}], "nutrition": {"Energy": "2058.528kJ 492.0kcal", "Fat": "22.0g", "Saturated Fat": "10.0g", "Sugars": "33.0g", "Salt": "2.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/201007WKWE74r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}