{"title": "Porchetta-style pork belly with garlic roasties", "tags": null, "planning": {"prep_time": "PT40 minutes + cooling and restingM", "cook_time": "PT4M", "total_time": "PT4 hours 40 minutes + cooling and restingM", "serves": "6 - 8"}, "ingredients": [{"item": "1.5-1.7kg Waitrose 1 British Free Range Pork Belly Joint, unrolled, trimmed of excess fat"}, {"item": "1 tbsp fennel seeds, roughly ground"}, {"item": "1 tbsp chilli flakes"}, {"item": "3 unwaxed lemons, plus wedges to serve"}, {"item": "2 tbsp olive oil, plus 200ml for the roasties"}, {"item": "3 large fennel bulbs, 2 cored and finely sliced and 1 quartered, fronds reserved"}, {"item": "20g pack rosemary, leaves only, roughly chopped"}, {"item": "20g pack sage, leaves only, roughly chopped"}, {"item": "10 cloves garlic, finely chopped, plus 1 halved bulb for the roast potatoes"}, {"item": "50g pine nuts"}, {"item": "50g fresh breadcrumbs"}, {"item": "50g raisins"}, {"item": "2kg Maris Piper or King Edward potatoes, unpeeled and cut into rough 2-3cm chunks"}, {"item": "10g pack bay leaves"}], "instructions": [{"step": "Pat the pork belly dry with kitchen paper and if you haven’t done so already, score the skin deeply at 1.5cm intervals. Make 3 even, deep cuts into the flesh-side, without cutting into the fat. Season, then rub with the fennel seeds, chilli flakes and finely grated zest of 1 lemon. Allow to stand at room temperature for 30 minutes."}, {"step": "To make the stuffing, warm 2 tablespoons oil in a heavy-based frying pan and cook the sliced fennel over a medium heat for 10 minutes, partially covered, until soft and brown. Uncover and cook over a medium heat for 15-20 minutes, stirring often, until sticky and caramelised. Add the herbs, chopped garlic and pine nuts. Cook for 5 more minutes, then stir in the breadcrumbs, raisins, and the juice of the zested lemon. Spoon onto a large plate and leave to cool completely."}, {"step": "Preheat the oven to 150˚C, gas mark 2. Press the cooled stuffing onto the flesh side of the pork belly and tightly roll widthways so that it only just closes up. Tie securely with cook’s string. Place the tied joint on top of the quartered fennel, in the centre of a large, deep roasting tray. Place the potatoes and remaining 2 lemons, roughly chopped, around the meat with the halved garlic bulb and bay leaves, drizzling them all with the extra 200ml oil. Roast for 2 hours 45 minutes, uncovered, tossing the potatoes halfway through, until everything is tender."}, {"step": "Remove the joint and garlic to a plate and rest under foil for 30 minutes. Turn the oven up to 250˚C, gas mark 9. Toss the potatoes and roast for another 10-15 minutes. Return the pork to the pan and roast for a final 20 minutes or so, turning if necessary, until the skin has crackled and puffed up. Set aside to rest for a few more minutes. Squeeze the roasted garlic from the bulb and mix into the potatoes. Remove the string and crackling, then cut the pork into slices. Serve with the crackling and the potatoes sprinkled with the reserved fennel fronds. Delicious with some seasonal green vegetables."}], "nutrition": {"Energy": "3,306kJ 791kcals", "Fat": "44.1g", "Saturated Fat": "12.7g", "Carbohydrate": "53.2g", "Sugars": "7.5g", "Protein": "45.3g", "Salt": "0.5g", "Fibre": "5.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Waitrose-Weekend_WK359_WkEnd_Sunday_Porchetta-Style-Pork-Belly-Roasties.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}