{"title": "Pork belly steamed buns", "tags": null, "planning": {"prep_time": "PT35 minutes, plus cooling and provingM", "cook_time": "PT3 hours 25 minutesM", "total_time": "PT4 hours, plus cooling and provingM", "serves": "4"}, "ingredients": [{"item": "500g joint pork belly, skin removed"}, {"item": "500ml fresh chicken stock"}, {"item": "100g hoisin sauce"}, {"item": "4 salad onions, finely sliced"}, {"item": "25g lard, chilled and cubed"}, {"item": "75g plain flour"}, {"item": "50g strong white bread flour"}, {"item": "¼ tsp salt"}, {"item": "1 tbsp golden caster sugar"}, {"item": "5g easy bake yeast"}, {"item": "75ml whole milk"}, {"item": "½ tsp baking powder"}, {"item": "vegetable oil, for greasing"}, {"item": "½ cucumber, very finely sliced"}, {"item": "3 tbsp Chinese rice vinegar"}, {"item": "1 tsp light brown muscovado sugar"}], "instructions": [{"step": "Preheat the oven to 140˚C, gas mark 1. Season the pork and place in a baking dish with the stock. Cover the dish tightly with foil and braise in the oven for 3 hours. Rest in the stock until cool."}, {"step": "Meanwhile, make the buns. Rub the lard into the flours until incorporated, then stir in the salt, sugar and yeast. Heat the milk to just before boiling, then pour into the flour mixture, quickly combining to a smooth dough. Knead vigorously for a few minutes on a floured surface. Place in a bowl, cover with cling film and prove until doubled in size – about 1-2 hours."}, {"step": "Knead the baking powder into the dough, then divide and roll into 8 smooth buns (about 30g each). Cover with cling film and leave to rise for another 30 minutes, until doubled in size."}, {"step": "Gently roll each bun on a floured surface to an oval about 10cm long, 7cm wide and 0.5cm thick. Place each on parchment paper and brush the tops generously with oil. Carefully fold in half widthways, then cover with cling film again and rest for another 20 minutes."}, {"step": "Transfer the pork from the baking dish to a foil-lined tray. Put the stock in a pan and boil until reduced by ¾; stir in the hoisin sauce."}, {"step": "Turn the grill to high (about 250˚C) and glaze the pork with a little sauce. Grill for 2-3 minutes, then glaze and grill again, repeating until all the sauce is used up – about 15 minutes in total."}, {"step": "Steam the buns in a steamer for 6-8 minutes, until puffed up and cooked through (you may need to do this in batches). Meanwhile, shred or slice the pork and mix all the pickled cucumber ingredients together with a pinch of salt. Fill the buns with the pork, pickled cucumber and salad onions."}], "nutrition": {"Energy": "2,627kJ 628kcals", "Fat": "32.4g", "Saturated Fat": "11.3g", "Carbohydrate": "44.7g", "Sugars": "20.7g", "Protein": "39.3g", "Salt": "2.5g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/waitrose-20111473097_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}