{"title": "Pork & prunes with dumplings", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT2M", "total_time": "PT2 hours 20 minutesM", "serves": "4"}, "ingredients": [{"item": "2 tbsp vegetable or sunflower oil"}, {"item": "1.25 kg pork shoulder steaks or pig cheeks"}, {"item": "1 onion, peeled and diced"}, {"item": "1 carrot, peeled and diced"}, {"item": "2 sticks celery, peeled and diced"}, {"item": "1 star anise"}, {"item": "1 fresh bay leaf"}, {"item": "2 sprigs of thyme"}, {"item": "1 tbsp tomato purée"}, {"item": "12 prunes, roughly chopped"}, {"item": "700ml chicken stock"}, {"item": "250g self-raising flour"}, {"item": "75g butter, cubed"}, {"item": "25g pack parsley, leaves only, roughly chopped"}, {"item": "4 salad onions, trimmed and finely sliced"}], "instructions": [{"step": "Heat the oil in an ovenproof casserole dish over a high heat and brown the pork in batches, frying until golden all over. Remove and set aside on a plate."}, {"step": "Reduce the heat to medium, add the onion, carrot and celery and fry for about 5 minutes, stirring regularly. Drop in the star anise, bay leaf and thyme and fry, along with the vegetables, for another minute."}, {"step": "Squeeze in the tomato purée and mix with the vegetables. ‘Cook out’ the tomato purée, stirring almost constantly for a further minute. Scrape in the chopped prunes and return the pork. Mix together before pouring in the stock. Bring the stock up to the boil, place on a lid and simmer the ingredients for about 90 minutes by which time the meat should be incredibly tender."}, {"step": "Preheat your oven to 190°C, gas mark 5. Rub together the self-raising flour and butter until it resembles the texture of breadcrumbs. Stir in the chopped parsley and salad onions and season. Gradually add about 60-80ml of water to the mix, or enough to form a soft dough."}, {"step": "Shape the dough into 8 even-sized balls and drop them, regularly spread, in to the simmering stew. Place the casserole into your preheated oven, uncovered, and bake for 20 minutes, basting the cooking dumplings once during this time. The dumplings are ready when they are puffed up and deep golden brown on top. Serve with seasonal greens."}], "nutrition": {"Energy": "2,911kJ 1,028kcals", "Fat": "53.6g", "Saturated Fat": "14.4g", "Carbohydrate": "44.2g", "Sugars": "11.9g", "Protein": "49.1g", "Salt": "2g", "Fibre": "3.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Pork-and-prunes-WR-WK-240915v2.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}