{"title": "Pot-roast leg of lamb with haricot beans", "tags": null, "planning": {"prep_time": "PT45 minutes, plus soaking overnightM", "cook_time": "PT105M", "total_time": "PT150M", "serves": "4, with leftovers"}, "ingredients": [{"item": "350g dried haricot beans, soaked overnight"}, {"item": "1 medium onion, halved, with the root left intact"}, {"item": "3 cloves"}, {"item": "1 large carrot, finely chopped"}, {"item": "2 celery sticks, finely chopped"}, {"item": "1 bay leaf"}, {"item": "3 thyme sprigs, leaves removed"}, {"item": "1 x ½ garlic bulb, still joined at the root end"}, {"item": "2 tsp sea salt"}, {"item": "Lamb"}, {"item": "1800g lamb leg"}, {"item": "3 rosemary sprigs"}, {"item": "2 tbsp dijon mustard"}, {"item": "4 garlic cloves, crushed"}, {"item": "2 tbsp olive oil"}, {"item": "150g smoked bacon lardons"}, {"item": "2 onions, finely sliced"}, {"item": "150ml dry white wine"}, {"item": "150ml chicken stock"}], "instructions": [{"step": "Drain the soaked beans and place in a large saucepan. Stud the onion halves with the cloves, then add to the pan with the carrot, celery, herbs and garlic. Cover with 3-4cm water and bring to a boil; simmer for 1 hour until the beans are soft. Remove and discard the onion and garlic. Drain the beans (you can keep and freeze the cooking water to use as stock), then stir through the salt. You can prepare this a day ahead and keep the beans covered in the fridge."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Make 10 incisions in the fleshy side of the lamb with a sharp knife. Finely chop the leaves from 1 rosemary sprig and mix with the mustard, garlic and 1 tbsp olive oil. Season the lamb well, then rub with the mixture, pushing it into the incisions."}, {"step": "Heat the remaining oil in a large casserole dish. Add the lamb and brown over a medium heat until well coloured on all sides (about 10 minutes). Remove the meat and tip off all but 1 tbsp of the fat. Add the lardons and onions and cook for 5 minutes until soft but not brown, then pour in the wine and bubble for 1 minute more. Add the beans, stock and remaining rosemary sprigs."}, {"step": "Put the meat on top, pour in any juices, and push down into the beans. Bring to a simmer, cover with a lid and put in the oven for 40-45 minutes. Remove the lid and cook for 30 minutes more until the lamb is cooked and the beans are soft."}, {"step": "Remove from the oven, replace the lid and leave for 15-20 minutes. Serve with the onions and turnips, recipes overleaf."}], "nutrition": {"Energy": "2698.68kJ 645kcals", "Fat": "28.2g", "Saturated Fat": "10.3g", "Carbohydrate": "31.2g", "Sugars": "5g", "Salt": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/2012wkwe-Jan-r06.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}