{"title": "Potato salad with chorizo & duck egg", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT25M", "total_time": "PT35M", "serves": "2"}, "ingredients": [{"item": "400g new potatoes"}, {"item": "200g pack Unearthed Smoked Cooking Chorizo Sausages"}, {"item": "1 tsp vegetable oil"}, {"item": "3 tbsp dried breadcrumbs"}, {"item": "2 tbsp parsley, roughly chopped"}, {"item": "2 duck eggs"}, {"item": "65g soured cream"}, {"item": "2 salad onions, finely sliced"}, {"item": "Pinch of Cooks’ Ingredients Herby Zaatar"}], "instructions": [{"step": "Boil the potatoes until they are tender, about 15-20 minutes. Drain and leave until cool enough to handle."}, {"step": "While the potatoes are cooking gently, run a knife along the length of the chorizo sausages. Turn the sausages ‘inside out’ and discard the skin so that all you are left with is the sausage meat."}, {"step": "Heat the oil over a low-medium heat and add the sausage meat. Gently fry the meat, breaking it into small pieces with a wooden spoon as it cooks. When the meat is broken up, cook for 2-3 minutes on a high heat until the sausage is cooked through with no pink meat."}, {"step": "Sprinkle in the dried breadcrumbs and continue to stir with the chorizo. Remove from the heat, and stir through the chopped parsley."}, {"step": "Bring a pan of water just to the boil. As the first bubbles appear, crack in your duck eggs and leave to poach over a very low heat for 4 minutes (for a runny yolk)."}, {"step": "While the eggs are poaching, take each potato and gently crush it in your fingers to just break it open. Place the potatoes in a bowl, then add the soured cream and the chopped spring onions. Mix well to combine and season."}, {"step": "Divide the potato salad between two plates, top with the chorizo and breadcrumb mix. Lay the poached eggs on top and finish with a sprinkling of the herby zaatar."}], "nutrition": {"Energy": "2,824kJ 677kcals", "Fat": "43.1g", "Saturated Fat": "16.3g", "Carbohydrate": "40.4g", "Sugars": "5.2g", "Protein": "31.9g", "Salt": "2.7g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Potato-salad-with-chorizo-&-duck-egg.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}