{"title": "Potato skewers with barbecued ketchup", "tags": null, "planning": {"prep_time": "PT10 minutes, plus coolingM", "cook_time": "PT35M", "total_time": "PT45M", "serves": "8"}, "ingredients": [{"item": "1kg baby new potatoes, halved"}, {"item": "75ml olive oil"}, {"item": "10g pack bay leaves"}, {"item": "1 tsp sweet smoked paprika"}, {"item": "300g pack Red Choice Tomatoes, vines discarded"}, {"item": "1 large onion, quartered"}, {"item": "2 tbsp red wine vinegar"}, {"item": "1½ tsp cornflour"}], "instructions": [{"step": "Boil the potatoes in a large pan of salted water for 8-10 minutes, until just tender. Drain and leave to cool slightly. Mix with 2 tbsp olive oil and season. Alternately thread the oiled potatoes and bay leaves (folding the leaves if they are large) onto 8-16 metal or wooden skewers. Set aside."}, {"step": "Light or preheat the barbecue, griddle or grill to medium. Mix 1 tbsp of olive oil, the paprika and some seasoning together, then rub over the tomatoes and onion. Cook on the barbecue for 10 minutes, turning often, until softened and starting to colour."}, {"step": "Place the tomatoes and onion into a food processor with the remaining 2 tbsp olive oil and the vinegar. Blend until smooth, then press through a sieve into a saucepan. Mix the cornflour with 1 tbsp cold water and stir into the tomato sauce. Warm over a low heat and bring to a simmer for 5 minutes, stirring often, until slightly reduced and thickened."}, {"step": "Meanwhile, cook the potatoes on the barbecue for 10-15 minutes, turning often, until golden, tender and piping hot. Serve with the barbecued ketchup."}], "nutrition": {"Energy": "806kJ 192kcals", "Fat": "9.2g", "Saturated Fat": "1.4g", "Carbohydrate": "24.6g", "Sugars": "4.3g", "Protein": "2.8g", "Salt": "0.1g", "Fibre": "2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/WAITROSE_WEEKEND_258_POTATO_SKEWERS.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}