{"title": "Pretty feather-iced biscuits", "tags": null, "planning": {"prep_time": "PT1 hour + 30 minutes chillingM", "cook_time": "PT12M", "total_time": "PT1 hour 40 minutes-1 hour 42 minutesM", "serves": "24"}, "ingredients": [{"item": "100g unsalted butter, softened"}, {"item": "100g Waitrose Light Brown Fairtrade Muscovado Sugar"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg, lightly beaten"}, {"item": "1 tsp vanilla extract"}, {"item": "275g plain flour"}, {"item": "250g Royal icing sugar"}, {"item": "Pink, blue, yellow food colouring"}], "instructions": [{"step": "Line 2 baking sheets with baking parchment. In a bowl, beat the butter and sugar together until pale and fluffy. Beat in the egg and vanilla extract, then add the flour. Bring the mixture together, then knead lightly and form it into a ball. Wrap in clingfilm and chill for 30 minutes."}, {"step": "Preheat the oven to 180ºC, gas mark 4. Roll out half the dough at a time on a lightly floured surface to the thickness of a pound coin. Using a plain 7cm round cookie cutter, cut out 24 rounds and transfer them to the baking sheets. Bake for 10–12 minutes until pale golden. Transfer to a wire rack and leave to cool."}, {"step": "Mix the icing sugar with 3 tbsp water to make a smooth icing. Put 2–3 tbsp of the icing into a piping bag fitted with a small plain nozzle. Divide the rest between three bowls. Add a little food colouring separately to each bowl to make up the 3 pastel colours."}, {"step": "Spread 8 of the biscuits with blue icing. Pipe 5 lines of white icing at equal distances apart, then drag the tip of a cocktail stick across the white icing in alternate directions. Repeat with the pink and yellow icing on the remaining biscuits. Leave aside until the icing is set."}], "nutrition": {"Energy": "580kJ 138kcals", "Fat": "3.9g", "Saturated Fat": "2.4g", "Carbohydrate": "24.2g", "Sugars": "15.3g", "Protein": "1.4g", "Salt": "trace g", "Fibre": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/pretty_feather_iced_biscuits.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}