{"title": "Puy lentil salad with cumin-roasted carrots and cauliflower", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "2 x 150g packs baby topped carrots"}, {"item": "1 small cauliflower, outer leaves discarded, cut into large florets"}, {"item": "2 tbsp extra virgin olive oil"}, {"item": "½ tsp cumin seeds"}, {"item": "3 garlic cloves, unpeeled"}, {"item": "40g hazelnuts"}, {"item": "1 red onion,"}, {"item": "finely chopped"}, {"item": "30g fresh root ginger, finely chopped"}, {"item": "2 x 250g pouches ready-cooked puy lentils"}, {"item": "250g pouch ready-cooked wholegrain basmati rice"}, {"item": "1 tsp clear honey"}, {"item": "1 lemon, juice"}, {"item": "1 preserved lemon, flesh removed, rind finely chopped"}, {"item": "½ x 25g pack mint, leaves roughly chopped"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. In a roasting tin, toss the carrots and cauliflower in 1 tbsp oil with the cumin seeds; season and roast for 30-35 minutes, turning the vegetables and adding the garlic cloves halfway through. Put the hazelnuts on a separate baking tray and cook for the final 8 minutes of cooking time; roughly chop."}, {"step": "Meanwhile, heat ½ tbsp oil in a large pan over a low heat; add the onion, ginger and a pinch of salt. Cook for about 7 minutes, until softened. Stir in the lentils and rice until they are piping hot; season."}, {"step": "Transfer the roasted carrots and cauliflower to a warm plate. Carefully remove the skins from the garlic cloves and mash the soft flesh into the roasting tin. Tip into a small bowl with any residual roasting oil and cumin seeds. Add the remaining ½ tbsp oil, plus the honey, lemon juice, preserved lemon rind and most of the mint. Stir together and season. Add the dressing to the lentil mixture in the pan, toss together and divide between 4 plates. Top with the carrots and cauliflower. Scatter over the remaining mint leaves and toasted hazelnuts. Serve with a dollop of fat-free yogurt, if liked."}], "nutrition": {"Energy": "1,986kJ 474kcal", "Fat": "16g", "Saturated Fat": "2g", "Carbohydrate": "55g", "Sugars": "10g", "Protein": "20g", "Salt": "1.6g", "Fibre": "14g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/p/Lentil-Salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}