{"title": "Qing Zheng Lu Yu - Cantonese Steamed Sea Bass", "tags": null, "planning": {"prep_time": "PT5-8 minutes, plus 10-15 minutes marinatingM", "cook_time": "PT10M", "total_time": "PT33M", "serves": "2"}, "ingredients": [{"item": "5 salad onions, trimmed"}, {"item": "45g fresh root ginger"}, {"item": "1 sea bass, about 700g, gutted but with head and tail intact"}, {"item": "1 tbsp Chinese cooking wine or Shaoxing wine"}, {"item": "4 tbsp groundnut oil"}, {"item": "3 tbsp light soy sauce"}], "instructions": [{"step": "Cut 4 of the salad onions into 6cm lengths, then cut these lengthways into fine strips, keeping the green and white parts separate. Wash and peel the ginger, retaining the skin. Slice the peeled ginger lengthways, then cut the slices into long strips.  Shortly before cooking, rinse the fish in cold water and pat it dry. Crush the remaining 2 salad onions with the side of a cleaver blade. Make 3 or 4 shallow diagonal slashes on each side of the fish. Rub it inside and out with a little salt and the rice wine; place the ginger skin and crushed salad onion in the cavity and leave to marinate for 10-15 minutes.  Discard any juices, pat the fish dry, then steam over a high heat for 8–10 minutes, until just cooked and the dorsal fin pulls away easily. You can also check the thickest part of the fish; the flesh should have turned opaque closest to the bone. Transfer to a serving plate.  Heat the groundnut oil until smoking hot in a wok or small pan. Scatter the fish with the sliced ginger, then the sliced green salad onion and the sliced white salad onion. Drizzle over the hot oil, a little at a time (you should be able to smell the ginger and spring onion sizzling). Pour over the soy sauce and serve immediately."}], "nutrition": {"Energy": "2376.512kJ 568.0kcal", "Fat": "37.2g", "Saturated Fat": "7.2g", "Sugars": "1.8g", "Salt": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/q/0802050-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}