{"title": "Quick summer panna cotta", "tags": null, "planning": {"prep_time": "PT15 minutes + chillingM", "cook_time": "PT10 minutesM", "total_time": "PT25 minutesM", "serves": "4"}, "ingredients": [{"item": "2 x 400ml cans organic coconut milk"}, {"item": "(chilled overnight)"}, {"item": "1 vanilla pod"}, {"item": "60ml oat drink"}, {"item": "30g caster sugar"}, {"item": "2 tbsp Clearspring Agar Flakes"}, {"item": "For the coulis"}, {"item": "125g mixed summer berries, plus extra to serve"}, {"item": "25g maple syrup"}], "instructions": [{"step": "Remove the coconut milk from the fridge and open it without shaking. The coconut cream should have separated from the coconut water. Remove the cream and set aside (use the water for another recipe or a drink). Cut the vanilla pod in half lengthways and scrape out the seeds. Put the seeds and the pod into a medium saucepan."}, {"step": "Add the reserved coconut cream, oat drink and sugar and warm over a low heat, mixing with a whisk. When hot, sprinkle the agar over the mixture but do not stir. Bring to a simmer, then whisk the mixture. Simmer for 5-10 minutes, whisking occasionally, until all the agar has dissolved."}, {"step": "Remove the vanilla pod and divide the cream mixture between 4 x 125ml ramekins. Allow to cool at room temperature, then cover and place in the fridge for at least 1 hour or until set and ready to serve. Meanwhile, warm the coulis ingredients and 100ml water in a small saucepan over a low heat for 10 minutes, until softened. Remove and set aside to cool."}, {"step": "When ready to serve, sit the ramekins in warm water (coming about halfway up the sides) for a few minutes. Run a knife around the inside edge of each ramekin to loosen the panna cotta, then turn out onto serving plates or bowls. Decorate with the coulis and extra berries to serve."}], "nutrition": {"Energy": "1,786kj 431kcals", "Fat": "36g", "Saturated Fat": "33g", "Carbohydrate": "21g", "Sugars": "17g", "Protein": "2.8g", "Salt": "0.2g", "Fibre": "4.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/q/Quicksummerpannacotta.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}