{"title": "Raspberry cream shortbreads", "tags": null, "planning": {"prep_time": "PT30 minutes, plus 30 minutes chillingM", "cook_time": "PT15M", "total_time": "PT45 minutes, plus 30 minutes chillingM", "serves": "8-10"}, "ingredients": [{"item": "110g unsalted butter, at room temperature"}, {"item": "50g caster sugar, plus an extra 1 tbsp for sprinkling"}, {"item": "1 lemon, zest"}, {"item": "170g plain flour"}, {"item": "¼ tsp fine salt"}, {"item": "75g Tiptree Sweet Tip Raspberry Conserve"}, {"item": "1 tbsp double cream"}], "instructions": [{"step": "Using electric beaters, cream the butter and sugar in a bowl for 2-3 minutes until light and fluffy. Beat in the lemon zest, then sift in the flour and salt. Combine to a smooth paste."}, {"step": "Bring the dough together in your hands (it will be crumbly and soft) and place on a large sheet of parchment. Cover with more parchment and roll out the dough, between the sheets, to about 1.5cm thick. Chill for 30 minutes. Preheat the oven to 170°C, gas mark 3; line a large baking tray with parchment."}, {"step": "Remove the dough from the fridge and, still between the parchment, roll out further to about 0.3cm thick. Remove the top layer of parchment and, using a 7cm heart-shaped cookie cutter, stamp out as many biscuits as possible; transfer to the baking tray. Next, stamp a 3cm circle (use the base of a piping nozzle or cut freehand with a sharp knife) from the centre of ½ the hearts. Carefully remove the centres and re-roll with any scraps of dough to make more biscuits."}, {"step": "Scatter the biscuits with the extra 1 tbsp sugar and bake for 15 minutes or until light golden. Transfer to a wire rack to cool completely. Mix together the jam and cream. Spread 1 tsp over the unsugared side of the whole heart biscuits and top with the stamped-out biscuits. These are best eaten on the day of making (or store the biscuits and jam separately in airtight containers and assemble just before serving)."}], "nutrition": {"Energy": "Per serving (8) 1011kJ 245kcals", "Fat": "12.6g", "Saturated Fat": "7.9g", "Carbohydrate": "30.2g", "Sugars": "13.9g", "Protein": "2.3g", "Salt": "0.13g", "Fibre": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Raspberry-cream-shortbreads.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}