{"title": "Raspberry macarons", "tags": null, "planning": {"prep_time": "PT45 minutes, plus sitting and coolingM", "cook_time": "PT15 minutesM", "total_time": "PT1 hour, plus sitting and coolingM", "serves": "30-32"}, "ingredients": [{"item": "175g golden caster sugar"}, {"item": "65g egg whites (about 2 eggs)"}, {"item": "Almond paste"}, {"item": "175g ground almonds"}, {"item": "175g icing sugar"}, {"item": "65g egg whites (about 2 eggs)"}, {"item": "10g red food colour gel"}, {"item": "Berry buttercream"}, {"item": "125g unsalted butter, softened"}, {"item": "200g icing sugar"}, {"item": "3 tbsp raspberry coulis"}], "instructions": [{"step": "Preheat the oven to 150ºC, gas mark 2, and line 2 baking sheets with baking parchment. Put the sugar and 75ml water in a small pan and stir. Put a sugar thermometer in the pan and set over a high heat."}, {"step": "Meanwhile, put the egg whites in a separate bowl with a pinch of salt. Once the sugar syrup reaches 110˚C, start whisking the egg whites (either using electric beaters or a freestanding mixer) on a medium speed. Then, when the temperature has reached 114˚C (at which point the eggs should be frothy rather than whipped), remove the thermometer and quickly pour the syrup into the egg whites, turning the speed on the beaters to the highest setting. Beat at full speed for 5 minutes, to make a glossy, whipped meringue that holds its shape."}, {"step": "In a separate bowl, make the almond paste. Combine the ground almonds and icing sugar; add the egg whites and mix with a wooden spoon until a stiff paste has formed. Stir in the gel food colouring."}, {"step": "Now fold the meringue into the paste in 3 additions: add the first ⅓ of the meringue to the paste and mix well using a large metal spoon or spatula, ensuring there are no lumps. Fold in another ⅓ of the meringue, then fold in the remainder."}, {"step": "Fill piping bags with the mixture. Lift the baking parchment and pipe dots of the mixture into each corner of the trays, then stick the parchment back down. Pipe 60-64 macaron shells about 3cm in diameter in straight lines, going from left to right, leaving a 2cm gap in between each one. Leave them to spread and settle for at least 20 minutes (this also helps prevent cracking). Bake for 13 - 15 minutes, until set and shiny on top, crispy on the bottom. Cool on the trays."}, {"step": "For the buttercream, beat together the butter and icing sugar and a pinch of salt. Beat in the raspberry coulis, then scoop into a piping bag and use to sandwich the macaron shells together."}], "nutrition": {"Energy": "Per macaron (32) 577kJ 138kcals", "Fat": "6.3g", "Saturated Fat": "2.4g", "Carbohydrate": "18.6g", "Sugars": "18.3g", "Protein": "1.6g", "Salt": "trace", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Raspberry-macarons.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}