{"title": "Red lentil dhal with garlicky spinach and basmati rice", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT45M", "total_time": "PT55M", "serves": "4"}, "ingredients": [{"item": "3 tbsp vegetable oil"}, {"item": "1 onion, roughly chopped"}, {"item": "8 garlic cloves, 6 crushed, 2 sliced"}, {"item": "28g pack coriander, stalks finely chopped, leaves roughly chopped"}, {"item": "1 tsp dried chilli flakes"}, {"item": "2 tsp garam masala"}, {"item": "1 tsp ground coriander"}, {"item": "1 tsp ground cumin"}, {"item": "1 tsp ground turmeric"}, {"item": "200g red lentils"}, {"item": "1 litre fresh vegetable stock"}, {"item": "1 tsp fine sea salt"}, {"item": "240g basmati rice"}, {"item": "260g spinach"}, {"item": "1 lemon, juice"}], "instructions": [{"step": "Heat 2 tbsp oil in a large high-sided pan over a medium heat. Add the onion with a pinch of salt and cook, stirring often, for 5 minutes until beginning to soften. Add the crushed garlic, coriander stalks, chilli flakes, garam masala, ground coriander, cumin and turmeric. Fry for 2-3 minutes until aromatic. Rinse the lentils in a sieve until the water runs clear, then add to the pan with the stock and salt. Bring to the boil and simmer for 30-35 minutes, stirring every so often, until the lentils are cooked and starting to collapse."}, {"step": "Meanwhile, rinse the rice in a sieve until the water runs clear. Put in a large pan and cover with 480ml salted water. Bring to the boil, then reduce the heat to low, stir once, cover the pan and leave to simmer gently for 11 minutes (don’t lift the lid), until the liquid has been absorbed. Take off the heat, leaving the lid on, and stand for 5 minutes, before fluffing up with a fork."}, {"step": "Boil the kettle. Put the spinach in a large colander and pour over the boiling water until wilted. Rinse through cold water to cool it, then squeeze out all the liquid and sit the spinach on kitchen paper. In a frying pan, heat the remaining 1 tbsp oil, add the sliced garlic and fry for 1 minute, then add the spinach and toss through for 1-2 minutes until glossy. Stir the lemon juice and ½ the coriander leaves into the dhal; season if needed. Divide the rice between 4 bowls, top with the dhal and scatter over the remaining coriander leaves. Serve with the spinach and a dollop of yogurt (or dairy-free alternative), if liked."}], "nutrition": {"Energy": "2,248kJ 534kcals", "Fat": "12g", "Saturated Fat": "1.1g", "Carbohydrate": "80g", "Sugars": "7.1g", "Protein": "21g", "Salt": "1.6g", "Fibre": "8.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/red-lentil-dhal.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}