{"title": "Rhubarb crumble bars", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT1 hour 20 minutesM", "total_time": "PT1 hour 40 minutesM", "serves": "14 bars"}, "ingredients": [{"item": "400g forced rhubarb, chopped into small pieces"}, {"item": "100g caster sugar"}, {"item": "200g butter"}, {"item": "200g plain flour"}, {"item": "170g soft light brown sugar"}, {"item": "1 tsp ground ginger"}, {"item": "30g rolled oats"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg, yolk only"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Place the rhubarb into a roasting dish and sprinkle over the caster sugar. Roast for 25-30 minutes, or until the rhubarb begins to soften and becomes jammy. Strain off any excess liquid. Remove from the oven and allow to cool. Turn the oven to 180°C, gas mark 4."}, {"step": "Put the butter, flour, brown sugar and ginger into a food processor, and whizz until fine breadcrumbs form. Spoon half the mixture (about 300g) into a small bowl, then stir in the oats. This will be the crumble topping. Add the egg yolk to the remaining mixture in the food processor and pulse until a dough forms."}, {"step": "Grease and line a 23cm square tin with baking parchment. Press the dough into the bottom of the tin, pushing it right into the corners until it is a flat, even layer. Prick all over with a fork, then bake for 10 minutes near the bottom of the oven to dry it out slightly. Strain the rhubarb and discard the juice."}, {"step": "When the base is slightly crisper, spread the rhubarb on top, making sure it covers the whole base evenly. Gently squeeze the crumble topping using your hands so it clumps together slightly, then sprinkle it over the rhubarb. When it’s completely covered, bake for 40 minutes, or until the topping is golden brown and the rhubarb is bubbling through. Leave to cool for 15 minutes."}, {"step": "Slice the traybake into 14 bars, then eat warm or chill in the fridge for later. These bars will keep for up to 1 week in an airtight container."}], "nutrition": {"Energy": "1,058kJ 253kcals", "Fat": "12.6g", "Saturated Fat": "7.6g", "Carbohydrate": "32.6g", "Sugars": "20.4g", "Protein": "2.2g", "Salt": "0.3g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/WRWK07042016-rhubarb-crumble-bars-Martha.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}