{"title": "Rhubarb almond cake with orange", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25M", "cook_time": "PT1 hourM", "total_time": "PT1 hour 25 minutesM", "serves": "10"}, "ingredients": [{"item": "150g unsalted butter, very soft, plus extra for greasing"}, {"item": "150g golden caster sugar"}, {"item": "2 large eggs"}, {"item": "200g ground almonds"}, {"item": "115g white spelt or plain flour, sifted"}, {"item": "2 tsp baking powder"}, {"item": "2 tsp vanilla extract"}, {"item": "½ orange, zest"}, {"item": "1 tbsp Grand Marnier, Cointreau or orange juice"}, {"item": "350g slender rhubarb, cut into 2-3cm pieces"}, {"item": "1 tbsp demerara sugar"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and base-line a 20cm deep cake tin with a removable base. In a large bowl, beat the butter and caster sugar with electric beaters for a few minutes until light and fluffy. Add the eggs one at a time, beating thoroughly between each. Add the almonds, flour and baking powder, followed by the vanilla, orange zest and liqueur or juice; gently fold in."}, {"step": "Spoon ½ the batter into the prepared tin and cover with ½ the rhubarb. Spread the remaining batter on top and finish with the rest of the rhubarb, arranged in a pretty pattern if wished. Scatter over the demerara sugar."}, {"step": "Put the cake in the oven and immediately reduce the temperature to 170˚C, gas mark 3. Bake for about 1 hour, until golden with a firm centre. Cover loosely with foil halfway through the cooking time if it’s browning too much. Allow to cool in the tin. Serve sliced as a teatime cake or warmed as a pudding with ice cream, if liked."}], "nutrition": {"Energy": "1,603kJ 385kcals", "Fat": "24.9g", "Saturated Fat": "9.1g", "Carbohydrate": "27.6g", "Sugars": "20.1g", "Protein": "8.7g", "Salt": "0.3g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Rhubarb-almond-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}