{"title": "Rhubarb Crumble Squares with Orange Zest", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT55M", "total_time": "PT70M", "serves": "28 squares"}, "ingredients": [{"item": "75g cold butter, cubed"}, {"item": "125g plain flour"}, {"item": "75g demerara sugar"}, {"item": "400g rhubarb, chopped"}, {"item": "200g caster sugar"}, {"item": "175g butter, softened"}, {"item": "175g self-raising flour"}, {"item": "Finely grated zest of 1 orange"}, {"item": "3 medium eggs"}], "instructions": [{"step": "Preheat the oven to 180C, gas mark 4. Place the rhubarb in a pan with 25g of the caster sugar and cook gently on the hob for 7-8 minutes or until just tender. Drain through a sieve, reserving the juice (see Cook's tips), then leave the rhubarb to cool. Grease a rectangular baking tin (about 27cm x 17.5cm) and line the base with baking parchment.  To make the crumble topping, place the butter and flour in a food processor and blend until just combined. Add the demerara sugar and pulse a couple of times to give a rough crumble. Remove and set aside. (Alternatively, rub the butter into the flour by hand, then stir in the sugar).  For the cake mixture, blend the butter, remaining caster sugar, self-raising flour, orange zest and eggs in a food processor for 30 seconds, or beat with a wooden spoon.  Remove the blade from the bowl and stir in the cooled rhubarb. Spoon the mixture into the prepared tin and sprinkle over the crumble topping, pressing down with the back of a spoon. Place in the oven for 50-55 minutes or until the sponge is risen and the topping is golden. Remove from the oven, leave to stand for 5 minutes, then cool on a rack. Cut into 28 squares, ready to serve."}], "nutrition": {"Energy": "669.44kJ 160.0kcal", "Fat": "8.6g", "Saturated Fat": "5.1g", "Sugars": "11.2g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/3RhubarbCrumble_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}