{"title": "Rhubarb and cardamom custard cake", "tags": null, "planning": {"prep_time": "PT35 minutes, plus coolingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 45 minutes, plus coolingM", "serves": "10"}, "ingredients": [{"item": "160g unsalted butter, softened, plus extra for greasing"}, {"item": "275g forced rhubarb"}, {"item": "190g golden caster sugar"}, {"item": "5 green cardamom pods"}, {"item": "3 eggs"}, {"item": "1½ tsp vanilla extract"}, {"item": "3 tbsp custard powder"}, {"item": "200g self-raising flour"}, {"item": "45g soured cream"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Lightly butter a 900g loaf tin and line the base and sides with baking parchment. Cut some of the rhubarb stalks into lengths to snugly fit the width of the loaf tin. Cut the remaining rhubarb into 2cm pieces. Toss all the rhubarb with 30g sugar in a bowl and set aside. Lightly crush the cardamom pods then tip out the black seeds (discarding the husks) and grind to a rough powder in a pestle and mortar (or the base of a sturdy jar on a board)."}, {"step": "Beat the butter and remaining 160g sugar together with electric beaters, until light and mousse-like. Add the eggs, one by one, beating between each addition. Beat in the ground cardamom, vanilla extract, a pinch of fine sea salt and the custard powder. Fold in the flour then the soured cream and the 2cm rhubarb pieces (reserving the longer lengths), along with any rhubarb juices."}, {"step": "Spoon into the prepared tin and smooth the top. Tightly pack the reserved rhubarb lengths horizontally over the surface. Bake for 1 hour-1 hour 10 minutes, or until a skewer inserted into the centre comes out clean. Cover with foil after 50 minutes, if it’s browning too much. Cool in the tin for 10 minutes then carefully lift out on to a wire rack (keeping upright), to cool completely."}], "nutrition": {"Energy": "1,354kJ 323kcals", "Fat": "16g", "Saturated Fat": "9.4g", "Carbohydrate": "39g", "Sugars": "20g", "Protein": "4.6g", "Salt": "0.3g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Rhubarb-&-custard-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}