{"title": "Rhubarb and ginger Victoria sandwich", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes, plus coolingM", "cook_time": "PT45M", "total_time": null, "serves": "8"}, "ingredients": [{"item": "175g slightly salted butter, softened"}, {"item": "175g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "3 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "175g self-raising flour"}, {"item": "½ tsp baking powder"}, {"item": "400g pack Cooks' Ingredients Forced Rhubarb, trimmed and cut into 2cm lengths"}, {"item": "4 tbsp caster sugar, plus extra for dusting"}, {"item": "250g pack essential Waitrose Creamy Soft Cheese"}, {"item": "3 tbsp Waitrose Rhubarb & Ginger Preserve"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and base line 2 x 18cm sandwich tins. Put the butter, sugar, vanilla, eggs, flour and baking powder in a bowl and beat with an electric whisk until smooth and creamy. Divide the mixture between the tins and level the surface. Bake for 25 minutes or until risen and just firm to the touch. Transfer to a wire rack to cool. Increase the oven temperature to 200ºC, gas mark 6. To make the filling, line a baking tray with baking parchment and scatter with the rhubarb in a single layer. Sprinkle with 2 tbsp of the sugar and bake for 20 minutes, or until tender. Leave to cool. Whisk the cream cheese in a bowl with the remaining sugar until thickened. In a separate bowl, blend the rhubarb preserve with 2 tsp boiling water. Spread the cream cheese over one of the cakes, arrange the cooled rhubarb on top and drizzle with the preserve. Place the second cake on top and lightly dust with caster sugar to serve."}], "nutrition": {"Energy": "2,104kj 503kcals", "Fat": "28.6g", "Saturated Fat": "17.3g", "Carbohydrate": "54.5g", "Sugars": "38.2g", "Protein": "7g", "Salt": "0.7g", "Fibre": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/RhubarbVictoriaSandwich2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}