{"title": "Rhubarb and ginger cheesecake", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT60 minutes, plus chillingM", "total_time": "PT80M", "serves": "10"}, "ingredients": [{"item": "150g gingernut biscuits"}, {"item": "75g unsalted butter, melted and cooled"}, {"item": "500g curd cheese"}, {"item": "200g cream cheese"}, {"item": "150g caster sugar"}, {"item": "2 eggs, lightly beaten"}, {"item": "1 x ½ tsp vanilla extract"}, {"item": "1 x ½ lemon, zest and juice"}, {"item": "170g soured cream"}, {"item": "75g granulated sugar"}, {"item": "400g rhubarb, cut into 3cm lengths"}, {"item": "1 piece stem ginger in syrup, finely chopped, plus 2 tbsp syrup."}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2 and line the base of a 20cm spring-form cake tin with baking parchment. Place the ginger biscuits in a freezer bag, seal and bash with a rolling pin until crushed. Tip into a bowl and mix with the butter. Press into the base of the tin; set aside to chill."}, {"step": "Beat together the curd and cream cheeses, caster sugar, eggs, vanilla and lemon juice until smooth and creamy. Tip into the cake tin and bake for 1 hour until the cheesecake just wobbles in the centre."}, {"step": "Turn off the oven and leave the door ajar, allowing the cheesecake to cool in the oven for 30 minutes. Remove from the oven and spread the soured cream over the top. Once cooled completely, chill for at least 4 hours or, ideally, overnight."}, {"step": "To make the rhubarb topping, put the granulated sugar in a pan with 2 tbsp water. Place over a low heat and allow the sugar to dissolve (stirring occasionally and gently). Add the rhubarb, lemon zest, stem ginger and syrup, bring to the boil, then simmer, covered for 3 minutes. Turn off the heat, uncover and leave to cool completely. Strain through a sieve set over a pan; reserve the rhubarb. Simmer the juice until reduced by half, then pour over the rhubarb and chill until ready to serve."}, {"step": "Serve slices of the cheesecake with the rhubarb and syrup on the side."}], "nutrition": {"Energy": "1824.224kJ 436kcals", "Fat": "27.9g", "Saturated Fat": "16.8g", "Carbohydrate": "40.2g", "Sugars": "31.9g", "Salt": "0.47g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/2012wkwe-Mar-r18.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}