{"title": "Rib eye steak with tarragon, parsley & garlic butter", "tags": null, "planning": {"prep_time": "PT10 minutes + chillingM", "cook_time": "PT5 minutes + 10 minutes restingM", "total_time": "PT25 minutes + chillingM", "serves": "2"}, "ingredients": [{"item": "1 clove garlic"}, {"item": "25g pack fresh flat leaf parsley"}, {"item": "20g pack fresh tarragon"}, {"item": "125g unsalted butter"}, {"item": "2 rib eye steaks, bone in, from the meat counter"}, {"item": "½ tbsp olive oil"}], "instructions": [{"step": "Prepare the herb butter first. Put the garlic clove, parsley and tarragon leaves (remove the stalks) in a mini chopper or food processor and blitz for 10 seconds to finely chop. Cut the butter into small cubes, add half into the mini chopper and blitz for a further 10 seconds. Use a spatula to scrape the mixture away from the sides, then add the rest of the butter and blitz until all the ingredients are incorporated into a smooth butter."}, {"step": "Scrape the herb butter out of the mini chopper onto a large sheet of parchment paper. Carefully roll the butter using the surrounding paper to create a sausage shape. Twist at each end and put in the fridge to chill."}, {"step": "For the steak, heat a dry cast iron or stainless steel frying pan on a high heat for 10 minutes. Smear each steak with oil on each side and season with salt and pepper. When the pan is very hot add ½ tbsp of oil and quickly add the steaks. Fry for 2 minutes on each side for medium-rare. It’s best not move the steaks in the pan as soon as you put them in otherwise they will stick. Let them form a crust and then you’ll be able to turn them over when they are brown."}, {"step": "Once the steak is cooked to your liking, remove from the pan onto a warm plate and cover with foil and a couple of tea towels to keep warm. Leave to rest for 10 minutes. Serve with a slice of the herb butter on top, which will melt as you plate up, and chips. The remaining butter will keep in the fridge for up to a week or can be stored in the freezer."}], "nutrition": {"Energy": "2,577kJ 621kcals", "Fat": "49.8g", "Saturated Fat": "22.4g", "Carbohydrate": "0.3g", "Sugars": "0.1g", "Protein": "42.9g", "Salt": "0.3g", "Fibre": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/WRWK-21042016-rib-eye-steak-with-tarragon,-parsley-and-garlic-butter.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}