{"title": "Richard Bertinet's Cardamom & prune bread", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2 loaves"}, "ingredients": [{"item": "1 tsp Dove’s Farm Quick Yeast"}, {"item": "750g essential Waitrose Strong Wholemeal Bread Flour"}, {"item": "250g essential Waitrose Strong White Bread Flour"}, {"item": "1tsp salt"}, {"item": "700g water (or 700ml – you can use a measuring jug but weighing is more accurate)"}, {"item": "200g stoned prunes"}, {"item": "3-4 tbsp rum"}, {"item": "6-7 fresh cardamom pods, seeds ground"}], "instructions": [{"step": "Soak the prunes in the rum for at least 1 hour, or overnight if possible. Add the cardamom seeds and mix lightly together."}, {"step": "Preheat the oven to 220°C, or as high as your oven will go, with a baking stone or upside-down baking tray ready in the oven."}, {"step": "Mix the yeast into the flour well. Add the salt and water.  Work the dough with a plastic scraper or spatula of some kind for 2–3 minutes, until the dough starts to form."}, {"step": "Lift the dough onto your work surface. Even though the dough will feel quite soft and moist (and look like thick, sticky porridge) do not add any flour or oil to the work surface. Scrape the dough into as small a ball as possible."}, {"step": "Begin to work the dough. The idea is to stretch it and get as much air into it as possible. Forget the way you have probably been taught to knead the dough, by pummelling it with the heel of your hands and rotating it. The way to work it is to slide your fingers underneath it like a pair of forks, with your thumbs on top, swing it upwards then slap it back down, away from you, onto your work surface."}, {"step": "Stretch the back of the dough towards you, then lift it back over itself in an arc (to trap the air), still stretching it forward and sideways and tucking it in around the edges.  Do this 5 times then scrape the dough back into as small a ball as possible and repeat as necessary. Remember to use the tips of your fingers, not your whole hands."}, {"step": "As you work the dough it will start to come together and feel alive and elastic in your hands. Keep on working it until it comes cleanly away from the work surface, begins to look silky and feels smooth, firm-but-wobbly and responsive."}, {"step": "Lightly flour the work surface with wholemeal flour, place the dough on the flour and form the dough into a ball by folding each edge in turn into the centre. The dough will be sticky from the prunes and they may be escaping at the sides, this is all fine. Place the dough into a mixing bowl and cover with a tea towel. Rest for 1 hour in a draught-free place in your kitchen."}, {"step": "Turn out the dough onto a lightly floured work surface and divide in half. Mould each half into a loaf. Place on a lightly floured linen baking cloth on a shallow-edged or upturned baking tray. Cover with a tea towel and leave to prove for 1 hour until they have nearly doubled in volume. Flour the top of the loaves and then, with a razor blade or sharp knife, make four diagonal cuts (to a depth of 5mm) fanning out on either side of the loaf."}, {"step": "Open the preheated oven and mist with a water spray. Slide the loaves onto the baking stone or tray, quickly close the door and bake for 25–30 minutes. Once baked, the loaves should sound hollow when tapped on the base. Remove from the oven and cool on a wire rack."}, {"step": "This recipe is adapted from Dough by Richard Bertinet, photographs by Jean Cazals (Kyle Books, 2005)."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/wholemeal_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}