{"title": "Rich beef and porcini stew with sage and chestnut dumplings", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT3 hours 15 minutesM", "total_time": "PT210M", "serves": "6"}, "ingredients": [{"item": "6 pieces (about 1.8kg) Waitrose Aberdeen Angus Beef Bone-In Shin (from the meat counter), well chilled"}, {"item": "50g plain flour"}, {"item": "2 x 30g packs dried Cooks' Ingredients Porcini Mushrooms"}, {"item": "3 tbsp olive oil"}, {"item": "400g pack shallots, peeled"}, {"item": "6 whole cloves garlic, peeled"}, {"item": "6 sprigs fresh rosemary"}, {"item": "2 tbsp tomato purée"}, {"item": "150ml red wine"}, {"item": "500g pack Heston from Waitrose Chilled Beef Stock"}, {"item": "4 tbsp balsamic vinegar"}, {"item": "For the dumplings"}, {"item": "200g self raising flour"}, {"item": "100g suet"}, {"item": "100g whole chestnuts"}, {"item": "1 tsp Bart Dried Sage"}], "instructions": [{"step": "Place the beef, in batches, onto a large plate with the flour and seasoning. Turn to coat the meat. Meanwhile, place the mushrooms into a bowl and cover with 500ml of boiling water, mix and leave to soak."}, {"step": "Warm half of the oil over a mediumhigh heat in a large, shallow casserole dish or pan. Add the meat, in batches, cooking for 2 minutes on each side, or until well browned. Remove each batch of meat to a plate before starting on the next one."}, {"step": "Add the remaining oil to the pan and reduce the heat to medium. Add the shallots and garlic and cook for 5 minutes or until golden. Then add the mushrooms and their soaking liquid, followed by all the remaining stew ingredients. Stir well then return the beef and any juices to the pan together with any remaining flour from dusting."}, {"step": "Bring to the boil then reduce the heat to low, cover with a tight fitting lid and leave to simmer very gently, for 2½ hours or until the meat is tender. Remove the rosemary stalks and the 6 beef bones, leaving any of the marrow behind, then season to taste."}, {"step": "Towards the end of the cooking time prepare the dumplings. Place the flour and suet into a large bowl and rub the suet in with your finger tips. Crumble in the chestnuts then add the sage and a generous amount of seasoning. Mix well before slowly adding just enough cold water to bring the mixture together into a light dough (about 150-200ml). With floured hands, roll the mixture into 12 balls. Drop these onto the surface of the stew and push down gently until about half submerged. Cover and leave to simmer for 20–25 minutes until light and risen. Serve immediately with plenty of mash and seasonal greens."}], "nutrition": {"Energy": "2640.104kJ 631kcals", "Fat": "28.9g", "Saturated Fat": "11.2g", "Carbohydrate": "48.8g", "Sugars": "7.2g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/2013wked-October-r1porcinidumps.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}