{"title": "Richard Bertinet's White bread masterclass", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2 tin loaves or 6 fougasse"}, "ingredients": [{"item": "1 tsp Dove’s Farm Quick Yeast"}, {"item": "1kg essential Waitrose Strong White Bread Flour"}, {"item": "20g fine sea salt"}, {"item": "730g water (or 730ml – you can use a measuring jug but weighing is more accurate)"}], "instructions": [{"step": "Preheat the oven to 250°C, or as high as your oven will go, with a baking stone or upside-down baking tray ready in the oven."}, {"step": "Mix the yeast into the flour well. Add the salt and water.  Work the dough with a plastic scraper or spatula of some kind for 2–3 minutes, until the dough starts to form."}, {"step": "Lift the dough onto your work surface. Even though the dough will feel quite soft and moist (and look like thick, sticky porridge) do not add any flour or oil to the work surface. Scrape the dough into as small a ball as possible."}, {"step": "Begin to work the dough. The idea is to stretch it and get as much air into it as possible. Forget the way you have probably been taught to knead the dough, by pummelling it with the heel of your hands and rotating it. The way to work it is to slide your fingers underneath it like a pair of forks, with your thumbs on top, swing it upwards then slap it back down, away from you, onto your work surface."}, {"step": "Stretch the back of the dough towards you, then lift it back over itself in an arc (to trap the air), still stretching it forward and sideways and tucking it in around the edges.  Do this 5 times then scrape the dough back into as small a ball as possible and repeat as necessary.  Remember to use the tips of your fingers, not your whole hands."}, {"step": "As you work the dough it will start to come together and feel alive and elastic in your hands. Keep on working it until it comes cleanly away from the work surface, begins to look silky and feels smooth, firm-but-wobbly and responsive."}, {"step": "Lightly flour the work surface, place the smooth side of the dough on the flour and form the dough into a ball by folding each edge in turn into the centre. Place the dough into a mixing bowl and cover with a tea towel. Rest for at least 1 hour in a draught-free place in your kitchen."}, {"step": "Turn out the dough onto a floured surface and divide into 2 equal pieces. Mould each very tightly into a loaf shape. To do this, first flatten the ball of dough a little with the heel of your hand. Fold one edge into the centre and press down with the heel of your hand. Fold the other edge over into the centre and press down again. Fold over in half and then press down again firmly to seal the edges."}, {"step": "Turn over and place (seam side down) in a greased loaf tin. Leave to prove in a warm draught-free place for 1 hour or until doubled in size."}, {"step": "Place your tins on the baking stone or upturned baking tray in your oven, mist the inside with water spray and bake for 5 minutes. Turn down the heat to 220°C (if your oven only reaches 220°C don’t turn it down). Bake the loaves for 20 to 25 minutes. Remove the loaves from the tins and cool. For a perfect crust take the loaves out of their tins and put the loaves back into the oven for 4 to 5 minutes with the door slightly ajar to let the steam escape."}, {"step": "Flour your work surface well and turn out the dough. Be careful not to deflate the dough when handling it but let it spread out to cover a square of your work surface. Generously flour the top of the dough."}, {"step": "Cut the dough in half, and then cut each piece again into three roughly triangular pieces. Handle the dough gently and keep it well floured."}, {"step": "Take one of the pieces of dough and make a large diagonal cut across the centre, making sure you don’t go right to the edges of the dough, but cut all the way through the dough to your work surface. Then make three to four smaller diagonal cuts fanning out on each side of the central one. Put your fingers into the slits and gently open them out to form holes."}, {"step": "Lift onto a lightly floured flat-edged baking tray and from here slide onto the hot upturned tray in the preheated oven. Do this as quickly as possible, to avoid letting heat out of the oven. Turn the heat down to 230°C (if your oven only reaches 230°C don’t turn it down) and bake for 10–12 minutes, until golden brown."}, {"step": "This recipe is adapted from Dough by Richard Bertinet, photographs by Jean Cazals (Kyle Books, 2005)."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/white_dough_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}