{"title": "Ricotta pancakes with blackberry butter", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT35 minutes, plus 30 minutes chillingM", "cook_time": "PT8M", "total_time": "PT73M", "serves": "4"}, "ingredients": [{"item": "150g blackberries"}, {"item": "2 tbsp lemon juice"}, {"item": "75g unsalted butter, softened"}, {"item": "3 tbsp golden caster sugar"}, {"item": "250g ricotta"}, {"item": "125ml whole milk"}, {"item": "3 large eggs, separated"}, {"item": "100g plain flour"}, {"item": "3 tbsp caster sugar"}, {"item": "1 tsp baking powder"}, {"item": "25g butter"}, {"item": "Maple syrup, to serve"}], "instructions": [{"step": "First make the blackberry butter. Gently heat the berries, lemon juice and sugar in a small pan for 6-7 minutes until the blackberries soften and look slightly jammy. Allow to stand for 15 minutes; it will set as it cools. Whip the butter in a bowl with electric beaters until light and fluffy. Once the blackberry compote is cool, beat it into the butter so that it forms purple ripples. Refrigerate for 30 minutes. Preheat the oven to 170°C, gas mark 3. To make the pancakes, place the ricotta, milk and egg yolks in a mixing bowl and beat to combine. Add the flour, sugar, baking powder and a pinch of salt and fold in to make a smooth batter. In another bowl, beat the egg whites until they're softly peaking, then fold into the mixture. Heat the butter in a heavy-based frying pan over a medium heat and cook 3 x 7cm pancakes at a time for 1-2 minutes each side until golden and cooked through. As you make them, keep the pancakes warm on a baking tray in the oven. Serve with blackberry butter melting over the top; leave the maple syrup to your diners' discretion."}], "nutrition": {"Energy": "2451.824kJ 586.0kcal", "Fat": "34.6g", "Saturated Fat": "20.1g", "Sugars": "36.6g", "Salt": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/0610054-r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}