{"title": "Ricotta pancakes with sticky maple apples", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT20M", "total_time": "PT40M", "serves": "16"}, "ingredients": [{"item": "150g self-raising flour"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "75g soft brown sugar"}, {"item": "1 lemon, zest and juice"}, {"item": "250g ricotta"}, {"item": "200ml milk"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "75g butter"}, {"item": "3 crisp best of British eating apples,peeled, cored and each cut into 8 wedges"}, {"item": "200ml maple syrup"}], "instructions": [{"step": "To make the pancakes place the flour, bicarbonate of soda, sugar and lemon zest into a large mixing bowl and stir to combine."}, {"step": "Whisk the ricotta, milk and egg until smooth. Melt 25g of the butter and add that to the ricotta mixture and whisk again. Pour into the flour and whisk well to form a smooth, thick batter."}, {"step": "Heat a large frying pan, non-stick if you have one, over a medium heat. Add a little of the remaining butter, and once it has melted and is sizzling start to cook the pancakes. Spoon in 1 to 2 tbsps of the batter and cook for 3-4 minutes until the surface starts to pock with burst bubbles. Turn the pancakes over carefully and cook for another 2-3 minutes."}, {"step": "Place the cooked pancakes on to a plate, cover and keep warm while you cook the rest."}, {"step": "Once the pancakes are cooked, heat any leftover butter in the same pan, using a little more if required and add the apple wedges. Sauté for 4-5 minutes until golden. Squeeze in the lemon juice and pour in the maple syrup. Bubble for 2-3 minutes."}, {"step": "Serve 2 or 3 pancakes with a large spoonful of apples and drizzle with plenty of the warm maple syrup."}], "nutrition": {"Energy": "1,374kJ 327kcals", "Fat": "13g", "Saturated Fat": "7.9g", "Carbohydrate": "46.1g", "Sugars": "31.8g", "Protein": "6.4g", "Salt": "0.9g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/RicottaPancakesMapleSryup_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}