{"title": "Roast pork fillet with watercress salsa verde", "tags": null, "planning": {"prep_time": "PT20 minutesM", "cook_time": "PT50 minutesM", "total_time": "PT1 hour 10 minutesM", "serves": "4"}, "ingredients": [{"item": "500g baby new potatoes"}, {"item": "100g Cooks’ Ingredients Slow Roasted Tomatoes, plus oil from the jar"}, {"item": "500g Waitrose 1 Free Range Pork Fillet, trimmed of sinew"}, {"item": "2 cloves garlic, one crushed, one roughly chopped"}, {"item": "1 tsp chopped rosemary, plus a few small sprigs"}, {"item": "80g pack 6 slices prosciutto crudo, halved"}, {"item": "400g pack asparagus, trimmed"}, {"item": "80g pack John Hurd’s Organic Watercress, large stems removed"}, {"item": "2 tbsp nonpareille capers in brine, drained"}, {"item": "2 anchovies in oil, drained (optional)"}, {"item": "200g Waitrose 1 Baby Courgettes (or small courgettes), halved lengthways"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5. Toss the potatoes, 1 tsp oil from the tomatoes and some ground black pepper in a medium roasting tin and roast for 10 minutes."}, {"step": "Cut the pork into two equal lengths, then horizontally almost all the way through, opening each piece like a book. Spread with crushed garlic, chopped rosemary and 50g tomatoes. Reshape then secure with cocktail sticks or cook’s string. Season."}, {"step": "Heat 1 tsp oil in a nonstick frying pan and brown the meat for 3-5 minutes until golden. Sit the pork among the potatoes, then roast for 25 minutes until the juices run clear."}, {"step": "Meanwhile, wrap the ham around most of the asparagus spears. Make the salsa verde in a processor by pulsing together the chopped garlic, watercress, capers, anchovies and 5 tbsp tomato oil until it is spoonable."}, {"step": "Rest the pork on a plate, covered with foil to keep warm. Turn the oven to 200°C, gas mark 6. Toss the courgettes in with the potatoes, remaining tomatoes and rosemary sprigs, top with all of the asparagus and roast for 15 minutes until just tender.  Slice the pork thickly, return it to the pan and pour the resting juices over the meat. Bring to the table with the salsa verde and serve."}], "nutrition": {"Energy": "2,376kJ 569kcals", "Fat": "33g", "Saturated Fat": "6.5g", "Carbohydrate": "25g", "Sugars": "7.1", "Protein": "41g", "Salt": "1.8", "Fibre": "6.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Roastporkfillet.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}