{"title": "Roast squash, rosemary and butter bean soup", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT35M", "total_time": "PT1 hour 5 minutesM", "serves": "8"}, "ingredients": [{"item": "1 Coquina squash, pumpkin or butternut, or a mix of all (about 1kg), peeled and cut into 2cm chunks, seeds rinsed and dried"}, {"item": "6 tbsp olive oil"}, {"item": "1 tbsp sherry vinegar"}, {"item": "½ tsp cayenne pepper"}, {"item": "8 cloves garlic, unpeeled"}, {"item": "2 leeks"}, {"item": "2 celery stalks, roughly chopped"}, {"item": "1 red chilli, sliced"}, {"item": "400g can butter beans, rinsed and drained"}, {"item": "3 rosemary sprigs"}, {"item": "1 litre fresh chicken stock"}, {"item": "½ tbsp maple syrup"}, {"item": "3 tbsp crème fraîche"}, {"item": "1 tbsp lemon juice"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Toss the squash with 2 tbsp oil and the vinegar, cayenne pepper and garlic. Spread over a foil-lined tray and roast for 25 minutes, turning halfway through."}, {"step": "Meanwhile, heat another 1 tbsp oil in a saucepan. Roughly chop all but a 5cm piece of leek (set this aside for the garnish) and sweat with the celery over a gentle heat for 15 minutes, until softened. Add the chilli, butter beans and rosemary sprigs. Sweat for a couple more minutes, then tip in the roasted squash and squeeze in the flesh from the garlic cloves. Add the stock and 500ml water, bring to the boil and simmer for 10 minutes."}, {"step": "For the garnish, toss the seeds with ½ tbsp oil and the maple syrup. Season and roast for 10 minutes, turning halfway through; set aside. Heat the remaining oil in a frying pan. Halve the reserved leek and shred finely lengthways. Fry over a medium heat, tossing until golden, then drain on kitchen paper."}, {"step": "Remove and discard the rosemary sprig from the soup, then blitz with the crème fraîche and lemon juice; season. Serve warm, topped with the crispy leeks, roasted seeds, and a swirl of more crème fraîche if liked."}], "nutrition": {"Energy": "1,260kJ 302kcals", "Fat": "18.9g", "Saturated Fat": "5.8g", "Carbohydrate": "19.3g", "Sugars": "9.3g", "Protein": "13.7g", "Salt": "0.2g", "Fibre": "5.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/Inspiration/Autumn/Waitrose_Soup-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}