{"title": "Roast beef with red onions & beetroot recipe", "tags": [{"tag": "Christmas"}], "planning": {"prep_time": "PT25M", "cook_time": "PT1 hour 45 minutes to 2 hoursM", "total_time": "PTup to 2 hours 25 minutes M", "serves": "8"}, "ingredients": [{"item": "2.5kg piece Aberdeen Angus roasting beef (topside or top rump)"}, {"item": "25g butter"}, {"item": "1 tbsp wholegrain mustard"}, {"item": "1 tbsp plain flour"}, {"item": "750g beetroots, trimmed and scrubbed"}, {"item": "3 red onions, peeled"}, {"item": "1 tbsp olive oil"}, {"item": "150ml pot essential Waitrose Soured Cream"}, {"item": "100g plain flour"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "250ml milk"}, {"item": "8 tsp vegetable oil"}], "instructions": [{"step": "Preheat the oven to 230°C, gas mark 8. Using a piece of kitchen paper pat the meat dry and then place in a large roasting tin. Meanwhile, mix together the butter with the mustard and season, then spread over the meat. Sprinkle the flour evenly over."}, {"step": "Cut any of the larger beetroots into halves or quarters, then cut the onions into quarters through the root. Toss the vegetables in the oil and season."}, {"step": "Roast the beef for 20 minutes, then reduce the oven temperature to 180°C, gas mark 4. Add the beetroot and onion and return to the oven. Roast for a further 25-30 minutes per kg for medium beef, depending on the thickness of the joint."}, {"step": "Meanwhile, make the Yorkshire puddings. Sieve the flour and a pinch of salt into a bowl. Make a well in the centre, pour in the egg and milk and stir to form a thick, smooth batter then cover and chill in the fridge for 30 minutes. About 5 minutes before the end of the beef’s cooking time, pour 1 tsp each of oil into eight holes of a 12-hole muffin tin and place in the oven for 5 minutes."}, {"step": "Remove the meat and vegetables to a warm serving platter and cover tightly with foil. Set the pan aside."}, {"step": "Increase the oven temperature to 220°C, gas mark 7. Check to see if the oil is hot enough – it should sizzle as the batter is poured in. Pour the batter equally between the 8 holes and bake the puddings for 20 minutes or until golden and well risen."}, {"step": "Reheat the pan juices on the hob over a moderate heat. Pour in 200ml boiling water and stir into the pan juices, scraping any pieces from the bottom of the pan. Reduce the heat and gently stir in the soured cream. Taste and add more seasoning if necessary."}, {"step": "Serve the beef with the roasted vegetables, Yorkshire puddings and a little of the sauce spooned over."}], "nutrition": {"Energy": "2,421kJ 579kcals", "Fat": "31.2g", "Saturated Fat": "12g", "Carbohydrate": "25.3g", "Sugars": "12.1g", "Protein": "49.2g", "Salt": "0.7g", "Fibre": "3.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/WRWK051115-Xmas-roast-beef-red-onions-beetroot.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}