{"title": "Roast pork with celeriac purée and garlicky mushrooms", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT80M", "total_time": "PT110M", "serves": "4"}, "ingredients": [{"item": "1.2kg essential Waitrose British pork leg joint"}, {"item": "1 tsp sea salt"}, {"item": "5 sage leaves, chopped"}, {"item": "1 essential Waitrose lemon, zest"}, {"item": "1 tbsp essential Waitrose olive oil"}, {"item": "2 garlic cloves, crushed"}, {"item": "500g essential Waitrose mushrooms, sliced"}, {"item": "½ x 20g pack flat leaf parsley, chopped"}, {"item": "For the celeriac puree"}, {"item": "15g essential Waitrose unsalted butter"}, {"item": "2 essential Waitrose onions, sliced"}, {"item": "2 garlic cloves, peeled"}, {"item": "1 celeriac (about 900g), peeled and chopped into 3cm cubes"}, {"item": "300ml essential Waitrose whole milk"}, {"item": "grating of fresh nutmeg"}, {"item": "1 tbsp essential Waitrose half fat crème fraîche"}], "instructions": [{"step": "Preheat the oven to its highest setting. Place the pork in a roasting dish. Dry it with kitchen paper, go over the scored lines of the skin with a sharp knife, then rub the salt into the scores. Mix the sage and lemon zest with half the oil; rub into the flesh. Roast for 25 minutes, then turn down the oven to 180°C, gas mark 4 and roast for 55 minutes (or 25 minutes per 500g). Remove from the oven and rest for 10-15 minutes."}, {"step": "Meanwhile, make the purée. Heat the butter in a saucepan, then, when foaming, add the onions and garlic; cover and soften for 5 minutes. Add the celeriac and cook, covered, for another 5 minutes, then add the milk, cover and simmer gently for 20 minutes until the celeriac is soft. Transfer to a blender or food processor, season and blitz until smooth. Return to the pan and stir in the nutmeg and crème fraîche. Reheat gently before serving."}, {"step": "Heat the remaining oil in a large frying pan over a medium-high heat. Add the crushed garlic and sliced mushrooms, and cook for 3-4 minutes, stirring regularly. Season and toss with the parsley."}, {"step": "Slice the meat and serve with the celeriac purée and mushrooms, plus any juices from the roasting pan."}], "nutrition": {"Energy": "2041.792kJ 488kcals", "Fat": "19.1g", "Saturated Fat": "7.6g", "Carbohydrate": "9.92g", "Sugars": "7g", "Salt": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/2011wkwe-Oct-r13.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}