{"title": "Roasted carrot, beetroot and lentil salad with date and caper dressing", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT35M", "total_time": "PT55M", "serves": "4"}, "ingredients": [{"item": "225g uncooked puy lentils (or 2 x 250g packs ready-cooked puy lentils)"}, {"item": "350g baby topped carrots, peeled, trimmed and halved"}, {"item": "4 tbsp olive oil"}, {"item": "1 tsp coriander seeds, crushed"}, {"item": "1 tsp ground cumin"}, {"item": "50g pumpkin seeds"}, {"item": "3 echalion shallots, sliced lengthways"}, {"item": "3 tbsp nonpareille capers, rinsed and patted dry"}, {"item": "3 pitted medjool dates, roughly chopped"}, {"item": "3 tbsp sherry vinegar"}, {"item": "330g pouch cooked beetroot, cut into wedges"}, {"item": "½ x 25g pack flat leaf parsley, leaves roughly chopped"}, {"item": "80g pack spinach, shredded"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Put the lentils in a large pan and cover with 1 litre cold water. Bring to the boil, then lower the heat and simmer for 20 minutes until tender. Meanwhile, toss the carrots in 1 tbsp oil and the spices. Season and spread over the base of a parchment-lined roasting tin. Roast for 15 minutes, then stir in the pumpkin seeds and roast for another 5 minutes; set aside. While they're cooking, prepare the remaining salad ingredients."}, {"step": "Drain the lentils and set aside, then rinse out the pan and return to a medium-high heat with the remaining 3 tbsp oil. Fry the shallots for 5 minutes until soft and turning golden, then add the capers and dates and fry for a minute more."}, {"step": "Remove the pan from the heat and stir through the parsley and spinach. Divide between plates, topping with the carrots and pumpkin seeds."}], "nutrition": {"Energy": "2,077kJ 496kcals", "Fat": "20g", "Saturated Fat": "3g", "Carbohydrate": "50g", "Sugars": "23g", "Protein": "20g", "Salt": "1.3g", "Fibre": "16g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Roast_carrot_beetroot_lentil_salad_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}