{"title": "Roasted carrots, crispy kale & broad bean ‘houmous’", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT35M", "total_time": "PT50M", "serves": "2"}, "ingredients": [{"item": "300g Trio Of Chantenay Carrots"}, {"item": "1½ tbsp wok oil"}, {"item": "Finely grated zest and juice of 1 unwaxed lime"}, {"item": "2½ tbsp sweet chilli sauce"}, {"item": "½ tsp cumin seeds"}, {"item": "200g frozen essential Baby Broad Beans"}, {"item": "1 large clove garlic, chopped"}, {"item": "5g fresh mint, stalks removed"}, {"item": "2 shallots, quartered"}, {"item": "75g Pentland Brig Kale"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Blanch the carrots in boiling water for 2 minutes. Drain and tip into a roasting tin. Drizzle with ½ tbsp of the oil and shake the tin to coat the carrots. Season with black pepper and roast for 25 minutes."}, {"step": "Combine the lime zest and juice with the chilli sauce, and reserve. Heat a small saucepan, add the cumin seeds and toast until they start to darken. Tip into a food processor. Add the broad beans to the pan, cover with boiling water and cook for 2 minutes. Drain and place into the food processor. Add the garlic, mint, shallots, another ½ tbsp of oil and a pinch of salt, and blend briefly until the mixture is finely chopped, but not puréed."}, {"step": "Tear the kale into small pieces, discarding the stalks and put in a bowl. Drizzle with the remaining oil and turn the kale to coat. Scatter over the carrots and roast for a further 5-7 minutes, or until the edges of the kale have started to colour. Tip the broad bean mixture into a bowl and microwave on high for 2 minutes. Transfer to plates and serve topped with the carrots and kale, and drizzled with the chilli and lime sauce."}], "nutrition": {"Energy": "1,159kJ 277kcals", "Fat": "11g", "Saturated Fat": "1.3g", "Carbohydrate": "32g", "Sugars": "25g", "Protein": "8.5g", "Salt": "0.4g", "Fibre": "6.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Waitrose-Weekend_Wk486_Healthy-Everyday_Roasted-Carrots-Crispy-kale-Broad-Bean-Houmous.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}