{"title": "Roasted rhubarb & mango with griddle-pan waffle", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "6"}, "ingredients": [{"item": "2 x 400g packs Cooks' Ingredients Rhubarb, cut into 6cm lengths"}, {"item": "1 large mango, peeled, stoned and cut into 2cm fingers"}, {"item": "2 pieces Cooks' Homebaking Stem Ginger in Syrup, finely chopped, plus 2 tsp syrup from the jar"}, {"item": "3 tbsp clear honey"}, {"item": "Greek-style natural yogurt, to serve"}, {"item": "For the waffle"}, {"item": "225g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "1 tbsp icing sugar, plus extra for dusting"}, {"item": "2 medium Waitrose British Blacktail Free Range Eggs"}, {"item": "300ml semi-skimmed milk"}, {"item": "1 tsp vanilla extract"}, {"item": "50g essential Waitrose Salted Dairy Butter, melted"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 2. Place the rhubarb and mango in a single layer in an ovenproof dish, scatter over the ginger, drizzle with the syrup and honey and gently mix. Cover loosely with foil, bake for 15 minutes, then uncover and cook for a further 15 minutes or until the rhubarb is tender. Leave to cool."}, {"step": "To make the waffle, sift the flour, baking powder and icing sugar into a large bowl and make a well in the centre. In a jug, beat together the eggs, milk, vanilla and all but a little of the butter. Lightly stir the milk mixture into the flour with a wooden spoon — don’t worry if there are a few small lumps."}, {"step": "Brush a 25cm square, ridged griddle pan with the reserved butter and pour in the waffle batter. Cook gently for 6–8 minutes, carefully turn over and cook for a further 2–3 minutes until dark golden and cooked through."}, {"step": "Slide onto a board, cut into 6 rectangles and dust lightly with icing sugar. Serve with the mango and rhubarb and a spoonful of yogurt. Keep any leftover fruit in an airtight container, chilled, for up to 3 days."}], "nutrition": {"Energy": "1,627kJ 387kcals", "Fat": "13.5g", "Saturated Fat": "7.4g", "Carbohydrate": "55.9g", "Sugars": "27.6g", "Protein": "10.4g", "Salt": "0.9g", "Fibre": "3.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Roasted-rhubarb-&-mango-with-griddle-pan-waffles.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}