{"title": "Roast wing rib of beef with horseradish relish", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "Serves 8 (with leftovers)"}, "ingredients": [{"item": "2.5-3kg dry-aged Aberdeen Angus beef wing rib"}, {"item": "½ x 20g pack fresh thyme"}, {"item": "3 tbsp hot horseradish sauce"}, {"item": "200ml tub crème fraîche"}, {"item": "½ x 285g jar pickled cornichons and onions (about 10 cornichons and 3 onions), chopped"}, {"item": "50g walnut pieces, chopped and toasted"}, {"item": "2 tsp Cooks’ Ingredients Green Peppercorns (optional), drained and chopped"}, {"item": "25g pack fresh parsley, chopped"}, {"item": "300ml full-bodied red wine"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Weigh the joint and calculate roasting time, allowing 12 minutes per 500g for rare, 18 minutes for medium and 25 minutes for well done.  Scatter half the thyme in a roasting tin and place the beef on top with the fat side uppermost. Scatter with plenty of salt and pepper and the rest of the thyme, pulled from the stalks. Rub the seasoning and thyme into the skin and roast for 15 minutes. Reduce the oven temperature to 180°C, gas mark 4 and roast for your calculated cooking time. For the relish, mix together the horseradish sauce and crème fraîche. Stir in the cornichons, onions, walnuts, peppercorns and parsley, then spoon into a serving dish. Cover and chill. Transfer the beef to a carving platter. Cover and leave to stand in a warm place for 30 minutes. Add the wine to the pan juices with a little seasoning. Bring to the boil, stirring, and cook until slightly reduced. Strain into a jug and serve with the beef and relish."}], "nutrition": {"Energy": "1,954kj 471kcal", "Fat": "37.5g", "Saturated Fat": "16.4g", "Carbohydrate": "2.6g", "Sugars": "2.0g", "Protein": "30.7g", "Salt": "0.6g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/Inspiration/Autumn/5140_Waitrose_Beef_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}