{"title": "Roast pork with perfect crackling and apple sauce", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT2 hours 30 minutes - 3 hoursM", "total_time": "PT2 hours 50 minutes  - 3 hours 20 minutes , plus restingM", "serves": "6-8"}, "ingredients": [{"item": "1.5-2kg joint of pork, either leg, loin or shoulder"}, {"item": "Olive oil, for rubbing"}, {"item": "Fine sea salt and freshly ground black pepper"}, {"item": "For the apple sauce"}, {"item": "500g Bramley cooking apples"}, {"item": "25g butter"}, {"item": "3 tbsp caster sugar"}, {"item": "For the gravy"}, {"item": "2 tsp plain flour"}, {"item": "450ml pork or vegetable stock"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Place the pork in a roasting tin, pat its skin with kitchen paper and leave for 30 minutes for the skin to dry. Check that the skin is evenly scored, adding more using a very sharp knife, if needed."}, {"step": "Lightly rub or brush the skin with oil and sprinkle with a thin, even layer of salt and a little pepper.  Rub the seasoning into the scored skin. Calculate the cooking time, 35 minutes per 500g, plus an extra 35 minutes. Roast for the calculated time."}, {"step": "Meanwhile, make the sauce. Peel and cut the apples into quarters, place in a pan with 3 tbsp cold water. Bring to the boil then reduce to medium, cover and cook for 6-8 minutes, until the apples are soft and pulpy."}, {"step": "Remove from the heat, beat with a wooden spoon until the apples are smooth, mix in the butter and sugar. Return the pan to the heat and cook gently, stirring until it thickens slightly, then spoon into a serving bowl."}, {"step": "Transfer the cooked pork onto a serving plate or board. Cover loosely with foil and leave to rest for 15 minutes, while the gravy is made. Spoon off as much surface fat from the pan juices as you can. Place the roasting tin on the hob and reheat the juices, remove from the heat and stir in the flour. Then cook gently for 2 minutes, before gradually adding the stock, stirring all the time until it thickens. Simmer for 5 minutes, then taste and season if necessary."}, {"step": "Using a sharp carving knife remove the crackling from the joint and place on a board and cut into pieces. Then thinly slice the pork and serve each portion with some crackling, gravy and a generous spoonful of apple sauce."}], "nutrition": {"Energy": "2,045kj/490kcals", "Fat": "24.9g", "Saturated Fat": "10.7g", "Carbohydrate": "14.7g", "Sugars": "13.5g", "Salt": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/roast_pork_apple_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}