{"title": "Roasted rack of pork with spiced apple and pear sauce", "tags": null, "planning": {"prep_time": "PT15 minutes, plus resting M", "cook_time": "PT1 hour 35 minutesM", "total_time": "PT1 hour 50 minutes, plus restingM", "serves": "4"}, "ingredients": [{"item": "1kg rack of pork"}, {"item": "fine sea salt, to season"}, {"item": "1 bramley apple (about 250g), peeled, cored and cut into 2cm chunks"}, {"item": "2 ripe pears (about 350g), peeled, cored and cut into 2cm chunks"}, {"item": "50g golden caster sugar"}, {"item": "20g fresh root ginger, finely grated"}, {"item": "2 star anise"}, {"item": "100ml dry cider"}, {"item": "30g unsalted butter"}], "instructions": [{"step": "Preheat the oven to 240˚C, gas mark 9. Go over the scores in the skin of the pork with a sharp knife, and create a few more if you like, then rub salt into the cuts to season. Put the pork on a rack in a roasting tin lined with baking parchment and pour 200ml water into the tin; roast for 20-30 minutes. (This helps the crackling start to crisp.) Once the skin has puffed up and begun to turn golden, reduce the heat to 160˚C, gas mark 2, and cook for 50 minutes-1 hour, or until cooked through with no pink meat remaining; a thermometer inserted into the thickest part of the joint should read 68-70˚C."}, {"step": "Meanwhile, make the sauce. Put the apple, pears, sugar, ginger, star anise and cider in a heavy-based pan. Cover, put over a medium heat and cook for 5-7 minutes or until the fruit softens and starts to break down. Uncover and simmer briskly for 6-8 minutes until the liquid is reduced and the fruit is very tender. Take off the heat, season and add the butter, roughly crushing the fruit with a fork. (Or blend into a smooth sauce, removing the star anise first.) Keep warm until ready to serve."}, {"step": "Remove the pork from the oven and leave to rest for 20 minutes, loosely covered with foil. If you’d like to make a gravy, skim any excess fat from the roasting tin with a spoon, then remove the baking parchment, scraping any sticky bits into the tin. Add 50-100ml water and simmer over a medium heat until it reaches the desired consistency; season. Carefully remove the string from the pork, trying to keep the crackling intact. Either carve straight through the crackling and the meat together or, with a sharp knife, remove the crackling in one piece and break it into pieces to be served alongside the meat. Serve with the sauce, the gravy (if made) and a good dollop of mustard, if liked."}], "nutrition": {"Energy": "2,489kJ 598kcals", "Fat": "39g", "Saturated Fat": "16g", "Carbohydrate": "30g", "Sugars": "28g", "Protein": "29g", "Salt": "1.5g", "Fibre": "3.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Roasted_rack_of_pork.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}