{"title": "Rock oysters with cocktail sauce and mignonette", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": null, "total_time": "PT15M", "serves": "2"}, "ingredients": [{"item": "6-8 oysters, chilled"}, {"item": "lemon wedges, to serve"}, {"item": "50ml red wine vinegar"}, {"item": "2 tbsp very finely chopped shallots"}, {"item": "½ tsp black peppercorns, coarsely ground"}, {"item": "50g ketchup"}, {"item": "1 tbsp freshly grated horseradish (or The English Provender hot grated horseradish)"}, {"item": "1 tsp Tabasco, plus more to taste, if liked"}, {"item": "1 tsp Worcestershire sauce, plus more to taste, if liked"}, {"item": "½ lemon, juice"}], "instructions": [{"step": "For each sauce, mix together all the ingredients and then place in ramekins or glasses. Cover and chill until needed (up to 24 hours ahead)."}, {"step": "To shuck the oysters, start by wrapping one in a clean tea towel and holding it firmly on a flat surface with the pointed end facing towards you. Insert an oyster knife (or other short, pointed knife) into the small gap between the two shell halves at the pointed end (called the hinge). Apply firm pressure and gently twist the knife to open the shell. Run the knife along the underside of the top part of the shell, staying as close as possible to the edge; discard the top part. Taking care not to spill any precious juices, run the knife under the oyster to release it completely. Place the bottom part of the shell on a tray lined with a tea towel, then repeat this step with the other oysters."}, {"step": "Serve the oysters immediately on individual plates, or a small platter covered with crushed ice, with the mignonette, cocktail sauce and lemon wedges alongside."}], "nutrition": {"Energy": "339kJ 80kcals", "Fat": "0.8g", "Saturated Fat": "0.2g", "Carbohydrate": "12.1g", "Sugars": "10.3g", "Protein": "6.1g", "Salt": "1.7g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Oysters-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}