{"title": "Rose-soaked pistachio and lemon cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT30M", "total_time": "PT50M", "serves": "10"}, "ingredients": [{"item": "125g pistachio"}, {"item": "4 large Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "100g golden caster sugar"}, {"item": "100g semolina"}, {"item": "75g butter, melted"}, {"item": "Grated zest of 1 lemon"}, {"item": "50g orange marmalade"}, {"item": "1 tbsp Cooks’ Ingredients Rose Petals"}, {"item": "For the syrup"}, {"item": "200g golden caster sugar"}, {"item": "1 tsp rose water"}, {"item": "Juice of 2 lemons"}, {"item": "1 vanilla pod, split"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line an 18cm square tin with baking parchment. Using a food processor or blender, blitz 100g of the pistachios until finely ground and finely chop the remaining 25g and set both aside."}, {"step": "Using an electric mixer, beat the egg yolks with the caster sugar until pale in colour and thick and creamy. While the machine is running, slowly add the ground pistachios and semolina followed by the melted butter, lemon zest and marmalade, and continue to beat until smooth."}, {"step": "In a separate clean bowl, whisk the egg whites until they form stiff peaks. Gently fold this into the nut mixture in three additions so as to keep as airy as possible. Pour the batter into the prepared tin and bake for 25–30 minutes until golden and a skewer inserted into the cake comes out clean."}, {"step": "While the cake is baking, make the syrup by heating all of the ingredients together (scrape the seeds from the split vanilla pod and add these in along with the pod) with 200ml water, bring to the boil then reduce the heat to a simmer. Cook for about 15 minutes until reduced and syrupy."}, {"step": "While the cake is still warm in the tin, cut it into squares. Discard the vanilla pod from the syrup and slowly pour half over the cake. Leave the cake to cool completely before removing from the tin. Sprinkle with the rose petals and chopped pistachios, drizzle with the remaining syrup and serve with a spoon of natural Greek yogurt."}], "nutrition": {"Energy": "1,455Kj/347kcals", "Fat": "16.2g", "Saturated Fat": "5.6g", "Carbohydrate": "43.7g", "Sugars": "35.6g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Rose-lemon-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}