{"title": "Rose and dark chocolate shortbread", "tags": null, "planning": {"prep_time": "PT25 minutes plus chilling and coolingM", "cook_time": "PT30 minutesM", "total_time": "PT55 minutes, plus chilling and coolingM", "serves": "20"}, "ingredients": [{"item": "200g unsalted butter, at room temperature"}, {"item": "100g caster sugar"}, {"item": "1 lemon, zest"}, {"item": "½-1 tsp rose water (rose water can vary in intensity, so add just a little at a time)"}, {"item": "1 tsp vanilla extract"}, {"item": "300g plain flour"}, {"item": "2 tbsp Waitrose Cooks’ Ingredients dried rose petals, plus extra to decorate"}, {"item": "200g dark chocolate"}], "instructions": [{"step": "Put the butter, sugar, lemon zest, rose water (to taste) and vanilla in a large bowl and, using an electric mixer, beat together for about 5 minutes or until light and fluffy. Scrape the bowl down and add the flour, a pinch of salt and the rose petals, mixing together briefly until it comes together as a dough. Tip the dough onto the work surface and bring together into a ball. Flatten with your hands, then roll out to a 25cm square; place on a baking tray and chill until firm – about 30 minutes. Preheat the oven to 170˚C, gas mark 3; line 2 baking trays with parchment. Halve the dough, then cut into 2.5cm-thick fingers and pierce all over with a fork. Put the biscuits on the prepared baking trays and bake for 25-30 minutes or until lightly browned. Remove from the oven and allow to cool completely. Put the chocolate in a heatproof bowl and microwave in 30 second bursts until about ¾ of the chocolate has melted. Mix vigorously with a spatula until fully melted (this is a quick method of tempering the chocolate). Dip the shortbread halfway into the chocolate, allow the excess to drip off, then lay on a clean sheet of parchment to set, decorating with a few extra rose petals. Once the chocolate has set, you can store the shortbread in an airtight container for up to 4 days."}], "nutrition": {"Energy": "847kj 210kcal", "Fat": "12.7g", "Saturated Fat": "7.8g", "Carbohydrate": "20.8g", "Sugars": "8g", "Protein": "2.5g", "Salt": "0.2g", "Fibre": "1.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Rose Dark Chocolate Shortbread.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}