{"title": "Rum and raisin bread and butter pudding", "tags": null, "planning": {"prep_time": "PT15 minutes, plus soaking and standingM", "cook_time": "PT40M", "total_time": "PT55 minutes, plus soaking and standingM", "serves": "6-8"}, "ingredients": [{"item": "6 tbsp (90ml) dark rum"}, {"item": "2 tbsp demerara sugar, plus extra for caramelising"}, {"item": "70g raisins"}, {"item": "3 tbsp (40g) unsalted butter, softened"}, {"item": "10 slices white bread, crusts removed"}, {"item": "400ml double cream"}, {"item": "400ml whole milk"}, {"item": "1 tsp freshly grated nutmeg"}, {"item": "8 egg yolks"}, {"item": "200g light brown muscovado sugar"}], "instructions": [{"step": "Mix the rum and demerara sugar and soak the raisins in it while you prepare the rest. Preheat the oven to 180˚C, gas mark 4. Butter the bread. Put the cream, milk and nutmeg in a saucepan and bring to just below boiling point. Mix together the egg yolks and muscovado sugar in a bowl and pour over the hot cream mixture, stirring all the time."}, {"step": "Halve the buttered bread slices diagonally and arrange in a shallow 1.8-litre ovenproof dish. Sprinkle the rum-soaked raisins in between so they are tucked between the slices. Pour any remaining rum into the warm custard then strain the mixture over the bread. Lightly press the bread and leave to stand for 30 minutes to soak up the custard."}, {"step": "Put the dish in a deep roasting tin and pour 2-3cm warm water into the tin. Bake for 30 minutes, or until the pudding begins to set; be careful not to overcook it. Remove from the oven and allow to stand for 10 minutes. Sprinkle with demerara sugar and caramelise with a blowtorch or under a very hot grill. Serve immediately."}], "nutrition": {"Energy": "Per serving (8) 2715kJ 651kcals", "Fat": "40g", "Saturated Fat": "22g", "Carbohydrate": "58g", "Sugars": "42g", "Protein": "9.2g", "Salt": "0.6g", "Fibre": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/Rum-&-Raisin-pudding.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}