{"title": "Rustic loaf", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25 minutes plus provingM", "cook_time": "PT35M", "total_time": "PT1 hour, plus proving M", "serves": "1 Loaf"}, "ingredients": [{"item": "500g essential Waitrose Strong Wholemeal Bread Flour, plus a little extra, for sprinkling"}, {"item": "1 tsp salt"}, {"item": "25g butter, diced or 1 tbsp olive oil"}, {"item": "1 tsp (7g) Doves Farm Quick Yeast"}, {"item": "300ml water"}], "instructions": [{"step": "Place the flour in a large mixing bowl and add the salt and the butter. Rub the butter into the flour with your fingertips until there are no large lumps of butter left."}, {"step": "Stir the yeast into the flour mixture, add 300ml water and mix quickly to form a soft dough, using your hand or a large wooden spoon. Draw the mixture into a ball, wiping the dough around the bowl to pick up any leftover flour. Turn out the dough onto a lightly floured surface."}, {"step": "Knead the dough for 15 minutes by stretching the dough away from you with the heel of your hand, then folding it towards you. Give the dough a quarter turn each time. Sprinkle a little more flour on the work surface as necessary. Knead until the dough no longer feels sticky and is smooth, silky and elastic. Shape into a ball."}, {"step": "Place onto a baking sheet and dust generously with flour. Grease a large piece of clingfilm with a little oil, then use to cover the dough loosely. Leave in a warm place until the dough has doubled in size. This will take around 1–1½ hours. Uncover the dough and use a sharp knife to cut a shallow criss-cross pattern into the surface."}, {"step": "Place the baking sheet in a cold oven, leaving plenty of room above it for the loaf to rise. Set the oven to 220ºC, gas mark 7. Bake the loaf for 30–35 minutes until it is golden brown. Then tap the bottom of the loaf with your knuckles – when it is cooked it will sound hollow. If it doesn’t sound hollow, return it to the oven for 5 minutes. Cool on a wire rack and leave for at least 15 minutes."}], "nutrition": {"Energy": "656.888kJ 157kcals", "Fat": "1.3g", "Saturated Fat": "1.3g", "Carbohydrate": "27.2g", "Sugars": "0.9g", "Salt": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/r/2013wked-April-r1f.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}