{"title": "Salmon and buckwheat noodle bowls with avocado and shiitake mushrooms", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT20M", "total_time": "PT40M", "serves": "2"}, "ingredients": [{"item": "1 tsp toasted sesame oil"}, {"item": "200g shiitake mushrooms, wiped clean and stalks trimmed"}, {"item": "2 tsp reduced-salt soy sauce"}, {"item": "150g buckwheat soba noodles"}, {"item": "160g frozen edamame beans"}, {"item": "2 x 130g salmon fillets, skin removed"}, {"item": "½ small avocado, sliced"}, {"item": "2 salad onions, finely sliced"}, {"item": "½ tsp black or toasted white sesame seeds"}, {"item": "½ tsp toasted sesame oil"}, {"item": "1 tbsp reduced-salt soy sauce 1 easy peeler mandarin, juice"}, {"item": "2 tsp rice vinegar"}, {"item": "1 tsp finely grated fresh"}, {"item": "root ginger"}], "instructions": [{"step": "Preheat the grill to high. Heat 1 tsp sesame oil in a large pan over a medium-high heat. Add the mushrooms and fry for 3-4 minutes until softened and starting to turn golden in places. Add the soy sauce and fry for a further 2 minutes, then set aside. Meanwhile, mix the dressing ingredients together in a bowl and set aside."}, {"step": "Bring a saucepan of water to the boil. Add the noodles and edamame beans and simmer vigorously for 4 minutes; top up the water if needed. Meanwhile, pat the salmon fillets dry then lay on a foil-lined baking tray. Spoon ½ tsp dressing over each and grill for 10 minutes until cooked through."}, {"step": "Drain the noodles and edamame and rinse well, separating the noodles with your fingers to remove any excess starch. Drain well, then add to the pan with the mushrooms. Toss together over a high heat with 1 tbsp dressing until warmed through. Divide the noodles between bowls and top with the salmon, avocado, salad onions and sesame seeds, spooning over the remaining dressing to serve."}], "nutrition": {"Energy": "2,935kJ 700kcals", "Fat": "24g", "Saturated Fat": "3.9g", "Carbohydrate": "64g", "Sugars": "9g", "Protein": "48g", "Salt": "1.4g", "Fibre": "15g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Salmon and buckwheat noodle bowls with avocado and shiitake mushrooms.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}