{"title": "Salmon en croute with artichokes", "tags": null, "planning": {"prep_time": "PT20 minutes plus coolingM", "cook_time": "PT30M", "total_time": null, "serves": "8"}, "ingredients": [{"item": "2 prime salmon fillets, each weighing about 450g (from the fish counter)"}, {"item": "125g tub Delamere Spreadable Goats Cheese"}, {"item": "175g tub Waitrose Puglian Artichokes Hearts(from the chiller)"}, {"item": "2 tbsp olive oil"}, {"item": "500g pack frozen Cooks’ Ingredients All Butter Puff Pastry, defrosted"}, {"item": "1 egg yolk beaten with 1 tsp water, to glaze"}], "instructions": [{"step": "Place one salmon fillet on a board, skinned side face down. Spread with the cheese and plenty of seasoning. Scatter the artichokes over, pressing down gently and drizzling with oil left in the tub. Arrange the second salmon fillet on top, skinned side face up. Tie at 6cm intervals with kitchen string.  Heat the oil in a frying pan large enough to fit the sandwiched fillets. (If you don’t have a pan large enough, use a flameproof roasting tin instead.) When the oil is hot, add the fillets and fry briefly on both sides to seal. Drain and leave to cool.  Preheat the oven to 220C, gas mark 7. Grease a large baking sheet. Place one pastry sheet on top of the other and roll out together until measuring 38cm wide and about 10cm longer than the salmon. Place the salmon on top and remove the string. Brush the edges of the pastry with water and wrap it around the salmon, pinching the edges together to enclose the fish and cutting off any excess areas of pastry at the corners.  Brush with the beaten egg, around the sides as well as on the top. Score the surface with a sharp knife to decorate and bake for 25-30 minutes, until risen and golden. Transfer to a serving platter and serve in thick slices."}], "nutrition": {"Energy": "2280.28kJ 545.0kcal", "Fat": "37.8g", "Saturated Fat": "14.1g", "Sugars": "1.3g", "Salt": "1.0g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/201004S24r1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}