{"title": "Salmon & prosciutto en croute recipe | Waitrose", "tags": [{"tag": "Christmas"}], "planning": {"prep_time": "PT20M", "cook_time": "PT30M", "total_time": "PT50M", "serves": "8 - 10"}, "ingredients": [{"item": "75g butter, at room temperature"}, {"item": "25g pack Cooks’ Ingredients Flat Leaf Parsley, finely chopped"}, {"item": "Grated zest and juice of 1 lemon"}, {"item": "2 x 500g packs puff pastry"}, {"item": "70g pack Waitrose Italian Prosciutto Crudo"}, {"item": "1 Waitrose Fresh Scottish Salmon Skinless Prime Fillet (about 1kg)"}, {"item": "1 red onion, finely sliced"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg, beaten"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. In a small bowl, beat together the butter with the parsley, lemon zest and juice. Season and set aside."}, {"step": "Roll out 1 pack of the puff pastry on a lightly floured surface to a rectangle measuring 38cm x 20cm (roughly 5cm longer and wider than the salmon). Transfer to a large greased baking sheet."}, {"step": "Arrange the slices of prosciutto over the pastry base, allowing it to hang over the edge."}, {"step": "Place the salmon on top of the prosciutto and spread the herb butter over the top of the fish. Sprinkle with the red onion slices then fold the overhanging slices of prosciutto over the fish. Brush the edges of the pastry with some beaten egg."}, {"step": "Roll out the remaining pack of pastry slightly larger than the first and place over the top of the salmon. Press the pastry down gently to seal, then trim the edges with a sharp knife. Pinch all the way around the join edges or press down with a fork to make a neat pattern. Score a criss-cross pattern on top, or use the pastry trimmings to make decorations."}, {"step": "Brush the pastry with the remaining beaten egg and bake for 30 minutes until golden and the salmon is just cooked. Slice and serve."}], "nutrition": {"Energy": "2,830kJ 679kcals", "Fat": "46.2g", "Saturated Fat": "21.5g", "Carbohydrate": "37.8g", "Sugars": "2.7g", "Protein": "28.1g", "Salt": "1.1g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK051115-xmas-salmon-prosciutto-en-croute.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}