{"title": "The Happy Pear's salted caramel meringue tart", "tags": [{"tag": "Vegan"}], "planning": {"prep_time": "PT25 minutes + chilling and soakingM", "cook_time": "PT20 minutesM", "total_time": "PT45 minutes + chilling and soaking overnightM", "serves": "8-10"}, "ingredients": [{"item": "For the shortcrust pastry"}, {"item": "270g plain flour, plus extra for dusting"}, {"item": "160g coconut oil"}, {"item": "1 tsp salt"}, {"item": "For the caramel filling"}, {"item": "125g cashews, soaked in cold water overnight"}, {"item": "400ml can organic coconut milk (chilled overnight)"}, {"item": "60g coconut sugar"}, {"item": "50g coconut oil"}, {"item": "½ tsp vanilla extract"}, {"item": "½ tsp salt"}, {"item": "For the vegan meringue"}, {"item": "½ x 400g can chickpea water (reserve chickpeas for another recipe)"}, {"item": "60g caster sugar"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Place the pastry ingredients into a food processor and blitz until a breadcrumb texture, add 3-4 tbsp cold water so the dough comes together. Dust the work surface with flour and knead the dough for a minute, wrap and chill in the fridge for about 15 minutes."}, {"step": "Line a 23cm loose-bottomed tin with baking parchment. Roll the pastry to about 1/2cm thick, on a floured work surface, then line the tin with the pastry, pressing neatly into the corners. Trim the edges so the pastry hangs slightly over the edges so it won’t fall back down when it bakes. Then place a square of baking parchment over the pastry and weigh it down with dried beans, rice or baking beans. Bake for 15 minutes, then remove the parchment and baking beans, return to the oven for a further 5 minutes, until the pastry is cooked, remove and set aside to cool and firm up."}, {"step": "Meanwhile, make the filling. Rinse and drain the cashews. Open the chilled coconut milk without shaking. Remove and reserve the solid cream layer (use the coconut water for another recipe or drink). Gently heat the coconut sugar in a pan with 2 tbsp water, until the sugar melts. Add the reserved coconut cream and the remaining filling ingredients, except the nuts, and simmer for a few minutes, until syrupy, then remove from the heat and cool slightly."}, {"step": "Blend the cashews in a food processor for 3-5 minutes or until smooth. Stir into the cooled filling mixture, before spooninginto the cooled pastry case. Chill in the fridge overnight, or for about 4 hours in the freezer."}, {"step": "Just before serving, make the meringue. Whisk the chickpea water in a clean bowl with an electric mixer on high for 3 minutes. As it starts to whiten and firm up, gradually add the sugar, and continue to whisk on medium for about 8-15 minutes until firm peaks form which hold their shape."}, {"step": "Spoon the meringue onto the tart, then toast the meringue under a hot grill (or with a blowtorch), until evenly golden. Return to the fridge for 10 minutes before serving. Enjoy with seasonal fruit."}], "nutrition": {"Energy": "1,997kJ 480kcals", "Fat": "35g", "Saturated Fat": "26g", "Carbohydrate": "35g", "Sugars": "13g", "Protein": "5.9g", "Salt": "0.8g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Saltedcaramelmeringetart.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}