{"title": "Salted caramel and ginger brownies", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "16"}, "ingredients": [{"item": "175g unsalted butter"}, {"item": "175g dark chocolate (70% cocoa), broken into small pieces"}, {"item": "375g golden caster sugar"}, {"item": "3 large eggs, beaten"}, {"item": "1 tbsp stem ginger syrup"}, {"item": "100g plain flour"}, {"item": "1 tsp ground ginger"}, {"item": "50g Waitrose Cooks’ Ingredients Dark Chocolate Chunks"}, {"item": "50g stem ginger, chopped"}, {"item": "160g Waitrose Seriously Buttery Caramel Dipping Sauce"}, {"item": "1 tsp sea salt flakes"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease and line a 20cm square cake tin with baking parchment. Melt the butter and chocolate in a heatproof bowl set over a pan of gently simmering water, then remove from the heat and beat in the sugar."}, {"step": "Beat in the eggs, one at a time, until smooth then beat in the stem ginger syrup. Sift in the flour and ginger into a bowl then fold into the chocolate mixture. Fold in the chocolate chunks and chopped stem ginger."}, {"step": "Heat the caramel sauce according to the instructions on the jar then pour into a small bowl and stir in the sea salt."}, {"step": "Pour half of the chocolate mixture into the prepared tin and smooth out with the back of a spoon.  Spoon the caramel sauce over the top then use a small skewer to swirl into the chocolate mixture. Pour the rest of the chocolate mixture over the top, ensuring all of the caramel is covered."}, {"step": "Give the tin a couple of sharp taps on the work surface to knock out any air bubbles, then bake for 1 hour."}, {"step": "Just before the brownies have finished baking, half fill a large roasting tin or the sink with cold water and add a handful of ice cubes. Once the brownies have finished baking, set the tin in the ice bath for 30 minutes to stop them from continuing to cook in the tin."}, {"step": "Once completely cool turn out and cut into 16 squares."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/gingerbrownie_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}