{"title": "Salted Caramel and Chocolate Tart", "tags": null, "planning": {"prep_time": "PT40 minutes, plus 7 hours 15 minutes chilling, freezing and coolingM", "cook_time": "PT35M", "total_time": "PT1 hour 15 minutes, plus 7 hours 15 minutes chilling, freezing and coolingM", "serves": "10"}, "ingredients": [{"item": "Filling"}, {"item": "300g Golden caster sugar"}, {"item": "250ml Double cream"}, {"item": "200g Salted butter"}, {"item": "150g Dark chocolate (at least 70% cocoa solids)"}, {"item": "¼ tsp Sea salt"}, {"item": "Pastry"}, {"item": "175g Plain flour"}, {"item": "15g Icing sugar"}, {"item": "90g Salted butter, chilled and cubed"}, {"item": "1 Egg yolk"}], "instructions": [{"step": "Briefly pulse the flour, icing sugar and a pinch of salt in a food processor. Add the butter and blitz until it resembles dry breadcrumbs. Add the egg yolk and 4 tsp chilled water; pulse again to bring it together. Chill for 30 minutes.  Preheat the oven to 180°C/gas 4 and put in a baking sheet. Roll the pastry out to a thickness of ½cm. Use it to line a 24cm tart tin, leaving a little pastry overhanging all the way round. Prick the base all over with a fork and put the pastry case in the freezer for 15 minutes.  Line the tart with greaseproof paper and baking beans; slide it onto the baking sheet and cook for 15 minutes; remove the paper and beans and cook for 10 minutes further. Cool for 10 minutes then trim the excess pastry to neaten.  Put the sugar in a heavy-based frying pan with 1 tbsp water; heat until the sugar dissolves but do not stir. Increase the heat and boil until it turns amber. Add 200ml double cream (the mixture may splutter); stir in 175g butter. Simmer for  3 minutes. Pour into the pastry case and cool for 30 minutes.  Melt the chocolate in a heatproof bowl over a pan of simmering water. Stir in the remaining butter and double cream. Drizzle onto the caramel. Use a spatula to swirl both mixtures together; chill for 6 hours to set. Before serving, sprinkle over the sea salt."}], "nutrition": {"Energy": "2535.504kJ 606.0kcal", "Fat": "52.8g", "Saturated Fat": "32.7g", "Sugars": "43.3g", "Salt": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0803048-r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}