{"title": "Salted Caramel Ice Cream", "tags": null, "planning": {"prep_time": "PT5 minutes, plus chilling and freezingM", "cook_time": "PT40M", "total_time": "PT40 to 45 minutes, plus chilling and freezingM", "serves": "6"}, "ingredients": [{"item": "Caramel"}, {"item": "120g unsalted butter"}, {"item": "130g golden caster sugar"}, {"item": "3/4 tsp sea salt"}, {"item": "90ml double cream"}, {"item": "Custard"}, {"item": "580ml milk"}, {"item": "7 medium egg yolks"}, {"item": "30g golden caster sugar"}, {"item": "Almond thins, to serve"}], "instructions": [{"step": "Start the caramel  Put the butter, sugar, salt and 2 tbsp water in a medium saucepan and simmer over a medium to low heat for 8–10 minutes, stirring occasionally, until the mixture changes colour from pale straw to golden, and appears condensed.  Finish and cool  Remove the pan from the heat and stir in the cream; it will splutter. Pour the caramel into a large bowl, cover and leave to cool for 30 minutes.  Make the custard  Bring the milk to the boil in a small saucepan. Meanwhile, beat the egg yolks and sugar together in a large bowl, then whisk in the hot milk. The mixture should thicken slightly into a thin pouring custard.  Strain and chill the mixture  Sieve the custard onto the caramel and whisk to blend the two together. Cover the bowl with clingfilm and leave to cool: chilling the mixture before freezing it takes some of the strain off the ice-cream machine.  Churn the ice cream  Freeze the mixture according to the instructions for your ice-cream maker, then transfer it to a plastic container, seal and freeze. If the mixture has frozen solid, take it out of the freezer 20 minutes before serving to allow it to soften. Serve in scoops with some dessert biscuits."}], "nutrition": {"Energy": "1941.376kJ 464.0kcal", "Fat": "35.0g", "Saturated Fat": "20.0g", "Sugars": "31.0g", "Salt": "1.0g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0809085-r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}