{"title": "Sarah Lemanski’s fire & spice ice box cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes, plus resting, infusing, cooling and chilling overnightM", "cook_time": "PT1 hour 20 minutesM", "total_time": "PT2 hours 5 minutes, plus resting, infusing, cooling and chillingM", "serves": "About 25"}, "ingredients": [{"item": "200g plain flour"}, {"item": "80g cocoa powder"}, {"item": "220g caster sugar"}, {"item": "¼ tsp salt"}, {"item": "¼ tsp bicarbonate of soda"}, {"item": "2 tsp ground ginger"}, {"item": "1 tsp mixed spice"}, {"item": "145g unsalted butter, chilled and diced, plus extra for greasing"}, {"item": "3 stem ginger balls in syrup, chopped"}, {"item": "3-4 tbsp whole milk"}, {"item": "300ml double cream"}, {"item": "1 dried ancho chilli, roughly torn"}, {"item": "200g dark chocolate (70% cocoa), broken into chunks"}, {"item": "50g caster sugar"}, {"item": "50g light brown soft sugar"}, {"item": "50g golden syrup"}, {"item": "75g unsalted butter"}, {"item": "125g double cream, plus extra if needed"}, {"item": "1½ tsp flaky sea salt"}, {"item": "750ml double cream"}, {"item": "2 tbsp stem ginger syrup, from the jar"}], "instructions": [{"step": "For the cookies, pulse the dry ingredients in a food processor until combined. Add the butter and pulse again until it resembles fine breadcrumbs. Mix in the stem ginger, and with the motor running, gradually add enough milk to form a smooth dough; don’t over-process. Tip the dough onto a clean work surface and form into a smooth roll about 32cm long and 5cm in diameter. Wrap in cling film; chill for at least 1 hour."}, {"step": "For the ganache, heat 250ml cream in a small pan with the ancho chilli until just boiling; set aside to infuse for 1 hour."}, {"step": "Melt the chocolate in a bain-marie or microwave. Meanwhile, strain the cream into a clean pan with the remaining 50ml cream and gently reheat until just boiling. In three additions, stir the cream into the melted chocolate until smooth and glossy. Set aside until ready to assemble."}, {"step": "For the salted caramel, gently heat all the ingredients in a saucepan until the sugar dissolves. Increase the heat, simmering briskly for 5-7 minutes, until you have a thick, yet pourable caramel; take care, making sure it doesn’t boil over or thicken too much and if necessary, stir in a little more cream to loosen. Set aside until ready to assemble, gently reheating until pourable again, if needed."}, {"step": "Preheat the oven to 170˚C, gas mark 3. Using a sharp knife, slice the chilled roll of dough into 0.5cm rounds – about 50-60 in total – and space 2cm apart, on parchment-lined trays. Bake in batches for 15-20 minutes, until crisp and firm to touch; transfer to cool on a wire rack immediately."}, {"step": "For the ginger cream, whip the double cream to just before soft peaks, then fold in the ginger syrup."}, {"step": "Grease and line the base and sides of a deep 20cm square cake tin with baking parchment, leaving a 5cm overhang on each side. Set aside some caramel and a few cookies for decoration, then layer up the four components in the tin, starting with 2-3 tbsp ginger cream. Follow with a layer of cookies, roughly breaking some up to fit between any gaps. Next, spoon over a thin layer of caramel, followed by more cookies and then a layer of ganache and another layer of cookies. Continue layering until you reach the top of the tin and finish with a layer of ginger cream. Chill for at least 8 hours, preferably overnight (it will keep in the fridge for up to 3 days)."}, {"step": "Lift the cake from the tin using the overhanging parchment and transfer to a serving plate. Crumble over the reserved cookies and finish with a drizzle of caramel."}], "nutrition": {"Energy": "1,783kJ 429kcals", "Fat": "33.8g", "Saturated Fat": "21.2g", "Carbohydrate": "28.3g", "Sugars": "21.1g", "Protein": "3g", "Salt": "0.5g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Waitrose-Kitchen-12-01-157031_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}