{"title": "Sardinian ricotta cake", "tags": null, "planning": {"prep_time": "PT20 minutesM", "cook_time": "PT45 minutesM", "total_time": "PT1 hour 5 minutesM", "serves": "8"}, "ingredients": [{"item": "300g ricotta"}, {"item": "300g caster sugar"}, {"item": "3 British Blacktail Medium Free Range Eggs, separated"}, {"item": "3 tbsp milk"}, {"item": "1 lemon, finely grated zest"}, {"item": "½ orange, finely grated zest"}, {"item": "125g plain flour"}, {"item": "1 tbsp baking powder"}, {"item": "Icing sugar, for dusting"}, {"item": "For the compote"}, {"item": "125ml orange juice"}, {"item": "125ml pink grapefruit juice"}, {"item": "150g granulated sugar"}, {"item": "2 broad strips lemon peel"}, {"item": "1/2 lemon, juice"}, {"item": "4 grapefruit (mix of pink and red)"}, {"item": "2 oranges"}], "instructions": [{"step": "To make the compote, heat the orange juice and grapefruit juice with 150ml water, the sugar and the lemon peel, stirring from time to time to help the sugar dissolve. Bring to the boil, then simmer for 10-15 minutes until the mixture is slightly syrupy. You should have about 250-275ml of liquid. Add the lemon juice. Leave to cool."}, {"step": "Cut a slice from both the top and bottom of the grapefruit and oranges, so that both ends are flat. Remove the peel and pith by setting the fruits on one of their flat bases and cutting from top to bottom, following the curve of the fruit and working your way around it. Now cut each fruit into thin slices, flicking out any seeds. Put the fruit in a shallow bowl, pour over the citrus syrup and chill."}, {"step": "To make the cake, butter and base line a 20-22cm springform tin. Preheat the oven to 190°C, gas mark 5."}, {"step": "Drain any excess moisture from the ricotta. Put it into the bowl of an electric mixer and beat until it’s soft and fluffy. Gradually add the sugar while still beating, then mix the egg yolks with the milk and add this too."}, {"step": "Stir in the zests, flour and baking powder. In a completely clean bowl, beat the egg whites until they are stiff. Using a large metal spoon, fold these into the egg yolk mixture."}, {"step": "Pour into the prepared tin and bake for 45 minutes. The cake is done when a thin skewer inserted into its middle comes out clean. The cake should also be slightly coming away from the sides of the tin."}, {"step": "Leave to cool for 15 minutes, then unclasp the tin at the side. Turn out onto a wire rack, peel the paper from the base, place a serving plate on the bottom of the cake and then, holding onto the plate and the cooling rack, invert so the cake is on the plate the right way up. Dust the surface with icing sugar and serve with the compote."}], "nutrition": {"Energy": "1,879kJ 444kcals", "Fat": "6.1g", "Saturated Fat": "3.2g", "Carbohydrate": "84g", "Sugars": "72g", "Protein": "9.4g", "Salt": "0.8g", "Fibre": "3.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sardinianricottacake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}