{"title": "Sausage & fennel ragù with cheesy polenta", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT45M", "total_time": "PT65M", "serves": "6"}, "ingredients": [{"item": "2 tbsp extra virgin olive oil"}, {"item": "2 x 400g packs pork sausages with black pepper and nutmeg, casings removed and meat broken into chunks"}, {"item": "200g smoked cubed pancetta or bacon lardons"}, {"item": "1 large onion, finely chopped"}, {"item": "2 cloves garlic, finely chopped"}, {"item": "2 tsp fennel seeds, bashed in a mortar and pestle"}, {"item": "½-1 tsp chilli flakes"}, {"item": "250ml red wine"}, {"item": "400g can chopped tomatoes"}, {"item": "1 tsp dried oregano"}, {"item": "2 bay leaves"}, {"item": "Pinch sugar (optional)"}, {"item": "For the polenta"}, {"item": "275ml full-fat milk"}, {"item": "½ tsp salt"}, {"item": "225g polenta valsugana"}, {"item": "50g butter"}, {"item": "45g Parmigiano Reggiano, grated, plus extra to serve"}], "instructions": [{"step": "Heat half the olive oil in a heavy-bottomed pan – you can use the rest of the oil as you need it – and brown the sausagemeat and pancetta all over in batches. Remove each batch of meat as it browns and set aside."}, {"step": "Add the onion to the pan and fry it until it is soft and golden. Then add the garlic, fennel seeds and chilli flakes, and cook for two minutes. Pour in the wine, tip in the tomatoes and add the oregano and bay leaves. Put the meat back into the pan, season and bring the dish to just under the boil. Turn the heat down and cook over a very low heat for 40-45 minutes. Cover the pan at first, then halfway through the cooking time remove the lid and leave it off, so the cooking juices can reduce a bit. You can put the lid on again if you need to. Basically you want to end up with thick juices around the sausagemeat. Check the seasoning – sometimes I add a pinch of sugar – and that the sausagemeat is completely cooked through with no pink meat."}, {"step": "For the polenta, bring 700ml water and the milk to a simmer. Add the salt and whisk in the polenta, beating until it’s smooth. Stir for 2 minutes, until you have a thick mixture. Turn the heat right down and cook, stirring occasionally for about 7-8 minutes. The polenta should be coming away from the sides of the pan. You might need to add more water – the mixture should be quite sloppy, not stiff. Add the butter, cheese and some pepper, and stir vigorously. Then taste for seasoning."}, {"step": "Quickly reheat the ragù, if needed, and serve it with the polenta and plenty of extra grated cheese."}], "nutrition": {"Energy": "3,037kJ 728kcal", "Fat": "42g", "Saturated Fat": "17g", "Carbohydrate": "43g", "Sugars": "7.6g", "Protein": "35g", "Salt": "2.1g", "Fibre": "5.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sausage-&-Fennel-Ragu-Polenta.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}