{"title": "Sausage, apple and leek pies", "tags": null, "planning": {"prep_time": "PT45M", "cook_time": "PT1M", "total_time": "PT1 hour 45 minutesM", "serves": "6"}, "ingredients": [{"item": "12 cumberland sausages"}, {"item": "1 tbsp unsalted butter"}, {"item": "2 large leeks, washed, trimmed and thickly sliced"}, {"item": "2 cox apples (or use jazz or braeburn later in the year), cored and roughly chopped"}, {"item": "3 tbsp plain flour, plus extra for dusting"}, {"item": "250ml fresh chicken stock"}, {"item": "250ml British cider"}, {"item": "2 tbsp wholegrain mustard"}, {"item": "2 x 250g Waitrose Cooks’ Ingredients frozen all-butter puff pastry, defrosted"}, {"item": "1 egg, lightly beaten, for glazing"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. Put the sausages in a roasting tin and bake for 30 minutes, until browned and cooked through; set aside to cool."}, {"step": "Meanwhile, melt the butter in a large frying pan; fry the leeks for 8-10 minutes, until nearly soft. Add the apples, cook for 1 minute, then stir in the flour and cook for 1-2 minutes. Gradually stir in the stock, then the cider to make a thick sauce. Add the mustard, season, and bubble for 1 minute."}, {"step": "Thickly slice the sausages and divide between 6 individual pie dishes (about 250-300ml in volume), then pour over the leek and apple sauce."}, {"step": "On a lightly floured surface, roll out the puff pastry to about 0.3cm thick. Cut out 6 pieces of pastry just larger than the tops of your pie dishes. Lay over the top of the dishes, press the edges round the sides and trim the excess. Glaze the pastry with the egg and make a couple of slits in the top with a sharp knife. Bake for 20-25 minutes, until the pastry is risen and golden. Cool for 5 minutes before serving."}], "nutrition": {"Energy": "2,681kJ 643kcals", "Fat": "40.1g", "Saturated Fat": "20.9g", "Carbohydrate": "48.7g", "Sugars": "11.8g", "Protein": "21.7g", "Salt": "1.7g", "Fibre": "4.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WKApples_PiesFeaturev2_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}