{"title": "Scotch egg pie", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT40M", "total_time": "PT50M", "serves": "6"}, "ingredients": [{"item": "7 essential Waitrose Free Range Eggs"}, {"item": "450g Waitrose Gourmet Pork Sausagemeat"}, {"item": "6 sundried tomatoes, finely chopped"}, {"item": "6 salad onions, thinly sliced"}, {"item": "2 tbsp essential Waitrose Grated Parmigiano Reggiano"}, {"item": "25g pack flat-leaf parsley, finely chopped"}, {"item": "2 x 215g frozen Cooks’ Ingredients All Butter Puff Pastry Sheets, thawed"}, {"item": "1 tbsp Dijon mustard Plain flour, for dusting"}], "instructions": [{"step": "Preheat the oven to 200ºC, gas mark 6. Cook 6 of the eggs in a pan of boiling water for 6–8 minutes, depending on the size of the egg. Cool and shell."}, {"step": "Meanwhile, mix together the sausagemeat, sundried tomatoes, salad onions, Parmigiano Reggiano and parsley until well blended."}, {"step": "Open out one sheet of the pastry and place on a baking sheet. Spread with Dijon mustard then smooth a third of the sausage mixture over the pastry, leaving a 1cm border around the edges. Place the peeled eggs, evenly spaced, on the sausagemeat then cover with the remaining mixture to enclose them."}, {"step": "Roll out the second sheet of pastry on a floured surface to make it a little larger. Beat the remaining egg and brush along the borders of the pastry, then lay the second sheet of pastry over the filling. Use a fork to press the borders together firmly to seal into a neat rectangular pie, trimming the edges if necessary."}, {"step": "Brush the pie with beaten egg and bake for 40 minutes until golden and cooked through. Leave to cool for a few minutes before slicing."}], "nutrition": {"Energy": "2414.168kJ 577kcals", "Fat": "35.9g", "Saturated Fat": "17.6g", "Carbohydrate": "36.7g", "Sugars": "4.4g", "Salt": "2.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/2013wked-April-r5e.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}