{"title": "Scotch pancakes with hot-smoked salmon, crispy sprouts, avocado and egg", "tags": [{"tag": "Christmas"}], "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "4"}, "ingredients": [{"item": "100g self-raising flour"}, {"item": "25g caster sugar"}, {"item": "½ tsp fine sea salt"}, {"item": "40ml whole milk"}, {"item": "6 eggs, 2 beaten"}, {"item": "3 tbsp extra virgin olive oil, plus a little extra for drizzling"}, {"item": "200g brussels sprouts, outer leaves discarded, thinly sliced"}, {"item": "2 garlic cloves, crushed"}, {"item": "2 tsp unsalted butter"}, {"item": "1 avocado, halved and sliced"}, {"item": "160g hot-smoked salmon, flaked"}, {"item": "4 tbsp Greek yogurt"}, {"item": "small handful flat leaf parsley leaves"}], "instructions": [{"step": "Put the flour, sugar and salt in a bowl. Whisk in the milk and 2 beaten eggs to make a smooth batter; set aside. Place a large non-stick pan over a high heat and add 2 tbsp olive oil. Once hot, add the sliced sprouts and stir-fry for 4 minutes, until golden and crispy. Add the garlic and fry for a further 30 seconds, stirring all the time. Remove from the heat, transfer to a warm plate, season and set aside."}, {"step": "Wipe out the pan with kitchen paper and add 1 tsp butter. When it sizzles, add 1 heaped tbsp batter for each pancake, making sure you don’t overcrowd the pan. Cook for about 2 minutes until bubbles appear on the surface and the base is golden, then flip over and fry for another minute until cooked through. Remove and keep warm in a low oven while you cook the rest of the pancakes in the remaining butter. You should end up with about 16."}, {"step": "Wipe out the pan again, heat the remaining 1 tbsp oil and fry the eggs to your liking. Divide the pancakes between 4 warmed plates and top with the eggs, sprouts, avocado, salmon and a spoonful of yogurt. Scatter over the parsley leaves and drizzle with a little more extra virgin olive oil. Serve immediately with a dash of chilli sauce, if liked."}], "nutrition": {"Energy": "Per serving 2619kJ 629kcals", "Fat": "42g", "Saturated Fat": "12.4g", "Carbohydrate": "29.3g", "Sugars": "10.1g", "Protein": "31.2g", "Salt": "1.6g", "Fibre": "4.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/scotch-cakes-with-smoked-salmon.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}