{"title": "Seared Tuna Steak with Sesame Crust", "tags": null, "planning": {"prep_time": "PT15 minutes plus marinatingM", "cook_time": "PT10 minutesM", "total_time": "PT25M", "serves": "4"}, "ingredients": [{"item": "4 tuna steaks, each about 2.5cm thick and weighing about 200g"}, {"item": "125g egg noodles"}, {"item": "2 tbsp sesame oil"}, {"item": "2-3 salad onions, shredded"}, {"item": "400g pak choi"}, {"item": "1 clove garlic, crushed"}, {"item": "2 tbsp vegetable oil"}, {"item": "125g sesame seeds"}, {"item": "Marinade"}, {"item": "4 tbsp soy sauce"}, {"item": "1 tbsp wasabi paste"}, {"item": "2cm piece ginger, grated"}, {"item": "2 tbsp Chinese cooking wine"}], "instructions": [{"step": "Start by mixing the marinade ingredients together in a flattish dish. Add the tuna steaks and turn them over in the marinade a few times until well-coated. Leave to marinate for about 30 minutes.  Cook the noodles as per packet instructions, drain them and toss with 2 tsp sesame oil and some of the shredded salad onions. Set aside and keep warm.  Meanwhile, trim the bases from the pak choi and remove any damaged outer leaves. Slice the pak choi in half lengthways and wash thoroughly, then steam for about 3 minutes. You can use a bamboo steamer, placing it on top of the pot in which the noodles are boiling, or you could use a metal steamer basket, or even a large sieve. Alternatively, use an electric steamer. While the pak choi is steaming, heat the remaining sesame oil over a medium heat in a frying pan. Add the crushed garlic and cook gently, making sure it doesn't burn. Transfer the steamed pak choi to the pan. Fry gently, turning once, for a minute or so. Then set aside and keep warm.  In a large, non-stick frying pan, heat the vegetable oil over a moderately high heat until hot but not smoking. Remove the tuna from the marinade and coat the steaks on both sides with sesame seeds. Place in the hot pan (in batches if necessary) and sear each steak for 1-2 minutes on each side, transferring to a side dish as they are done. The sesame seeds will turn a dark brown color, but should not burn. This cooking time will render the tuna rare: if you prefer it more well done, put the steaks on a baking sheet and bake at 180°C, gas mark 4 for 3-4 minutes.  To serve, cut each tuna steak into 4 slices and place on a small bed of the noodles. Add the pak choi. Garnish with the remaining salad onion and serve."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0405071-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}