{"title": "Sesame mackerel & roasted radish salad", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": "PT15M", "serves": "2"}, "ingredients": [{"item": "2 x small mackerel fillets, boned and skin slashed three times"}, {"item": "2 tsp sesame seeds"}, {"item": "2 tsp olive oil"}, {"item": "1 large orange"}, {"item": "2 tsp red wine vinegar"}, {"item": "½ tsp Dijon mustard"}, {"item": "200g pack radishes (such as French Breakfast), trimmed, halved or quartered if large"}, {"item": "A pinch caster sugar"}, {"item": "60g pack Waitrose Watercress, Rocket & Spinach Salad (from a twin pack)"}], "instructions": [{"step": "Season the fish, then press the sesame seeds over the skin. Heat ½ tsp oil in a non-stick frying pan, then fry the mackerel for 3 minutes on the skin side, until the sesame crust is golden and the fish is almost cooked through. Turn over, cook for 30 seconds, then remove to a plate. Keep warm."}, {"step": "Meanwhile, finely grate the zest from the orange. Then using a serrated knife, remove the skin and pith from the orange and segment the flesh, catching any juice in a bowl below. Squeeze the middle of the orange too, to give 1 tbsp juice. Whisk with the zest 1 tsp oil, 1 tsp vinegar, Dijon and seasoning to make a dressing."}, {"step": "Wipe the pan with kitchen paper. Add another ½ tsp oil, then fry the radishes over a high heat for 4-5 minutes, stirring often, until they start to char. Season, stir in the sugar and remaining vinegar."}, {"step": "Toss the salad, orange and radishes together with the dressing and divide between 2 plates. Serve the mackerel on top. Delicious with crusty bread."}], "nutrition": {"Energy": "1,292kJ 310kcals", "Fat": "20.9g", "Saturated Fat": "3.9g", "Carbohydrate": "11.8g", "Sugars": "11.7g", "Protein": "18.7g", "Salt": "0.4g", "Fibre": "3.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK_11052017_Sesame-Mackerel-Roasted-Radish-Salad_167757.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}