{"title": "Sesame pork tonkatsu", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT10M", "total_time": "PT40M", "serves": "2"}, "ingredients": [{"item": "125g uncooked or 250g cooked long grain rice"}, {"item": "100g white cabbage, finely shredded"}, {"item": "1 large carrot, grated or julienned"}, {"item": "2 tbsp Japanese rice vinegar"}, {"item": "Small pinch salt"}, {"item": "2 tbsp plain flour"}, {"item": "1 British Blacktail Free Range Medium Egg, beaten"}, {"item": "50g Cooks’ Ingredients Panko Breadcrumbs"}, {"item": "3 tbsp sesame seeds"}, {"item": "240g pack Waitrose 1 Extra Trimmed Pork Medallions"}, {"item": "2 tbsp sunflower oil"}, {"item": "2 tbsp Cooks’ Ingredients Tonkatsu Sauce"}], "instructions": [{"step": "If cooking the rice from scratch, prepare according to pack instructions. Toss the cabbage and carrot with the vinegar and a small pinch of salt; set aside."}, {"step": "Put the flour in a shallow bowl. Put the beaten egg in another shallow bowl, and the panko and sesame seeds in a third shallow bowl. Place the pork medallions between 2 sheets of cling film or baking parchment and use a rolling pin to beat out to a thickness of about 1cm. One medallion at a time, dip in the egg, then the fl our, then back in the egg and finally in the panko mixture; press firmly to coat all over, discarding any excess from the bowls."}, {"step": "Heat the oil in a large frying pan over a medium heat. Fry the breaded pork for 5 minutes on each side until golden all over and cooked through completely. Transfer to kitchen paper to drain any excess oil, then leave to rest for a couple of minutes, before slicing and serving with the rice, pickled cabbage and carrot, and the tonkatsu sauce drizzled over."}], "nutrition": {"Energy": "3,243kJ 783kcals", "Fat": "25.5g", "Saturated Fat": "4.7g", "Carbohydrate": "84.5g", "Sugars": "10.7g", "Protein": "50.1g", "Salt": "1.66g", "Fibre": "7.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sesame-pork-tonkatsu.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}