{"title": "Seville curd and cinnamon mille feuille", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT40M", "total_time": "PT60 minutes, plus coolingM", "serves": "8"}, "ingredients": [{"item": "60g unsalted butter"}, {"item": "250g golden caster sugar"}, {"item": "150ml Seville orange juice (from about 4-5 oranges), strained"}, {"item": "3 medium Waitrose British Blacktail Free Range Eggs, beaten"}, {"item": "Icing sugar, to dust"}, {"item": "375g pack Jus-Rol All Butter Puff Pastry Block"}, {"item": "1/2 tsp golden cinnamon"}, {"item": "170ml pot double cream"}], "instructions": [{"step": "Place the butter, sugar and orange juice into a bowl over a pan of simmering water and stir until the sugar has dissolved. Remove the  bowl from the heat and allow to coll a little before adding the beaten eggs, then return to the pan of simmering water and cook until thickened, stirring continuously for about 20 minutes, or until it coats the back of a wooden spoon.  Spoon the curd into a clean bowl, cover the surface with clingfilm and chill until needed. Preheat the oven to 220°C, gas mark 7.  Dust a clean surface with icing sugar and roll the pastry out to the thickness of a pound coin and about 20 x 24cm in size.  Trim and cut into 12 rectangles, each measuring 5 x 8cm.  Arrange these on a lined baking sheet and dust with the cinnamon.  Place another piece of baking parchment on top followed by another baking sheet and transfer to the oven.  Bake for 15-20 minutes until crisp and deep golden, removing the top baking sheet and parchment for the final 5 minutes.  Remove from the oven and allow to cool completely. Whip the cream until it forms soft peaks and spoon into a piping bag.  Split each pastry horizontally into 2 so you have 24 rectangles.  Spread the orange curd over 16 of the pastries and pipe 6 blobs of cream on each.  Place one on top of the other then top with the remaining pastries so you 8 mille feuille each with 3 layers.  Store any remaining curd in a jar in the fridge for about 1 week.  Dust the mille feuille with icing sugar and serve."}], "nutrition": {"Energy": "2,090kj 501kcals", "Fat": "31.3g", "Saturated Fat": "17.5g", "Carbohydrate": "49.1g", "Sugars": "35.8g", "Protein": "5.7g", "Salt": "0.6g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Seville-curd-mille-feuille.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}