{"title": "Seville orange and honey cake", "tags": null, "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 45 minutes, plus coolingM", "serves": "12"}, "ingredients": [{"item": "200g unsalted butter, softened, plus extra for greasing"}, {"item": "200g caster sugar"}, {"item": "1 Seville orange, zest and juice"}, {"item": "2 eggs"}, {"item": "300g plain flour, sifted"}, {"item": "1 tsp baking powder"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "150g natural yogurt"}, {"item": "50ml sunflower oil"}, {"item": "crème fraîche, to serve"}, {"item": "1½ Seville oranges"}, {"item": "75g caster sugar"}, {"item": "40g clear honey"}, {"item": "2 star anise"}], "instructions": [{"step": "Preheat the oven to 180˚C, gas mark 4. Grease and line a 900g loaf tin with baking parchment. Put the butter, sugar and orange zest into a bowl and, using electric beaters, beat until pale and creamy. Beat in the eggs, one at a time, until thoroughly combined, then gradually stir in the flour, baking powder, bicarbonate of soda, yogurt, oil and orange juice until fully incorporated."}, {"step": "Transfer the mixture to the lined tin and bake for 1 hour 10 minutes-1 hour 15 minutes, until golden and a skewer inserted into the centre comes out clean. Cover with foil after 40 minutes if browning too quickly. Remove from the oven and leave to cool in the tin on a wire rack for 10 minutes."}, {"step": "Meanwhile, for the syrup, use a zester to pare thin strips of zest from the oranges. (Alternatively, pare the zest with a peeler and slice it into thin strips.) Juice the oranges and put the juice in a pan with the zest, sugar, honey and star anise. Bring to the boil, then reduce the heat and simmer for 5-6 minutes, stirring frequently, until reduced, thick and syrupy."}, {"step": "Using a skewer, poke holes all over the cake while still in the tin. Remove the star anise and pour most of the syrup over the cake, reserving the zest and about 1 tbsp syrup. Set aside to cool completely. Transfer to a serving plate, pour over the remaining syrup and arrange the zest on top. Serve with a spoonful of crème fraîche."}], "nutrition": {"Energy": "2,072kJ 497kcals", "Fat": "32g", "Saturated Fat": "18g", "Carbohydrate": "47g", "Sugars": "28g", "Protein": "5.3g", "Salt": "0.3g", "Fibre": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/seville-orange-cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}