{"title": "Shepherdless pie", "tags": null, "planning": {"prep_time": "PT25 minutesM", "cook_time": "PT15 minutesM", "total_time": "PT40 minutesM", "serves": "6"}, "ingredients": [{"item": "Lentil mixture"}, {"item": "2 tbsp oil"}, {"item": "2 leeks, washed and cut into bitesized pieces"}, {"item": "3 cloves garlic, chopped"}, {"item": "½ large celeriac, peeled and finely sliced"}, {"item": "1 tsp salt"}, {"item": "2 x 400g cans lentils, drained and rinsed"}, {"item": "2 x 400g cans chopped tomatoes"}, {"item": "Sprig of rosemary or thyme, leaves only"}, {"item": "½ tsp freshly ground black pepper"}, {"item": "1 tsp smoked paprika"}, {"item": "2 bay leaves"}, {"item": "1 tbsp maple syrup"}, {"item": "2 tbsp tamari or soy sauce"}, {"item": "100g kale, stalks removed, leaves roughly chopped"}, {"item": "Sweet potato mash"}, {"item": "1kg sweet potato, scrubbed and cut into bitesized pieces"}, {"item": "75ml non-dairy milk alternative (such as nut or oat milk drink)"}, {"item": "3 tbsp olive oil"}, {"item": "Herb pesto"}, {"item": "3 cloves garlic"}, {"item": "80ml mild olive oil"}, {"item": "½ tsp salt"}, {"item": "Juice of ½ lime"}, {"item": "100g roasted cashew nuts"}, {"item": "50g mixed herbs, such as flat parsley, curly parsley, coriander, basil"}], "instructions": [{"step": "Preheat your oven to 200ºC, gas mark 6. Place the sweet potato for the mash into a large saucepan and cover with lightly salted water. Bring to the boil and simmer for 8-10 minutes until tender. Drain, then mash, gradually adding the non-dairy milk and olive oil. Season and keep warm."}, {"step": "Prepare the lentil mix. Heat the oil in a large pan over a high heat. Add the leek and garlic and cook for 2 minutes, stirring regularly, then add the celeriac and salt, cover and leave to cook for 5 minutes, stirring occasionally, until softened. Add the lentils, tomatoes, rosemary leaves, black pepper, smoked paprika, bay leaves, maple syrup and tamari. Bring to the boil, then reduce to a simmer and add the kale. Simmer for 5 minutes, stirring occasionally to ensure nothing sticks to the bottom of the pan."}, {"step": "Spoon the lentil mixture into an ovenproof baking or casserole dish, removing the bay leaves and top with the sweet potato mash. Bake for 15 minutes or until the top starts to crisp in places."}, {"step": "Meanwhile, put all the pesto ingredients into a blender with 80ml water and blitz until smooth and thin enough to drizzle. Serve hot from the oven, with any remaining pesto on the side. Serve with green salad and sauerkraut."}], "nutrition": {"Energy": "2,676kJ 641kcals", "Fat": "34g", "Saturated Fat": "5.4g", "Carbohydrate": "59g", "Sugars": "21g", "Protein": "16g", "Salt": "2.4g", "Fibre": "15g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Shepherdlesspie.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}