{"title": "Shiitake mushroom and crispy kale rice bowls", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20M", "cook_time": "PT35M", "total_time": "PT55M", "serves": "2"}, "ingredients": [{"item": "120g sushi rice"}, {"item": "1 tbsp Japanese rice vinegar"}, {"item": "1 tsp clear honey"}, {"item": "180g kale"}, {"item": "1 tsp sesame oil"}, {"item": "160g frozen soya beans"}, {"item": "1 tbsp vegetable oil"}, {"item": "1 tsp finely grated fresh root ginger"}, {"item": "300g shiitake mushrooms, stems trimmed and larger caps halved"}, {"item": "1½ tbsp reduced salt soya sauce"}, {"item": "2 salad onions, fi nely sliced"}, {"item": "1 tbsp sesame seeds, toasted"}], "instructions": [{"step": "Put the sushi rice in a pan, swirl in water to release some of the starch, then tip to pour out the excess water; repeat twice more. Pour 250ml fresh cold water over the rice, bring to the boil, then turn down to a low simmer, cover with a lid and cook for 12 minutes. Take off the heat and leave to stand covered for 10 minutes, then stir through the vinegar, honey and a pinch of salt."}, {"step": "Meanwhile, preheat the oven to 160°C, gas mark 3. Tear the kale from its stems into leafy pieces about 3cm wide. Toss with the sesame oil, season and spread out on a large baking tray; bake for about 20 minutes, turning halfway through, until crisp. Simmer the soya beans for 3-4 minutes in boiling water, then drain and set aside."}, {"step": "Heat the vegetable oil in a large frying pan, add the ginger and sizzle briefl y, then add the mushrooms and 5 tbsp water. Cook over a high heat for 3-4 minutes, until most of the water has evaporated, then tip in the soy sauce and cook until the liquid has evaporated and the mushrooms start to turn golden. Divide the rice between 2 shallow bowls. Top with the mushrooms, kale, soya beans, salad onions and sesame seeds."}], "nutrition": {"Energy": "2,595kJ 618kcals", "Fat": "20.4g", "Saturated Fat": "2.8g", "Carbohydrate": "80g", "Sugars": "14g", "Protein": "22g", "Salt": "1.5g", "Fibre": "12.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/shiitake-mushroom-rice-bowls.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}