{"title": "Shredded beetroot, caramelised onion & caraway filo tart", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT60M", "total_time": "PT70M", "serves": "4"}, "ingredients": [{"item": "1½ tbsp olive oil, plus a little extra for brushing"}, {"item": "2 onions, thinly sliced"}, {"item": "1 tsp caraway seeds"}, {"item": "2-3 raw beetroot, scrubbed and coarsely grated"}, {"item": "4 British Blacktail Large Free Range Eggs"}, {"item": "100g cottage cheese"}, {"item": "1 lemon, zest"}, {"item": "60g Essential 50% Reduced Fat Mature Cheddar, coarsely grated"}, {"item": "270g pack 7 sheets filo"}, {"item": "Mixed salad leaves, to serve"}], "instructions": [{"step": "Preheat the oven to 180ºC, gas mark 4. Heat the oil in a large frying pan, then add the onion and caraway. Season with salt. Cover the pan with a lid and cook gently for 15-20 minutes, stirring occasionally, until soft and golden (add a little water if it starts to dry)."}, {"step": "Take the lid off, turn the heat up and add the beetroot. Continue to cook for 10-12 minutes, until it loses lots of moisture. Turn off the heat and allow to cool a little. In a large bowl, beat together the eggs, cottage cheese, lemon zest and most of the Cheddar. Season and mix in the softened onion and beetroot."}, {"step": "Brush a 28cm rectangular baking tray with a little olive oil. Drape in a sheet of filo, letting it overhang the sides. Brush with a little oil and repeat with the remaining filo. Scoop the onion and beetroot into the tart case. Tuck in the overhanging edges, scatter with the reserved Cheddar and bake for 25-30 minutes until set and golden. Allow to cool for 10 minutes, then slice and serve with the salad."}], "nutrition": {"Energy": "1,913kJ 455kcals", "Fat": "15g", "Saturated Fat": "4.8g", "Carbohydrate": "52g", "Sugars": "15g", "Protein": "25g", "Salt": "1.2g", "Fibre": "5.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/ShreddedBeetrootOnionTart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}