{"title": "Silvana Franco’s raspberry & lemon roulade", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT15M", "cook_time": "PT30M", "total_time": "PT45M", "serves": "8 - 10"}, "ingredients": [{"item": "50g Waitrose Duchy Organic Almonds"}, {"item": "4 large Waitrose Duchy Organic British Free Range Egg whites"}, {"item": "225g caster sugar, plus extra for sprinkling"}, {"item": "1 tsp Aspall Organic White Wine Vinegar"}, {"item": "1 tsp almond or vanilla extract"}, {"item": "1 tsp cornflour"}, {"item": "225ml organic double cream"}, {"item": "4 tbsp Waitrose Duchy Organic Sicilian Lemon Curd"}, {"item": "125g Waitrose Duchy Organic Raspberries"}, {"item": "1-2 tbsp icing sugar"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5, and line a swiss roll tin (about 22 x 30cm) with baking parchment. Place the almonds in a small food processor and blitz until finely ground."}, {"step": "Whisk the egg whites in a clean bowl until stiff, then whisk in the caster sugar a little at a time until smooth and glossy. Mix together the vinegar, almond or vanilla extract and cornflour and whisk into the meringue along with the ground almonds. Pour into the swiss roll tin and smooth the surface with a palette knife. Bake for 25-30 minutes until the top is golden and the meringue feels firm."}, {"step": "Sprinkle a large sheet of baking parchment with 1 tbsp caster sugar and invert the roulade onto the paper. Carefully peel off the lining paper then cover with a clean sheet of baking parchment and a tea towel and leave to cool."}, {"step": "Whisk the cream in a mixing bowl until it forms soft peaks. Spread the surface of the meringue with the cream and scatter over the raspberries and small teaspoons of lemon curd. Roll up the meringue from the long side so that the join is underneath. Dust lightly with icing sugar before serving."}], "nutrition": {"Energy": "1,481kJ 354kcals", "Fat": "18.8g", "Saturated Fat": "9.2g", "Carbohydrate": "42.2g", "Sugars": "41.2g", "Protein": "4g", "Salt": "0.1g", "Fibre": "1.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Waitrose-Weekend_WK371_Duchy-Organic_Puds_Silvana-Franco's-Organic-Raspberry-Lemon-Roulade.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}