{"title": "Simnel cake", "tags": null, "planning": {"prep_time": "PT40 minutes, plus coolingM", "cook_time": "PT2–2¼ hoursM", "total_time": null, "serves": "16"}, "ingredients": [{"item": "400g pack LOVE Life Nut & Dried Fruit Selection"}, {"item": "175g slightly salted butter, softened"}, {"item": "175g light brown muscovado sugar"}, {"item": "2 tsp ground ginger"}, {"item": "1 tsp ground cinnamon"}, {"item": "3 medium Waitrose British Blacktail Free Range Eggs, beaten"}, {"item": "225g plain flour"}, {"item": "150g LOVE Life Soft Apricots, chopped"}, {"item": "675g white marzipan"}, {"item": "2 tbsp apricot jam, sieved and warmed, for brushing"}, {"item": "Icing sugar, for dusting"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. Grease and line the base and sides of an 18cm round cake tin with baking parchment. Pick out the Brazil nuts and any other larger nuts from the fruit and nut mix and chop into smaller pieces."}, {"step": "In a large bowl, beat together the butter, sugar and spices until pale and creamy. Gradually beat in the eggs, a little at a time, adding a spoonful of the flour if the mixture starts to curdle. Stir in the flour, fruit and nuts, including the apricots, until evenly mixed. Spread a third of the mixture into the tin."}, {"step": "Reserve 425g of the marzipan. Divide the remainder in half and roll out each piece on a surface lightly dusted with icing sugar to an 18cm round. Place one round over the mixture in the tin and spread with half the remaining cake mixture. Place the second rolled piece of marzipan on top and spread with the remaining cake mixture. Bake for 2-21⁄4 hours or until risen and firm to the touch. A skewer inserted into the centre should come out clean. Leave to cool before removing from the tin."}, {"step": "Place the cake on a baking sheet and brush with a little of the warmed apricot jam. Roll out 250g of the remaining marzipan to an 18cm round and place on top. Roll the rest of the marzipan into 11 balls and arrange around the edge, using a little water to stick if necessary. 5 Place under a moderate grill for 2-3 minutes until lightly toasted (watch closely as the marzipan will colour quickly — you might need to rotate the cake so it browns evenly). Transfer to a serving plate and leave to cool."}], "nutrition": {"Energy": "2125.472kJ 508kcals", "Fat": "23.7g", "Saturated Fat": "7.7g", "Carbohydrate": "65g", "Sugars": "53.6g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Simnel-cake-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}