{"title": "Skye Gyngell's rhubarb and ginger ice cream meringues", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT45 minutes, plus infusing, cooling and freezingM", "cook_time": "PT1 hourM", "total_time": "PT1 hour 45 minutes, plus infusing, cooling and freezingM", "serves": "6"}, "ingredients": [{"item": "150ml whole milk"}, {"item": "450ml double cream"}, {"item": "2 vanilla pods, split in half lengthways"}, {"item": "6 egg yolks"}, {"item": "300g caster sugar"}, {"item": "1kg rhubarb, cut into 5cm pieces"}, {"item": "125g caster sugar"}, {"item": "15g fresh root ginger, finely chopped"}, {"item": "4 egg whites"}, {"item": "240g caster sugar"}, {"item": "½ tsp vanilla extract"}], "instructions": [{"step": "To make the ice cream, put the milk and cream in a pan with 1 vanilla pod. Bring to just before boiling point, take off the heat and leave to infuse for 30 minutes."}, {"step": "Meanwhile, make the ginger syrup. Put the sugar and 150ml water in a small, heavy-based pan set over a medium-low heat and stir, bringing to a gentle simmer. Once the sugar has dissolved, turn up the heat and cook for 3-5 minutes to make a thick syrup. Stir in the ginger and leave to cool completely."}, {"step": "Gently reheat the infused milk mixture and whisk the egg yolks with 120g sugar in a bowl until pale. Pour the milk over the yolks, whisking as you go. Return the mixture to the pan and set over a low heat, stirring until it thickens (up to 10 minutes). It should be thick enough to lightly coat the back of a wooden spoon. Take off the heat and sieve into a clean bowl. Cover the surface with cling film, thencool to room temperature before chilling."}, {"step": "Meanwhile, put the rhubarb in a wide pan with 250ml water, the remaining vanilla pod and 180g sugar. Set over a medium-low heat and, stirring gently, bring to a simmer; cook for 10 minutes, until the rhubarb is soft but not completely falling apart. Cool and chill."}, {"step": "Pour the chilled custard base into an ice-cream machine and churn (you may need to do this in batches). Carefully lift the rhubarb from its juices, reserving the juice for serving. Once the ice cream has thickened and is almost set, fold in 2/3 of the rhubarb. Churn for a further 10 minutes, then transfer to freezeproof containers and freeze."}, {"step": "While the ice cream is freezing, make the meringues. Preheat the oven to 150˚C, gas mark 2, and line a large baking tray with baking parchment. Put the egg whites in a clean, dry bowl with a pinch of salt. Using an electric whisk, beat the egg whites until stiff peaks form. Beat in the sugar, a spoonful at a time, then the vanilla."}, {"step": "Put 6 generous, well-spaced spoonfuls of the mixture onto the tray. Using the back of a spoon, gently press the centres down to form 6 nests. Put on the middle shelf of the oven and immediately reduce the temperature to 120˚C, gas mark ½. Bake for 45 minutes, then turn off the heat and leave to cool completely in the oven before removing."}, {"step": "When you’re ready to serve, put a scoop of ice cream in the centre of each meringue, add a few pieces of cooked rhubarb and some of the rhubarb juices, then finish with a drizzle of the ginger syrup."}], "nutrition": {"Energy": "1,881kJ 446kcals", "Fat": "12.7g", "Saturated Fat": "7.4g", "Carbohydrate": "79.1g", "Sugars": "78.9g", "Protein": "3.9g", "Salt": "0.2g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sat_Night_with_Sky_6_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}