{"title": "Slow-cooked lamb shank pasties", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT2.5–3 hoursM", "total_time": "PT3-3.5 hoursM", "serves": "10"}, "ingredients": [{"item": "1 tbsp plain flour, seasoned"}, {"item": "2 lamb shanks"}, {"item": "2 tbsp oil"}, {"item": "1 leek, finely sliced"}, {"item": "1 onion, finely sliced"}, {"item": "2 cloves garlic, crushed"}, {"item": "2 carrots, diced"}, {"item": "1 tbsp tomato purée"}, {"item": "300ml red wine"}, {"item": "1 bay leaf"}, {"item": "300ml lamb stock"}, {"item": "1 sweet potato"}, {"item": "2 x 375g Jus-Rol All Butter Puff Pastry Block"}, {"item": "1 Waitrose British Blacktail Free Range Egg, beaten"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3. Sprinkle the flour over the lamb shanks and season. In a large casserole dish, heat the oil over a medium heat. Brown the floured lamb for 5-6 minutes, until there is no pink remaining on the meat, and then remove the shanks from the pan and set to one side."}, {"step": "Add the leek, onion and garlic to the casserole, and gently fry until soft. Stir in the carrots, followed by the tomato purée, wine, bay leaf and stock. Push the shanks into the liquid, cover with the lid and cook in the oven for 2-2½ hours, or until the lamb is falling off the bone and the sauce is thick. Remove from the oven and allow to cool completely. You can do this step in advance and make the pasties up later."}, {"step": "Peel and finely slice the sweet potato into very thin rounds, then chop into small pieces. Take the lamb shanks out of the sauce and remove the skin, bones and tendons. Shred the meat into small chunks, then mix back into the sauce with the sweet potato dice."}, {"step": "Preheat the oven to 200°C, gas mark 6. Roll out the puff pastry, one block at a time, to about 5mm thick on a lightly floured worksurface. Cut out 10 x 17-18cm circles: you should get 4 from each block, then gather up all the trimmings and reroll to make the remaining 2 circles."}, {"step": "On to half the circle, place three tablespoons of the lamb mixture, leaving a 1cm border, and smooth it over so no potato pieces are poking out. Brush the outside edge of the circle with egg wash, then fold the pastry over to make a semicircle around the filling. Crimp the edges, either with your fingers or a fork, and place on a baking tray. Repeat until all the filling and pastry are used up."}, {"step": "Brush the pasties with the remaining egg wash, and bake for 30-35 minutes, or until golden brown and piping hot. Enjoy hot or cold. The pasties will keep in the fridge for up to 3 days."}], "nutrition": {"Energy": "1,856kJ 445kcals", "Fat": "27.6g", "Saturated Fat": "12.3g", "Carbohydrate": "31.1g", "Sugars": "4.7g", "Protein": "18g", "Salt": "1.2g", "Fibre": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/WRWK-170316-Martha-lamb-pasties.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}