{"title": "Slow-roast shoulder of lamb with anchovy, oregano & garlic with roast potatoes", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT240M", "total_time": "PT190M", "serves": "4-6 with leftovers"}, "ingredients": [{"item": "1 whole shoulder (approx 1.2-1.5kg) essential Waitrose British Lamb"}, {"item": "1 large onion, cut into thick wedges"}, {"item": "5 anchovy fillets, roughly chopped"}, {"item": "Olive oil to drizzle"}, {"item": "1 bulb garlic, cloves separated"}, {"item": "15g pack oregano"}, {"item": "1 essential Waitrose Lemon, zest"}, {"item": "200ml white wine"}, {"item": "1kg essential Waitrose Potatoes, peeled and cut into chunks"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Place the shoulder of lamb on top of the onion wedges in a large roasting tin. Make deep incisions all over the meat and push the chopped anchovies into the slits. Drizzle with olive oil and season well. Roast in the oven for 20 minutes."}, {"step": "Scatter the whole garlic cloves, oregano and lemon zest under and over the lamb and pour in the wine. Cover with tin foil, then return to the oven, reducing the temperature to 160°C, gas mark 3 and cook for a further 3-3 ½ hours until the meat is really tender and pulling away from the bone. Uncover for the last 30 minutes cooking time."}, {"step": "About half an hour before the end of cooking, bring the potatoes to the boil in a large pan of salted water and simmer for 5 minutes. Drain and return to the pan over a low heat and shake to steam and fluff up. Drizzle all over with olive oil, scatter in a roasting tin and season well. Place in the oven above the lamb."}, {"step": "Once the lamb is cooked, allow it to rest for 20 minutes. Turn the oven up to 200°C, gas mark 6 to allow the potatoes to crisp. Serve the lamb on a large platter with its juices and the potatoes."}], "nutrition": {"Energy": "2,536kj 607kcals", "Fat": "35g", "Saturated Fat": "14.7g", "Carbohydrate": "33.2g", "Sugars": "4g", "Protein": "39.8g", "Salt": "0.8g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/LambwithAnchovyOregano_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}