{"title": "Slow cooked leg of lamb with sherry", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT4M", "total_time": "PT4 hours 15 minutesM", "serves": "8"}, "ingredients": [{"item": "6 cloves garlic, plus 1 whole head"}, {"item": "Pinch sea salt flakes"}, {"item": "Leaves from 8 sprigs thyme, plus 4 more sprigs"}, {"item": "8 tbsp olive oil"}, {"item": "2 kg whole leg of lamb"}, {"item": "2 large onions, cut into wedges"}, {"item": "300g slim bunched carrots, halved or quartered if large"}, {"item": "500g waxy potatoes, thickly sliced (I don’t bother to peel them)"}, {"item": "400ml Amontillado sherry (you may need more)"}], "instructions": [{"step": "Preheat oven to 220°C, gas mark 7. Crush the 6 cloves of garlic in a mortar and pestle with some sea salt flakes. Add the thyme leaves, olive oil and some pepper. You should have a loose paste. Separate the cloves in the head of garlic and set them aside."}, {"step": "Make incisions all over the lamb with the tip of a knife and slightly loosen the meat around the bone end. Push the herb paste down into these incisions, into the space around the bone and all over the joint. Put into a large roasting tin – you will need space to add all the vegetables later too. Season all over."}, {"step": "Roast the lamb for 20 minutes, then remove the tin from the oven. Turn the heat down to 160°C, gas mark 3. Put the onions, carrots, reserved unpeeled cloves of garlic, potatoes and remaining thyme under and around the lamb."}, {"step": "Bring the sherry to just below boiling point in a small saucepan over a high heat, then pour it into the tin over and round the lamb. Cover the tin with a double layer of foil and return to the oven. Cook for about 3 hours, turning the lamb over about 3 times and removing the foil half way through. Check on the sherry too – most of it will be absorbed by the vegetables during the cooking but don’t let it get too dry."}, {"step": "The lamb should be cooked to softness – if it isn’t, cook it for a little longer – and the vegetables should be completely tender. Set aside to rest covered in foil for at least 15 minutes. Serve the lamb with the vegetables and the sherry juices. All you need is a green vegetable or a green salad (a salad made with a sherry vinegar vinaigrette is good)."}], "nutrition": {"Energy": "2,637kJ 632kcals", "Fat": "34g", "Saturated Fat": "11g", "Carbohydrate": "22g", "Sugars": "9.3g", "Protein": "45g", "Salt": "0.5g", "Fibre": "4.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK26042018_Slow-Roasted-Leg-Of-Lamb-Sherry.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}