{"title": "Slow-roast lamb shoulder", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6 - 8"}, "ingredients": [{"item": "1 whole British lamb shoulder (about 1.75kg), trimmed of excess fat and sinew"}, {"item": "8 garlic cloves, roughly chopped"}, {"item": "20g pack rosemary, leaves chopped, stalks reserved"}, {"item": "50g pack anchovies in olive oil, roughly chopped, oil reserved"}, {"item": "3 large onions, cut into wedges"}, {"item": "4 medium carrots, cut into large chunks"}, {"item": "6 celery stalks, cut into large chunks"}, {"item": "4 tbsp plain flour"}, {"item": "250ml red wine"}, {"item": "500ml fresh lamb or chicken stock"}, {"item": "1 tbsp redcurrant jelly, or more to taste"}, {"item": "1 tbsp caster sugar"}, {"item": "2 x 25g pack mint, leaves chopped"}, {"item": "8 tbsp cider or white wine vinegar"}], "instructions": [{"step": "Preheat the oven to 130 ̊C, gas mark 1⁄2. Remove the lamb from the fridge 1 hour before cooking and pat dry with kitchen paper. Using a small paring knife, make incisions all over (about 2-3cm deep); season with salt."}, {"step": "Mix the garlic with the rosemary leaves and the anchovies and their oil; season. Stuff this mixture deep into the incisions on both sides and rub the rest all over the skin-side of the lamb shoulder."}, {"step": "Scatter the vegetables and rosemary stalks in a large, deep roasting tin. Place the lamb on top, skin-side up, and cover tightly with foil; roast for 2 hours 30 minutes. Uncover and cook for another 2 hours 30 minutes, or until the meat is very tender and easily tears with a fork. Transfer the lamb to a baking tray and rest for at least 30 minutes, loosely covered with foil. Turn the oven up to 250 ̊C, gas mark 9, and roast the vegetables for another 5 minutes, or until browned slightly."}, {"step": "For the gravy, pour off any excess fat from the roasting tin (you can keep this for roasties, if liked) and place on the hob over a high heat. Stir in the flour and cook, whisking for 3-4 minutes, until just starting to catch. Add the wine and boil rapidly, scraping the base of the tin as you go, until reduced by half, about 6-8 minutes. Add the stock and 500ml water, bubbling and whisking for 4-6 minutes, until just thickening. Pass through a fine sieve into a saucepan, pressing to extract the liquid (discard the veg). Add the redcurrant jelly and any resting juices from the lamb, boiling for another 20 minutes or so, until thickened to your liking; season if needed."}, {"step": "Roast the lamb for a final 3-5 minutes, until the skin is crisp and golden; rest for 5 minutes. For the mint sauce, dissolve the sugar in 1 tbsp boiling water. Stir in the mint, vinegar and a pinch of salt. Shred the lamb with 2 forks and serve with the gravy and mint sauce."}], "nutrition": {"Energy": "2,478kj 594kcal", "Fat": "36.1g", "Saturated Fat": "16g", "Carbohydrate": "22.8g", "Sugars": "12.2g", "Protein": "44.4g", "Salt": "1g", "Fibre": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Slow roast lamb shoulder.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}