{"title": "Slow-roasted tomatoes with chorizo & poached eggs", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT1 hour 15 minutesM", "total_time": null, "serves": "4"}, "ingredients": [{"item": "400g Waitrose 1 Red Choice tomatoes, halved"}, {"item": "4 large whole cloves garlic, unpeeled and bruised"}, {"item": "2 sprigs thyme"}, {"item": "2 sprigs rosemary"}, {"item": "5 tbsp extra virgin olive oil"}, {"item": "200g pack 4 Unearthed"}, {"item": "Smoked Cooking Chorizo de Leon or 190g Cooks’ Ingredients Chorizo"}, {"item": "70g bag Waitrose Duchy Organic Wild Rocket"}, {"item": "½ tbsp lemon juice"}, {"item": "1 pack half ciabattas"}, {"item": "1 tsp white wine vinegar"}, {"item": "4 Clarence Court Burford Browns Free Range Eggs"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 3. Place the tomatoes into a small roasting tin. Add the garlic, thyme and rosemary sprigs, season and drizzle with 2 tbsp olive oil. Mix well and arrange the tomatoes cut-side up."}, {"step": "Roast for 45 minutes until soft and starting to caramelise. Remove from the oven and keep warm. Turn the heat up to 190°C, gas mark 5. Place the chorizo into another baking dish, drizzle with 1 tbsp olive oil and roast for 20 minutes until browned and cooked through."}, {"step": "Squeeze the roasted garlic from their skins into a food processor or mini chopper. Add 25g rocket, lemon juice, the remaining olive oil, and some seasoning. Blend until smooth. Cut the ciabattas in half horizontally and warm through in the oven for 5-6 minutes."}, {"step": "Bring a pan of salted water to a simmer, add the vinegar and poach the eggs for 2 minutes until the whites are set or the eggs are cooked to your liking. Remove with a slotted spoon and drain."}, {"step": "Place a piece of bread on each plate, scatter with the remaining rocket and spoon over the tomatoes with any pan juices. Cut the chorizo into slices and arrange on top with a poached egg. Drizzle with rocket oil and serve immediately."}], "nutrition": {"Energy": "2,508kJ 602kcals", "Fat": "39.2g", "Saturated Fat": "9.7g", "Carbohydrate": "39.3g", "Sugars": "4.5g", "Protein": "22.9g", "Salt": "2g", "Fibre": "3.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK24082017_Slow-Roasted-Tomatoes-Chorizo-&-Poached-Eggs.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}