{"title": "Slow-roast pork with cauliflower cheese dauphinoise", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT20M", "cook_time": "PT4 hours 30 minutesM", "total_time": "PT4 hours 50 minutesM", "serves": "8"}, "ingredients": [{"item": "½ x 20g pack fresh rosemary, leaves only"}, {"item": "4 cloves garlic"}, {"item": "2 tbsp olive oil"}, {"item": "2.3kg Waitrose Free Range Hampshire Pork Shoulder Roast (or leg joint), skin removed"}, {"item": "Knob of butter"}, {"item": "80g pack essential Waitrose Grated Parmigiano Reggiano"}, {"item": "1kg Charlotte potatoes"}, {"item": "1 essential Waitrose Cauliflower"}, {"item": "600ml tub double cream"}, {"item": "¹⁄₃ whole nutmeg, for grating"}, {"item": "Hot gravy and Waitrose Bramley Apple Sauce, to serve"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7. Blitz the rosemary, garlic, oil and seasoning together in a mini processor to make a paste. Rub this mixture all over the pork. Place into a roasting tin, just bigger than the meat. Roast for 30 minutes then cover with foil, reduce the temperature to 160°C, gas mark 3 and cook for 4 hours."}, {"step": "When the pork has about 2 hours of cooking to go, start making the dauphinoise. Grease a large baking dish with the butter. Scatter over just enough Parmigiano Reggiano to coat the inside, tapping it around until completely coated. Peel and slice the potatoes as thinly as possible – using a mandolin or food processor if you have one. Remove the leaves and stem from the cauliflower and cut into slices the same thickness as the potatoes."}, {"step": "Reserve 2 tbsp of the Parmigiano Reggiano in the fridge. Layer one-third of the potato into the dish followed by half of the cauliflower and half of the remaining cheese. Season generously and grate over some nutmeg. Repeat, then finish with a layer of potato. Press down then slowly pour over the cream. Grate over a little more nutmeg and season again. About 1½ hours before the pork is cooked, add the dauphinoise to the oven below the pork."}, {"step": "Remove the pork and dauphinoise from the oven. Increase the oven temperature to 200°C, gas mark 6. Leave the pork to rest under the foil. Meanwhile sprinkle the potato with the reserved Parmigiano Reggiano and return to the oven for 10-12 minutes until golden and bubbling. Shred the pork with forks and serve with the cooking juices, dauphinoise, gravy and apple sauce. Delicious with seasonal vegetables."}], "nutrition": {"Energy": "1,108kJ 266kcals", "Fat": "19.1g", "Saturated Fat": "4.6g", "Carbohydrate": "14.3g", "Sugars": "12.1g", "Protein": "9.3g", "Salt": "0.4g", "Fibre": "5.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Slow-Roast-Pork-Cheese-Dauphinoise_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}