{"title": "Slow-cooked beef rib ragù", "tags": null, "planning": {"prep_time": "PT5M", "cook_time": "PT3 hours 30 minutesM", "total_time": "PT3 hours 35 minutesM", "serves": "6 - 8"}, "ingredients": [{"item": "2kg beef short ribs, patted dry with kitchen paper"}, {"item": "4 tbsp McDougalls Plain Flour"}, {"item": "3 tbsp vegetable or light olive oil"}, {"item": "2 carrots, cut into chunks"}, {"item": "2 sticks celery, cut into chunks"}, {"item": "1 onion, cut into chunks"}, {"item": "3 cloves garlic, crushed"}, {"item": "2 sprigs fresh rosemary, bruised"}, {"item": "1 bay leaf"}, {"item": "400g can plum tomatoes or chopped tomatoes"}, {"item": "500ml robust red wine"}], "instructions": [{"step": "Toss the ribs in the flour and seasoning to coat. Heat 1 tbsp oil in a large frying pan and fry half the ribs until browned on all sides. Repeat with another tbsp oil and the remaining ribs."}, {"step": "In a large casserole dish, cook the carrots, celery, onion and garlic in the remaining oil for 5 minutes. Add the ribs, herbs, tomatoes and wine. Half-fill the tomato can with water and add this to the casserole dish. Bring to the boil, then reduce the heat to its lowest setting. Lay a piece of wet, scrunched-up greaseproof paper over the surface of the mixture, then cover with the lid. Simmer gently for 3 hours, or until the meat pulls apart easily."}, {"step": "Transfer the ribs to a plate and cover with foil. Squash the vegetables into the sauce with a potato masher or fork, then strain the sauce through a sieve into a jug. Return the sieved sauce to the casserole dish and simmer for a further 15 minutes to reduce."}, {"step": "Meanwhile, remove and discard the bones and any sinew and fat from the ribs. Using 2 forks, shred the meat. Return the meat to the sauce and warm through. Serve the beef ragù with mashed potatoes or soft polenta."}, {"step": "CANNY TIPServe your guests the same red wine that forms the base for this ragù – it will be a perfect match."}], "nutrition": {"Energy": "1,871kJ 450kcals", "Fat": "33.9g", "Saturated Fat": "13g", "Carbohydrate": "13.5g", "Sugars": "4.9g", "Protein": "22.8g", "Salt": "0.3g", "Fibre": "1.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WaitroseWeekend_Jan16_SlowRoastedShortRibRagu.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}