{"title": "Slow-Braised Lamb with Flageolet Beans", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT280M", "total_time": "PT310M", "serves": "4"}, "ingredients": [{"item": "2 large onions, peeled and thinly sliced"}, {"item": "12 shallots, peeled and halved lengthways"}, {"item": "2 fresh bay leaves"}, {"item": "1 pack fresh rosemary"}, {"item": "½ pack fresh sage"}, {"item": "12 cloves garlic, peeled"}, {"item": "300ml red wine"}, {"item": "2 x 400g cans Waitrose Chopped Italian Tomatoes"}, {"item": "Juice of 1 lemon"}, {"item": "1 shoulder of lamb or two half shoulders, about 1.5kg total, bone in"}, {"item": "2 tbsp anchovy paste or Patum Peperium anchovy relish"}, {"item": "2 x 400g cans Waitrose Flageolet Beans, drained and rinsed"}, {"item": "Salt"}, {"item": "Freshly ground black pepper"}], "instructions": [{"step": "Preheat the oven to 140ºC, gas mark 1.  Place the onions, shallots, herbs and 10 of the garlic cloves in to a large flameproof casserole dish. Season generously with pepper but lightly with salt. Pour over the wine, tomatoes and their juice, and the lemon juice.  Make several incisions in the fleshy parts of the lamb with a small sharp knife. Thinly slice the 2 remaining garlic cloves and insert the slivers into the incisions. Season with pepper.  Smear the anchovy paste over the lamb (this adds a subtle, salty pungency), and then press the joint on to the onion mixture. Cover and cook for 4 hours in the oven.  Increase the oven temperature to 220ºC, gas mark 7. Carefully remove the dish from the oven. Stir the flageolet beans into the onion mixture and baste the lamb with juices. Return the dish to the oven, uncovered, and cook for a further 30-40 minutes.  Serve directly from the dish, carving the meat in chunky pieces. Serve with green beans and mashed potato."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0301ws40-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}