{"title": "Martha's Smarties cookies", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT10M", "total_time": "PT25M", "serves": "30 cookies"}, "ingredients": [{"item": "150g butter, softened"}, {"item": "125g light brown sugar"}, {"item": "100g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "1 large Waitrose British Blacktail Free Range Egg"}, {"item": "250g plain flour"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "½ tsp baking powder"}, {"item": "150g Smarties (or 4 x 38g tubes), half crushed and half whole"}], "instructions": [{"step": "In a large bowl, beat together the soft butter with both types of sugar using a wooden spoon. Beat the mixture until everything is well combined, but there’s no need for it to be light and fluffy."}, {"step": "Add the vanilla extract and egg to the butter mixture, and beat again until all the ingredients are smooth."}, {"step": "In a separate bowl, combine the remaining dry ingredients. Then pour them into the wet mixture and fold in using a spatula until a stiff dough forms. Add the Smarties, and stir through."}, {"step": "Refrigerate the dough for at least 30 minutes. Preheat the oven to 170°C, gas mark 3. Grease and line 2-3 large baking trays with baking paper."}, {"step": "Use a small ice cream scoop to form balls of dough (a teaspoon or tablespoon will work too, but the shapes won’t be as regular). Place the balls onto the trays, leaving space for each to spread out. Try not to roll them, as the ragged top created by the scoop gives the cookies their traditional cracked surface."}, {"step": "Bake the cookies for 10 minutes, or until the mixture has spread out and browned around the edges. Remove from the oven – the cookies should look undercooked in the middle – and allow to cool for at least 10 minutes."}], "nutrition": {"Energy": "531kJ 127kcals", "Fat": "5.4g fat", "Saturated Fat": "3.2g", "Carbohydrate": "18.1g", "Sugars": "11.5g", "Protein": "1.4g", "Salt": "0.2g", "Fibre": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/SmartiesCookies_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}