{"title": "Smashed potatoes with kale & poached eggs", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT25M", "total_time": "PT35M", "serves": "3"}, "ingredients": [{"item": "3 tbsp olive oil"}, {"item": "8 sage leaves"}, {"item": "500g bag Waitrose 1 La Ratte Potatoes"}, {"item": "2 garlic cloves, skin unpeeled and bashed"}, {"item": "240g pentland brig kale"}, {"item": "2 tsp lemon juice"}, {"item": "Pinch chilli flakes, plus extra to garnish"}, {"item": "2-3 British Blacktail Large Free Range Eggs"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7; put 1 tbsp oil in a roasting tray with the sage leaves and put in the oven as it’s heating up. Meanwhile, simmer the potatoes in a pan of water for 10 minutes, then drain. Remove the roasting tray from the oven, carefully lift out the sage leaves and set aside on kitchen paper. Add the potatoes and garlic to the tray, season and turn in the hot oil. Crush the potatoes lightly with a potato masher and drizzle over another 1 tbsp oil. Roast for 15 minutes, stirring gently halfway through."}, {"step": "Meanwhile, prepare the kale. Strip the leaves from the stalks and tear the leaves into bite-sized pieces (save the stalks for smoothies or chop into stews and soups). Heat the remaining 1 tbsp oil in a large frying pan and add the kale. Season with a pinch of salt and fry for 5-6 minutes until starting to wilt. Add the lemon juice and chilli flakes."}, {"step": "Poach the eggs in a separate pan of gently simmering water for 3-4 minutes. Divide the potatoes and kale between plates, and finish each with a poached egg. Scatter over a few more chilli flakes and the reserved sage leaves to serve."}], "nutrition": {"Energy": "1,496kJ 373kcals", "Fat": "18.8g", "Saturated Fat": "3.6g", "Carbohydrate": "32.6g", "Sugars": "2.5g", "Protein": "15g", "Salt": "0.36g", "Fibre": "6.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/smashed-potatoes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}