{"title": "Smoked trout pâté with soda bread", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6"}, "ingredients": [{"item": "450g smoked trout fillets"}, {"item": "100g soured cream"}, {"item": "1½ tsp horseradish sauce"}, {"item": "1½ tbsp capers, rinsed and chopped"}, {"item": "½ lemon, zest and juice, plus extra zest for garnishing"}, {"item": "1 tbsp chopped dill, plus extra for garnishing"}, {"item": "100g raisins"}, {"item": "175g plain flour, plus extra for dusting"}, {"item": "175g wholemeal flour"}, {"item": "100g jumbo rolled oats"}, {"item": "1 tsp salt"}, {"item": "2 tsp bicarbonate of soda"}, {"item": "40g unsalted butter, chilled and cut into cubes"}, {"item": "1 tbsp caraway seeds"}, {"item": "1 tbsp caster sugar"}, {"item": "284ml buttermilk"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. To make the soda bread, soak the raisins in a bowl of water until ready to use. Dust a baking sheet with a little plain flour. Put the flours, oats, salt, bicarbonate of soda and butter in a food processor and pulse until it resembles breadcrumbs."}, {"step": "Tip the mixture into a bowl, stir through the caraway seeds, sugar and drained raisins, then make a well in the centre and pour in the buttermilk, stirring until you have a soft dough. Knead lightly and bring together into a round. Place on the baking sheet. Dust the handle of a wooden spoon with a little more flour and use to make a cross on the top of the loaf. Bake for 40 minutes until risen and golden, then transfer to a wire rack to cool."}, {"step": "For the pâté, put all the ingredients in a bowl and mash together with a fork until combined. Season and transfer into 6 individual dishes or one large serving dish. Cover with clingfilm and chill until ready to serve."}, {"step": "Remove the pâté from the fridge 15 minutes before serving and garnish with a little more dill and lemon zest. Serve with slices of the soda bread, and some radishes and cornichons, if liked."}], "nutrition": {"Energy": "2263.544kJ 541kcals", "Fat": "16.2g", "Saturated Fat": "7.4g", "Carbohydrate": "70.1g", "Sugars": "19.9g", "Salt": "3.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Salmon (WR).jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}