{"title": "Smoked duck salad", "tags": null, "planning": {"prep_time": "PT5M", "cook_time": "PT15M", "total_time": "PT20M", "serves": "2"}, "ingredients": [{"item": "1 eshalion shallot, peeled and finely chopped"}, {"item": "1½ tbsp sherry vinegar"}, {"item": "10 cherry tomatoes on the vine"}, {"item": "3 tbsp walnut oil"}, {"item": "50g mangetout, trimmed and sliced in half on the diagonal"}, {"item": "75g green beans trimmed"}, {"item": "50g sugar snap peas, trimmed"}, {"item": "40g walnuts, roughly chopped"}, {"item": "2 x 80g packs Rannoch Smoked Duck"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6, and bring a pan of water to the boil. Place the chopped shallot in a bowl and pour over the sherry vinegar. Leave to steep while you prepare the rest of the salad."}, {"step": "Place the cherry tomatoes on a baking tray and drizzle with 1 tablespoon of the oil, then slide into the oven and roast for 8-10 minutes – you want the tomatoes to be just bursting from their skin, but still holding their shape. Remove from the oven and leave to one side."}, {"step": "When the water is boiling vigorously drop in the mangetout, green beans and sugar snap peas, and simmer for 1 minute before draining through a colander and cooling quickly under cold running water."}, {"step": "Tip the cooled greens into a bowl and add the remaining walnut oil with the chopped walnuts and the steeped shallot, along with any vinegar from the bowl. Toss the ingredients together until the beans are all well coated in the oil."}, {"step": "Divide the dressed beans between 2 bowls, top each with a good portion of smoked duck, then finish with the cooked cherry tomatoes on top."}], "nutrition": {"Energy": "2,287kJ 552kcals", "Fat": "48.8g", "Saturated Fat": "7.3g", "Carbohydrate": "6.9g", "Sugars": "5.9g", "Protein": "21.4g", "Salt": "2g", "Fibre": "3.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK100316-smoked-duck-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}