{"title": "Smoky pork escalopes with sweet potato & red bean mash & apple", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT20M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "1 clove garlic, crushed"}, {"item": "1½ tsp smoked paprika"}, {"item": "450g pack essential Waitrose 4 Pork Leg Escalopes"}, {"item": "600g sweet potatoes, cut into large chunks"}, {"item": "400g can essential Waitrose Red Kidney Beans, drained"}, {"item": "2 tsp sunflower oil"}, {"item": "2 medium red onions, cut into wedges"}, {"item": "3 small dessert apples"}, {"item": "½ tsp ground allspice"}, {"item": "3 tbsp chopped fresh parsley or coriander"}], "instructions": [{"step": "Mix the garlic, paprika and 2 tsp water in a bowl. Brush over the pork escalopes and leave for 5 minutes."}, {"step": "Put the sweet potato in a large pan, cover with boiling water, bring to a simmer and cook for 8-10 minutes until tender. Add the beans to the water, return to a simmer, drain and keep warm."}, {"step": "Heat 1 tsp oil in a frying pan over a medium-high heat. Core the apples, cut them into thick wedges and add them to the pan with the onions. Cook for 5 minutes until deep golden. Sprinkle with allspice, season, add 2 tbsp water to the pan, cover and leave over"}, {"step": "a low heat for 5 minutes."}, {"step": "Meanwhile, heat the remaining oil in a large frying pan over a medium-high heat. Add the pork and cook for 4 minutes each side until deep golden and cooked through. Mash the potato and beans and stir through the parsley."}, {"step": "Serve the pork with the sweet potato mash, onion and apples and any pan juices."}, {"step": "Tip: This recipe is gluten free, as well as being low in fat. It is also a source of thiamin, which helps your heart to function."}], "nutrition": {"Energy": "2,029kJ 482kcals", "Fat": "11.8g", "Saturated Fat": "3.4g", "Carbohydrate": "55g", "Sugars": "23g", "Protein": "33.9g", "Salt": "0.4g", "Fibre": "10.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK_04012018_Smoky_pork_escalopes_with_sweet-potato_&_red-_bean-mash-&-apple.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}