{"title": "Soy butter chicken & mushroom rice bowls", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT25M", "total_time": "PT35M", "serves": "4"}, "ingredients": [{"item": "250g essential Whole Grain Rice Easy Cook"}, {"item": "250g frozen edamame soya beans"}, {"item": "½ tbsp vegetable oil"}, {"item": "1 pack essential British Chicken 6 Thigh Fillets, trimmed of excess fat"}, {"item": "2 tbsp unsalted butter"}, {"item": "2 x 150g packs shiitake mushrooms, sliced"}, {"item": "2 tbsp reduced-salt soy sauce"}, {"item": "1 tsp honey"}, {"item": "1 tsp grated fresh ginger"}, {"item": "2 salad onions, sliced"}, {"item": "2 tsp toasted sesame seeds"}], "instructions": [{"step": "Place the rice in a large saucepan with triple the volume of water. Bring to the boil, cover and simmer for 20 minutes. Add the edamame (and more water if needed), re-cover and cook for another 4 minutes. Drain and set aside."}, {"step": "Meanwhile, heat the oil in a large frying pan over a medium heat and fry the chicken for 5 minutes on each side until cooked through and there is no pink meat and the juices run clear. Remove and set aside. Return the pan to the heat, add 1 tbsp butter and the mushrooms, stir and season with black pepper. Add 5 tbsp water and cook for 4-5 minutes until the mushrooms are tender and the liquid has cooked off."}, {"step": "Slice the chicken and return to the pan with the remaining 1 tbsp butter and soy, honey, ginger and 2 tbsp water. Stir to coat and cook for 2 minutes. Pile the rice and edamame into 4 bowls, top with the chicken and mushrooms, and scatter over the salad onions and toasted sesame seeds."}], "nutrition": {"Energy": "2,531kJ 603kcals", "Fat": "21g", "Saturated Fat": "6g", "Carbohydrate": "50g", "Sugars": "5.9g", "Protein": "50g", "Salt": "1.4g", "Fibre": "7.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WRWK060918 soy butter chicken mushroom rice.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}