{"title": "Spaghetti alle cozze", "tags": null, "planning": {"prep_time": "PT15M", "cook_time": "PT15M", "total_time": "PT30M", "serves": "2 - 4"}, "ingredients": [{"item": "1kg net fresh mussels"}, {"item": "150ml dry white wine"}, {"item": "400g Guiseppe Cocco Spaghetti"}, {"item": "4 tbsp extra virgin olive oil"}, {"item": "2 cloves garlic, peeled and finely chopped"}, {"item": "200g baby plum tomatoes, cut in half"}, {"item": "½ x 25g pack fresh parsley, finely chopped"}], "instructions": [{"step": "Remove the little beards from each mussel by pulling hard, wash the mussels under cold running water and place in a large saucepan. Pour in the white wine and cover with a tight fitting lid. Place the saucepan on a medium heat and cook for approximately 5 minutes. During cooking turn the mussels with a wooden spoon, so the mussels at the top of the pan move to the bottom and are in contact with the heat. The mussels are done when all the shells are fully open. Remove and discard any mussels that remain closed."}, {"step": "Lift the mussels out with a slotted spoon and leave in a bowl to cool. Pour the mussel juice from the saucepan into a jug and leave to one side to settle. This is important as any sediment from the mussels will float down to the bottom of the jug so when you use the juice to finish cooking the pasta you can make sure the gritty sediment doesn’t end up in your final dish."}, {"step": "Place a large saucepan that can hold 3 litres of water onto a high heat. When the water starts to boil add a little salt and all the spaghetti. Cook the spaghetti for 6 minutes (¾ of the cooking time on pack)."}, {"step": "Put a large frying pan on a low heat to warm up as you get the tomatoes, garlic and parsley ready. Add all the extra virgin olive oil to the warm pan and fry the garlic for about 20 seconds. Add the halved baby plum tomatoes. Stir and press down on the tomatoes with a wooden spatula to hurry the cooking along, for about 10 minutes. Add the chopped parsley, stir and cook for another couple of minutes."}, {"step": "When the mussels are cool enough for you to handle, pull the mussel meat out of each shell and place in a bowl. Alternatively, if you wish, simply serve them in their shells."}, {"step": "Add all the spaghetti to the large frying pan of tomatoes, garlic and parsley using a spaghetti spoon (retain the pasta water in the sauce pan as you will need it later on) and carefully pour in the mussel juice without adding the sediment from the bottom. Stir everything together."}, {"step": "Put a lid on the frying pan, turn the heat down to low and carry on cooking for the remainder of the spaghetti cooking time, 3-4 minutes, until the spaghetti is al dente (soft on the outside but slightly hard in the middle). If there is not enough mussel juice and the pan is too dry, add some of the retained pasta water. When the pasta is al dente, turn the heat off, add all the mussels and stir through. Serve immediately."}], "nutrition": {"Energy": "2,306kj 548kcals", "Fat": "17.1g", "Saturated Fat": "2.6g", "Carbohydrate": "75g", "Sugars": "3.6g", "Protein": "23.4g", "Salt": "0.6g", "Fibre": "4.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Spaghetti-Alle-Cozze_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}