{"title": "Spanish-style chick pea & chorizo fish stew", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 35 minutesM", "serves": "4"}, "ingredients": [{"item": "2 tbsp extra virgin olive oil, plus extra to serve"}, {"item": "100g almonds"}, {"item": "190g pack Cooks’ Ingredients Chorizo, each sausage cut into 4"}, {"item": "1 large onion, finely sliced"}, {"item": "6 cloves garlic , finely sliced"}, {"item": "2 tsp sweet smoked paprika, plus extra to serve"}, {"item": "25g pack flat leaf parsley, stalks finely chopped, leaves roughly chopped"}, {"item": "400g can essential Waitrose Plum Tomatoes"}, {"item": "400g can essential Waitrose Chick Peas"}, {"item": "150g Waitrose 1 Extra Large Spanish Queen Olives (around 12), pitted"}, {"item": "410g pack Waitrose Frozen Hake Fillets MSC"}, {"item": "4 tbsp aïoli or garlic mayonnaise, to serve"}], "instructions": [{"step": "Heat the oil in a wide, deep casserole or heavy-based pan over a medium heat. Add the almonds for 2-3 minutes until they start to pop (take care as they burn easily). Remove with a slotted spoon, cool briefly and chop quite finely."}, {"step": "Add the chorizo to the pan, and cook for 3-4 minutes until it is starting to crisp up. Stir in the onion, cook for 5-7 minutes more until softened, before adding the garlic for another 2-3 minutes. Stir through the paprika and parsley stalks, followed by the tomatoes and chick peas with all their juices. Fill each can with water and add this as well. Season, bring to the boil, then simmer briskly for 25-30 minutes, stirring occasionally, until thickened slightly."}, {"step": "Meanwhile, chop the pitted olives to the same size as the almonds and mix together with the chopped parsley leaves. Season."}, {"step": "Place the frozen fish fillets into the stew, cover and simmer gently for 15-18 minutes, or until the fish just flakes and is piping hot. Serve immediately, scattered with the olive and almond mixture. Top with spoonfuls of aïoli (or garlic mayonnaise) and more paprika and olive oil. Serve with lemon wedges and toasted crusty bread alongside, if liked."}], "nutrition": {"Energy": "3,093kJ 744kcals", "Fat": "54.1g", "Saturated Fat": "10.4g", "Carbohydrate": "20.3g", "Sugars": "7.3g", "Protein": "43.9g", "Salt": "2.7g", "Fibre": "7.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Waitrose-Weekend_WK346_WKEnd-Menu_Sun-Lunch_Spanish-Chickpea-Chorizo-Fish-Stew.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}