{"title": "Speedy veg noodles with oyster sauce", "tags": null, "planning": {"prep_time": "PT5M", "cook_time": "PT10M", "total_time": "PT15M", "serves": "4"}, "ingredients": [{"item": "300g pack Tenderstem broccoli spears, stalks halved lengthways"}, {"item": "3 nests fine egg noodles (about 200g)"}, {"item": "2 tbsp wok oil, plus extra for tossing"}, {"item": "3 large garlic cloves, finely chopped"}, {"item": "40g fresh root ginger, finely grated"}, {"item": "200g pack mixed exotic mushrooms"}, {"item": "300g pack sweet mixed pepper stir-fry"}, {"item": "1 tbsp reduced salt soy sauce"}, {"item": "5 tbsp Lee Kum Kee Premium Oyster Sauce"}, {"item": "20g roasted cashew nuts"}], "instructions": [{"step": "Bring a medium pan of water to the boil, carefully drop in the broccoli and boil for 1 minute. Using tongs, transfer the broccoli to a colander; cool briefl y under cold running water. Add the noodles to the pan of boiling water and take off the heat. Soak for 3 minutes, cool with water as above, drain, then sit on top of the broccoli. Toss with a drop of oil."}, {"step": "Meanwhile, heat 1 tbsp oil in a non-stick wok or frying pan over a high heat. Add the garlic and ginger, then sizzle for 30 seconds-1 minute until the garlic is starting to turn golden. Scoop out into a bowl using a slotted spoon."}, {"step": "Add the mushrooms to the wok and stir-fry for 2 minutes until golden in places. Tip into the bowl with the garlic and ginger. Heat the remaining 1 tbsp oil and stir-fry the mixed peppers for 1 minute. Add the noodles and broccoli, mushrooms, garlic and ginger. Splash in the soy sauce, followed by the oyster sauce, and toss well. Top with the cashew nuts and serve straight away."}], "nutrition": {"Energy": "1,562kJ 387kcals", "Fat": "12.8g", "Saturated Fat": "1.7g", "Carbohydrate": "47.1g", "Sugars": "6.2g", "Protein": "14.7g", "Salt": "2.87g", "Fibre": "12g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Speedy-veg-noodles.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}