{"title": "Spiced Apple Buns", "tags": null, "planning": {"prep_time": "PT30 minutes, plus provingM", "cook_time": "PT30M", "total_time": "PT1 hour, plus provingM", "serves": "Makes 10 buns"}, "ingredients": [{"item": "350g Waitrose Premium Strong White Bread Flour"}, {"item": "7g sachet easy-blend dried yeast"}, {"item": "40g golden caster sugar"}, {"item": "1 large egg"}, {"item": "100g butter"}, {"item": "200g golden marzipan, grated"}, {"item": "2 Granny Smith apples"}, {"item": "75g raisins"}, {"item": "1 tsp ground mixed spice"}, {"item": "Icing sugar, for dusting"}], "instructions": [{"step": "Place the flour, yeast and sugar in a mixing bowl. Make a well in the centre and add the egg. Melt the butter in a heatproof measuring jug in the microwave, then make up to 175ml with warm water. Add to the bowl and bring the mixture together with a round-bladed knife until it starts to form a soft dough.  Turn the dough onto a lightly floured surface and knead for 10 minutes or until smooth and elastic. Return to a clean bowl, cover with clingfilm and leave in a warm place for about 1½ hours or until the dough has doubled in size. Meanwhile, grease the base and sides of a 23cm round shallow cake tin and line the base with non-stick baking parchment (see Cook's tip).  Punch the dough with your fist to deflate, then tip it out onto a floured surface. Roll the dough out to a 50cm x 15cm rectangle. Scatter the marzipan over the dough to within 1cm of the edges. Peel, core and chop the apples and scatter over the marzipan. Mix the raisins with the spice and sprinkle them over the apples. Starting from a long edge, roll up the dough into a long, thin sausage shape.  Using a small sharp knife, cut the dough into 10 even-sized pieces. Place them with their cut sides face-up in the prepared tin. Cover loosely with a piece of greased clingfilm and leave to rise again (prove) for about 1 hour until the buns have risen and become tightly packed in the tin. Towards the end of the proving time, preheat the oven to 200°C, gas mark 6.  Uncover the buns and bake for about 30 minutes until deep golden. Cover with foil towards the end of the cooking time if they start to over-brown. Leave in the tin for 15 minutes then tip out onto a wire rack to cool. Dust with plenty of icing sugar."}], "nutrition": {"Energy": "1539.712kJ 368.0kcal", "Fat": "13.3g", "Saturated Fat": "6.5g", "Sugars": "28.7g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/050924r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}