{"title": "Spiced pumpkin & coconut casserole", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT75M", "total_time": "PT105M", "serves": "6"}, "ingredients": [{"item": "500g shallots"}, {"item": "1.5kg pumpkin or squash"}, {"item": "3 tbsp vegetable or rapeseed oil"}, {"item": "1 large fennel bulb, chopped"}, {"item": "3 red peppers, deseeded and roughly chopped"}, {"item": "6 cloves garlic, crushed"}, {"item": "2 tbsp Bart Cajun Seasoning"}, {"item": "2 tbsp chopped thyme"}, {"item": "1 vegetable stock cube"}, {"item": "400ml can coconut milk"}, {"item": "400g can chopped tomatoes"}, {"item": "100ml single cream"}], "instructions": [{"step": "Place the shallots in a heatproof bowl, cover with boiling water and leave to stand for 2 minutes. Drain and rinse in cold water. Peel away the skins, leaving the onions whole. Cut the pumpkin or squash in half, then scoop out and discard the seeds. Cut away the skin and chop the flesh into 2-3cm chunks."}, {"step": "Heat 2 tbsp of the oil in a large saucepan or flameproof casserole and add the fennel and shallots. Fry gently for 6-8 minutes, stirring frequently, until just beginning to colour. Drain to a plate. Add the peppers to the pan with the remaining oil and fry gently for10 minutes, stirring frequently, until softened and lightly browned. (Make sure they colour as this will bring out their sweetness and flavour.) Return the shallots and fennel to the pan, stir in the garlic, then add the Cajun seasoning, pumpkin and thyme."}, {"step": "Crumble in the stock cube and add 150ml water, the coconut milk and tomatoes. Bring to the boil, reduce the heat to its lowest setting, cover and cook very gently for about 45 minutes, stirring occasionally, until the vegetables are very tender."}, {"step": "Stir in the cream and heat through gently. Leave to stand for 10 minutes before serving."}], "nutrition": {"Energy": "1380.72kJ 330kcals", "Fat": "24.8g", "Saturated Fat": "14.4g", "Carbohydrate": "20.3g", "Sugars": "16.7g", "Salt": "1.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/2012wkwe-August-r2ah.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}