{"title": "Spiced pineapple upside-down cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT40M", "total_time": "PT55M", "serves": "8"}, "ingredients": [{"item": "100g golden syrup"}, {"item": "1 small red chilli, halved and deseeded"}, {"item": "425g can pineapple slices in fruit juice, drained"}, {"item": "100g soft unsalted butter"}, {"item": "150g caster sugar"}, {"item": "3 Waitrose British Blacktail Medium Free Range Eggs"}, {"item": "150g plain flour"}, {"item": "100g soured cream"}, {"item": "½ tsp baking powder"}, {"item": "1 tsp ground cinnamon"}, {"item": "1 tsp ground ginger"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Grease a 20cm round loose-bottomed cake tin and line with parchment paper. Pour the golden syrup into a small saucepan with the chilli and heat for a few minutes to gently infuse the syrup with the chilli. If you would prefer a little more heat, leave the chilli in the syrup for longer. Pour half of the syrup into the bottom of the cake tin, tilting the tin to spread it evenly."}, {"step": "Pat the pineapple slices with kitchen paper to remove as much excess liquid as possible. Arrange 6 of the rings in the base of the tin on top of the syrup in a single layer."}, {"step": "Using a handheld electric whisk, cream the butter and sugar together for a minute until light and fluffy. Beat in the eggs one at a time, adding 1 tbsp of flour after each addition. Stir in the soured cream and mix well. Mix together the remaining flour, baking powder and spices, then add a little at a time to the mixture, folding it in carefully until well combined. Chop the remaining pineapple and stir it into the mixture."}, {"step": "Spoon into the tin on top of the pineapple and level the top. Bake in the centre of the oven for 35-40 minutes or until a skewer inserted into the centre comes out clean. If the cake starts getting a bit too golden, cover with a sheet of parchment. Cool in the tin for 10 minutes before turning out onto a serving plate. Remove the chilli from the remaining syrup, then serve warm ready to pour over the cake. Delicious warm with crème fraîche or ice cream."}], "nutrition": {"Energy": "1,474kJ 352kcals", "Fat": "15.1g", "Saturated Fat": "8.7g", "Carbohydrate": "48g", "Sugars": "33.6g", "Protein": "5.4g", "Salt": "0.3g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Spiced-Pineapple-Upside-Down-Cake_181282.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}