{"title": "Spicy chicken, lime and tortilla soup", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT40M", "total_time": "PT65M", "serves": "4 - 6"}, "ingredients": [{"item": "2 tbsp olive oil"}, {"item": "1 large onion, sliced"}, {"item": "1 large green pepper, cut into 0.5cm pieces"}, {"item": "28g pack coriander, stalks finely chopped, leaves roughly chopped"}, {"item": "2 fresh jalapeño chillies, finely sliced"}, {"item": "6 medium tomatoes, finely chopped"}, {"item": "1 heaped tsp allspice berries"}, {"item": "1/4 tsp black peppercorns"}, {"item": "4 chicken legs"}, {"item": "1 bay leaf"}, {"item": "2 Cook's Ingredients Unwaxed Limes, zest and juice"}, {"item": "500ml fresh chicken stock"}, {"item": "5 corn tortillas"}], "instructions": [{"step": "Heat 1 tbsp oil in a large saucepan. Add the onion, green pepper, coriander stalks, most of the jalapeños and a pinch of salt. Fry over a medium heat for 7 minutes until the onion is soft and starting to colour. Stir in the tomatoes, allspice, peppercorns and cook for 5 minutes. Add the chicken, bay leaf, lime zest, chicken stock and 1 litre cold water. Bring to the boil; gently simmer for 20-25 minutes until the chicken is cooked through; skim off any scum as it cooks."}, {"step": "Meanwhile, preheat the over to 200°c, gas mark 6. Brush the remaining 1 tbsp oil over the tortillas, cut into thin strips and sprinkle with salt; spread on a baking tray. Bake for 4-5 minutes, until golden. Set aside. Carefully lift the chicken out of the pan with tongs; put on a board to cool. Put the broth back on the heat, then simmer gently."}, {"step": "Once the chicken has cooled a little, shred the flesh (discard the skin and bones). Remove the allspice from the broth, stir in the lime juice and season. Divide the chicken between bowls; ladle over the hot broth, topping each with coriander leaves, tortilla strips and remaining jalapeños. Serve with extra lime wedges, if liked."}], "nutrition": {"Energy": "1,937kJ 463kcals", "Fat": "13.1g", "Saturated Fat": "2.4g", "Carbohydrate": "52.7g", "Sugars": "8.7g", "Protein": "31.3g", "Salt": "1.13g", "Fibre": "4.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/mexican1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}