{"title": "Spicy Mexican lamb tortillas", "tags": null, "planning": {"prep_time": "PT45 minutes + soaking and restingM", "cook_time": "PT4 hours 35 minutesM", "total_time": null, "serves": "6-8 (about 16 small tortillas)"}, "ingredients": [{"item": "30g pack Cooks’ Ingredients Ancho Chillies"}, {"item": "25g pack Cooks’ Ingredients Cascabel Chillies"}, {"item": "2-3 Cooks’ Ingredients Habanero Chillies (depending on how hot you like it)"}, {"item": "4 tbsp sesame seeds"}, {"item": "1 tbsp ground cumin"}, {"item": "1 tsp ground allspice"}, {"item": "1 tsp ground coriander"}, {"item": "1 tsp freshly ground black pepper 1⁄2 tsp each ground cloves"}, {"item": "1⁄2 tsp ground cinnamon"}, {"item": "1 tbsp dried oregano"}, {"item": "10 cloves garlic"}, {"item": "1⁄4 x 20g pack thyme, leaves only 28g pack coriander, stalks nely chopped, leaves torn"}, {"item": "3 tbsp cider vinegar"}, {"item": "1 tsp table salt, plus more to season 2kg lamb shoulder, trimmed of excess fat"}, {"item": "5 red onions, quartered Toasted tortillas, warm refried beans, jalapeños, guacamole, soured cream and lime wedges, to serve"}], "instructions": [{"step": "Discardanyveinsandseeds from the chillies. Toast the chillies in a dry frying pan over a high heat for 3-4 minutes until softened. Then put in a saucepan, cover with water, put on a lid, and bring to the boil. Remove from the heat and set aside for 30 minutes. Drain, keeping some of the liquid."}, {"step": "Meanwhile,toastthesesame seeds in the frying pan over a high heat for 3-5 minutes, stirring often, until browned. Stir through all the spices and oregano and then whizz everything in a small food processor until ne. Add the soaked chillies, garlic, thyme, coriander stalks, vinegar, salt and 3 tbsp of the chilli soaking liquid. Blend to a thick paste, adding a splash more chilli liquid, if needed."}, {"step": "Season the lamb with salt, place in a large bowl (or sandwich bag) and rub the paste all over. Cover and chill for at least 2 hours, preferably overnight in the fridge."}, {"step": "Preheat the oven to 150 ̊C, gas mark 2. Place 4 of the onions into a deep roasting dish. Place the lamb on top and pour 300ml boiling water around it. Cover tightly with foil and braise for 4 hours, or until the meat falls o the bone."}, {"step": "Uncover, turn the oven up to 220 ̊C, gas mark 7 and roast for a nal 25-30 minutes, until crisped up slightly. Rest, loosely covered with foil for 20 minutes, before shredding. Finely slice the remaining onion and serve with the meat at the table with toasted tortillas and warm refried beans, the reserved coriander leaves, some pickled jalapeños, guacamole and soured cream, and lime wedges for squeezing over."}], "nutrition": {"Energy": "3,137kJ 750kcals", "Fat": "40.3g", "Saturated Fat": "16.2g", "Carbohydrate": "16.2g", "Sugars": "8g", "Protein": "48.3g", "Salt": "2.1g", "Fibre": "3.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Mexican-Lamb-Tortillas_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}