{"title": "Spinach, pine nut and ricotta tart", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT50-55 minutesM", "total_time": null, "serves": "4-6"}, "ingredients": [{"item": "150g plain flour"}, {"item": "75g butter, cubed"}, {"item": "50g Parmigiano Reggiano, finely grated"}, {"item": "235g pack spinach"}, {"item": "Freshly grated nutmeg, to season"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs"}, {"item": "200ml pouring or double cream"}, {"item": "100g ricotta"}, {"item": "25g pine nuts, toasted"}], "instructions": [{"step": "Preheat the oven to 190°C, gas mark 5.  Sift the flour and some seasoning into a bowl and rub in the butter until the mixture is crumbly.  Stir in half the Parmigiano Reggiano and add 2-3 tbsp cold water, stirring with the blade of a knife to bring the dough together.  Knead lightly, wrap in clingfilm and chill for 15 minutes.  Roll out on a floured work surface and use to line a deep, round 20cm loose-bottomed tart tin. Prick the base of the pastry with a fork, then line it with crumpled baking parchment and baking beans and bake for 10 minutes.  Remove the paper and beans and return tot he oven for a further 5 minutes. While the pastry is cooking, wash the spinach then place in a pan with the water still clinging to the leaves, cover and cook for a couple of minutes until wilted.  Drain thoroughly, squeezing to remove any excess liquid.  Add some grated nutmeg and seasoning to taste, then leave to cool. Spread the spinach over the base of the tart.  Whisk the eggs lightly with the cream and stir into the ricotta.  Spoon the egg mixture over the spinach and scatter with the pine nuts and remaining Parmigiano Reggiano.  Bake for 35-40 minutes until the filling is puffy, golden and just set.  Serve warm or cold with salad and new potatoes."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/SpinachRicottaTart2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}