{"title": "Spinach, cheese & walnut bread", "tags": null, "planning": {"prep_time": "PT2 hours, including resting and risingM", "cook_time": "PT40M", "total_time": "PT2 hours 40 minutes, including resting and risingM", "serves": "16"}, "ingredients": [{"item": "260g pack spinach"}, {"item": "6 tbsp olive oil, plus extra for greasing"}, {"item": "650g strong white bread flour"}, {"item": "100g Cheddar, coarsely grated"}, {"item": "100g walnut halves, roughly chopped, or pieces"}, {"item": "7g sachet easy bake yeast"}, {"item": "2 tsp fine sea salt"}, {"item": "Black pepper and ground nutmeg, to season"}], "instructions": [{"step": "Wash the spinach, dry it thoroughly in a salad spinner then set aside. Oil a 25cm round baking sheet or pizza tin, or 2 round sandwich tins (about 21-22cm diameter)."}, {"step": "Place the flour in a large bowl, then add the cheese, walnuts, yeast and salt in separate piles. Whisk 3 tbsp of the oil with 400ml warm water (ideally 25-40ºC)."}, {"step": "Mix the dry ingredients together in the bowl then immediately add the oil and water. Mix with a wooden spoon until well combined, then use your hand to keep turning the dough ball over in the bowl until all the ingredients are incorporated."}, {"step": "Press the dough flat in the bottom of the bowl, then fold an edge into the centre and press down; give a quarter turn of the bowl then repeat the folding and turning 9 times. You will feel the dough change under your hand and start to become smoother."}, {"step": "Rest the dough for 10 minutes. Meanwhile, cook the spinach: heat a large frying pan or wok, add 2 tbsp of the remaining oil and then the spinach. Stir-fry quickly until just wilted. Season with black pepper and nutmeg and leave to cool."}, {"step": "Fold and turn the dough again as above and rest for a further 10 minutes — repeat this process twice. Fold the dough 10 times for the fourth time, then turn it out onto a very lightly floured surface."}, {"step": "Roll out the dough to a rectangle approx 25x40cm and spread evenly with the cooled spinach. Roll up tightly from a long edge and cut into 16 even slices. Arrange the pieces on or in the prepared tins, then cover with oiled clingfilm or plastic bags, or a warm, clean damp tea towel. Leave for 45 minutes to 1 hour until well risen."}, {"step": "Preheat the oven to 200°C, gas mark 6. Bake the bread for 30-40 minutes, until deeply golden in colour. Leave for a few minutes then transfer onto a wire rack to cool. Break the savoury spirals of bread apart to serve."}], "nutrition": {"Energy": "1142.232kJ 273kcal", "Fat": "12.9g", "Saturated Fat": "2.7g", "Carbohydrate": "7.9g", "Sugars": "1g", "Salt": "0.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/25_Spinach_Walnut_Bread400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}