{"title": "Spinach, wild mushroom and gruyere pancakes", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "25g salted butter"}, {"item": "125g mixed exotic mushrooms"}, {"item": "1 garlic clove, crushed"}, {"item": "80g spinach"}, {"item": "¼ batch pancake batter (see below)"}, {"item": "2 large eggs"}, {"item": "2 tbsp crème fraîche"}, {"item": "30g gruyère, grated"}, {"item": "small bunch chives"}, {"item": "100g plain flour"}, {"item": "2 eggs"}, {"item": "300ml milk"}], "instructions": [{"step": "Melt the butter in a frying pan over a medium heat until foaming. Halve any large mushrooms, then add all of them to the pan and fry for 4-5 minutes, until beginning to brown. Add the garlic and cook for 3 minutes, then add the spinach, stirring until wilted. Season, then keep warm until ready to serve."}, {"step": "Cook 1 pancake following the method (below) then, after you’ve flipped it, crack an egg into the centre and cover with a lid. Cook for 2-3 minutes, until the egg white is set and the yolk is cooked to your liking. Slide the pancake onto a warm serving plate. Add a dollop of crème fraîche and top with ½ the mushrooms and spinach. Sprinkle over ½ the gruyère, scatter with some chopped chives and season with a grinding of black pepper. Repeat with a second pancake and serve straight away."}, {"step": "To make the batter, put the flour, eggs and a little of the milk in a large bowl and whisk together until smooth. Gradually whisk in the remaining milk to make a runny batter. (Alternatively, put all the ingredients in a blender and whizz until smooth.) Cover and set aside until ready to use (ideally chill it overnight) – or cook straight away."}, {"step": "Put a large non-stick frying pan over a medium heat, then test the pan by ladling in a very small amount of batter. It should take around 1 minute to brown on the bottom. If it browns too quickly, lower the temperature slightly; raise the temperature if it cooks too slowly and becomes rubbery. Discard (or eat!) the test pancake."}, {"step": "When the pan is at the right temperature, add a small knob of butter followed by a ladleful of batter. Swirl the pan to coat the base, then leave the pancake to cook for 1 minute. Flip and repeat on the other side, or until cooked through."}], "nutrition": {"Energy": "Per pancake 494kJ 118kcals", "Fat": "6.2g", "Saturated Fat": "3.4g", "Carbohydrate": "11g", "Sugars": "1.8g", "Protein": "4.3g", "Salt": "0.1g", "Fibre": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Spinach,-mushroom-and-gruyere-pancakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}