{"title": "Spinach & vegan ricotta cannelloni", "tags": null, "planning": {"prep_time": "PT30 minutesM", "cook_time": "PT20-25 minutesM", "total_time": "PT50-55 minutesM", "serves": "4-6"}, "ingredients": [{"item": "10 (about 175g) essential Lasagne Sheets (or other vegan alternative)"}, {"item": "100g Waitrose Vegan Original Block"}, {"item": "For the tomato sauce"}, {"item": "1 tbsp olive oil"}, {"item": "1 medium onion, chopped"}, {"item": "3 cloves garlic, chopped"}, {"item": "1 red chilli, chopped (deseeded if you wish)"}, {"item": "2 x 400g cans chopped tomatoes"}, {"item": "1 tbsp maple syrup"}, {"item": "1 tsp salt"}, {"item": "¼ tsp black pepper"}, {"item": "For the filling"}, {"item": "350g cashew nuts"}, {"item": "¾ tsp garlic granules"}, {"item": "½ tsp onion granules"}, {"item": "200g spinach"}], "instructions": [{"step": "For the tomato sauce, warm the oil in a saucepan over a medium heat, add the onion, garlic and chilli, and cook for 2-3 minutes, stirring so the garlic does not burn. Then stir in the chopped tomatoes, syrup, salt and pepper. Cover and simmer for 10-15 minutes, stirring occasionally, until slightly thickened."}, {"step": "Meanwhile, for the filling, cover the cashew nuts with water in a saucepan and bring to the boil for 15 minutes. Drain well and rinse under cold running water. Add the nuts to a blender, along with 200ml water, the garlic granules, onion granules and a pinch of salt, then"}, {"step": "blitz until smooth."}, {"step": "Wilt the spinach in a separate covered pan with 50ml boiling water for about 2-3 minutes. Drain. When cool enough, squeeze well to remove any excess moisture. Roughly chop and sprinkle with a pinch of salt. Mix into the cashew cream."}, {"step": "Preheat the oven to 200°C, gas mark 6. Place the lasagne sheets in a large bowl and cover with freshly boiled water. Leave to soak for 10 minutes, or until softened enough to roll up. Lay out the lasagne sheets on a clean tea towel. Top each sheet with about 4 heaped tbsp of spinach mixture and spread down the length of the sheet on one side. Gently roll up each one to create 10 loose tubes."}, {"step": "Spread some of the tomato sauce over the base of an ovenproof baking dish (about 18cm x 30cm). Add the 10 filled rolls in a tightly packed single layer on top. Cover completely with the remaining tomato sauce. Top with the grated vegan cheese and bake for 20-25 minutes until cooked through, bubbling and browned."}], "nutrition": {"Energy": "2,421kJ 580kcals", "Fat": "34g", "Saturated Fat": "8.6g", "Carbohydrate": "45g", "Sugars": "13g", "Protein": "19g", "Salt": "1.6g", "Fibre": "7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Spinachandveganricottacannelloni.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}