{"title": "Spring Lamb and Vegetable Pie", "tags": null, "planning": {"prep_time": "PT40 minutes, plus chillingM", "cook_time": "PT2 hours 10 minutesM", "total_time": "PT170M", "serves": "8"}, "ingredients": [{"item": "1kg Neck of lamb, in 2.5cm cubes"}, {"item": "3 tbsp Vegetable oil"}, {"item": "200ml Red wine"}, {"item": "1 tbsp Rice flour"}, {"item": "2 Garlic cloves, finely chopped"}, {"item": "1 litre Chicken stock"}, {"item": "1 tbsp Tomato purée"}, {"item": "2 tsp Soft brown sugar"}, {"item": "2 Bay leaves"}, {"item": "1 Thyme sprig"}, {"item": "12 Shallots"}, {"item": "4 Baby turnips, roots trimmed"}, {"item": "12 Baby carrots, peeled"}, {"item": "1 tbsp Finely chopped parsley"}, {"item": "1 Egg, beaten"}, {"item": "Pastry"}, {"item": "350g Rice flour"}, {"item": "1 tsp Salt"}, {"item": "275g Cold butter, diced"}, {"item": "225g Cold mashed potato"}], "instructions": [{"step": "Season the lamb. Heat 1 tbsp oil in a casserole on a medium heat. Brown the lamb in batches using up to 1 more tbsp oil; set aside. Between batches, deglaze the pan with a little of the red wine and some water; add to the lamb.  Reduce the heat; fry the rice flour and garlic for 30 seconds. Stir in the stock, tomato purée and brown sugar. Return the lamb to the pan with the juices. Add the bay leaves and thyme, the remaining wine and, if needed, water to cover. Simmer for 1 hour; skim off any fat.  Season the veg and brown in the remaining oil. Add to the stew with the parsley, cover and simmer over a low heat for 30 minutes. Transfer to a wide-rimmed, 2.2 litre pie dish and cool.  Meanwhile, for the pastry, sieve the rice flour and salt. Rub in the butter until it resembles breadcrumbs. Stir in the potato. Dust the work surface with rice flour and knead the dough till smooth. Wrap in clingfilm; chill for 30 minutes.  Preheat the oven to 200°C/gas 6. Roll two thirds of the pastry to 3mm thick between 2 sheets of clingfilm. Remove the top sheet; cut long strips, the width of the pie-dish rim, from the pastry’s edges. Brush the rim with water, cover with the strips and brush them with water. Press the trimmed pastry on top. Peel off the clingfilm; trim and crimp the edges. Cut a 1cm steam hole in the centre. Decorate with leaves cut from the remaining pastry. Glaze the pastry with the egg. Bake for 40 minutes."}], "nutrition": {"Energy": "3740.496kJ 894.0kcal", "Fat": "56.6g", "Saturated Fat": "28.6g", "Sugars": "7.2g", "Salt": "1.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0803034-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}