{"title": "Squash, coconut & chilli pie", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT1M", "total_time": null, "serves": "4"}, "ingredients": [{"item": "1kg butternut squash"}, {"item": "2 tbsp sunflower oil or coconut oil"}, {"item": "2 red onions, roughly chopped"}, {"item": "2 green peppers, de-seeded and cut into small chunks"}, {"item": "3 garlic cloves, crushed"}, {"item": "½ tsp dried chilli flakes"}, {"item": "400ml vegetable stock"}, {"item": "75g creamed coconut"}, {"item": "4 tomatoes, skinned and roughly chopped"}, {"item": "2 tbsp sun-dried tomato paste"}, {"item": "500g pack puff pastry"}, {"item": "Beaten egg or milk, to glaze"}], "instructions": [{"step": "Cut the squash into 2cm pieces, discarding the skin and seeds. Heat the oil in a large saucepan and gently fry the onions and peppers for 10 minutes until softened and beginning to colour. Add the squash, garlic and ¼ teaspoon of the chilli flakes to the pan and pour in the stock. Bring to a gentle simmer and cover with a lid. Cook for 5 minutes to slightly soften the squash."}, {"step": "Chop the creamed coconut into pieces and add to the pan. If it’s very solid, soften it for a few moments in the microwave so it’s easier to cut into pieces.  Add the tomatoes and tomato paste to the pan and stir for a couple of minutes until the coconut has melted into the stock. Turn into a pie dish and leave to cool. (If there’s too much liquid, ladle into a small jug for serving separately)."}, {"step": "Preheat the oven to 200*C, gas mark 6. Roll out the pastry until large enough to cover the pie. Brush the rim of the dish with water and position the lid, trimming off the excess. Make a hole in the centre of the pie with the tip of a knife and use the trimmings to decorate, if liked."}, {"step": "Brush the pie with beaten egg or milk to glaze and sprinkle sparingly with sea salt and the remaining chilli flakes. Bake for 30 minutes until risen and golden. Reduce the oven temperature to 180*C, gas mark 4 and cook for a further 20-25 minutes until golden."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/TV/Chilli,-squash-&-coconut-pie-2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}