{"title": "Squash and feta soup", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutesM", "cook_time": "PT1 hour 5 minutesM", "total_time": null, "serves": "8"}, "ingredients": [{"item": "2 butternut squash"}, {"item": "2 tbsp olive oil, plus extra for drizzling"}, {"item": "1 bulb garlic, halved horizontally"}, {"item": "2 tsp ras el hanout"}, {"item": "50g unsalted butter"}, {"item": "2large onions, finely chopped"}, {"item": "1 red chilli"}, {"item": "1.2 litres vegetable stock"}, {"item": "170ml pot double cream"}, {"item": "1 tbsp tahini"}, {"item": "100g feta, crumbled"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3.  Peel the squash, cut into wedges and scoop out the seeds and fibres.  Separate out the seeds and place in a bowl, discarding the fibres. Lay the wedges of squash on a roasting tray, drizzle with the olive oil and season well.  Place the garlic halves on a large sheet of foil, drizzle with a little oil then scrunch it into a parcel and add to the tray.  Roast for 30 minutes, or until the squash is tender.  Remove from the oven, leave to cool slightly then cut the squash into rough chunks. Meanwhile, sprinkle a good pinch of the ras el hanout over the squash seeds, along with a little sea salt.  Spread the seeds out over a large baking tray and bake for 15 minutes until crisp. Heat the butter in a large, heavy-based saucepan over a medium heat.  Add the onions and whole chilli and fry gently for 10 minutes until the onions are soft and beginning to caramelise.  Add the remaining ras el hanout and fry for a further minute, then add the squash, roast garlic flesh (throwing the papery skins away) and stock.  Bring to the boil then simmer for 10 minutes.  Remove from the heat, add the cream, tahini and season to taste. Remove the chilli with tongs and roughly chop.  Blend the soup in a liquidiser until smooth and velvety, adding cooked chilli to taste.  Serve garnished with a sprinkling of feta and the spiced squash seeds."}], "nutrition": {"Energy": "1,636kj 393kcals", "Fat": "26.2g", "Saturated Fat": "12.8g", "Carbohydrate": "31.5g", "Sugars": "17.5g", "Protein": "7.7g", "Salt": "1.8g", "Fibre": "5.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Squash_feta_Soup_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}