{"title": "Steak with Gorgonzola & rosemary garlic fries", "tags": null, "planning": {"prep_time": "PT15 minutes + time for the steak to come up to temperatureM", "cook_time": "PT30M", "total_time": "PT40-45 minutes + time for the steak to come up to temperatureM", "serves": "2"}, "ingredients": [{"item": "2 x No.1 Hereford Beef 30 Day Dry Aged Rump Steaks"}, {"item": "2 large Désirée potatoes, cut into 0.5cm-wide chips"}, {"item": "4 cloves garlic, bashed in their skins"}, {"item": "4 sprigs rosemary, two left whole, two roughly chopped"}, {"item": "2 tbsp cold pressed rapeseed oil"}, {"item": "60g No.1 Gorgonzola DOP Piccante, cut into 2 long slices"}, {"item": "1-2 tbsp French dressing"}, {"item": "½ x 160g pack beetroot salad leaves, or similar seasonal leaves"}], "instructions": [{"step": "Preheat the oven to 220°C, gas mark 7 and line a large baking tray with parchment. Remove the steak from the fridge. Put the potatoes, garlic and whole rosemary sprigs into a pan of cold salted water, then bring to the boil and cook for 3-4 minutes, or until just tender. Drain in a colander, let the potatoes steam and cool for 5 minutes, then scatter over the baking tray – save the garlic for later. Toss with 1 tbsp oil and roast. When approaching 10 minutes’ cooking, start to preheat a griddle pan over a high heat."}, {"step": "Rub each steak with 1 tsp oil and season generously using flaky sea salt and freshly ground black pepper. When the griddle is very hot,"}, {"step": "sear the steaks for 1 minute on each side, and then, using tongs, brown the fat on all the edges for 1 minute too. Transfer to a small roasting tin."}, {"step": "Chop the reserved garlic, toss with the chopped rosemary into the chips (which have by now had 15 minutes roasting) and return to the oven. Then add the steak to the oven on the shelf below. Roast for 5 minutes for medium-rare, or 8 minutes for medium."}, {"step": "Take the steaks from the oven and immediately top each with a slice of cheese. Cover the pan with another tray or some foil and leave to rest while the chips cook for another 5-10 minutes until crisp and golden. Dress the salad, then serve with the chips and garlic, steak and resting juices."}], "nutrition": {"Energy": "3,620kJ 869kcal", "Fat": "57g", "Saturated Fat": "18g", "Carbohydrate": "29g", "Sugars": "3.5g", "Protein": "58g", "Salt": "0.9g", "Fibre": "5.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Steak-Gorgonzola-Rosemary-Garlic-Fries.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}