{"title": "Steamed Marmalade Pudding", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT120M", "total_time": "PT135M", "serves": "4 - 6"}, "ingredients": [{"item": "3 tbsp fine-cut marmalade"}, {"item": "110g self-raising flour"}, {"item": "Pinch of salt"}, {"item": "60g soft white breadcrumbs"}, {"item": "1 tsp baking powder"}, {"item": "85g shredded suet or vegetarian equivalent"}, {"item": "110g caster sugar or vanilla sugar"}, {"item": "1 medium egg"}, {"item": "60g golden syrup"}, {"item": "150-200ml milk"}], "instructions": [{"step": "Grease a 1-litre pudding basin and spoon in the marmalade. In another bowl, mix the flour, salt, breadcrumbs, baking powder, suet and sugar. Make a well and break in the egg. Add the golden syrup and 150ml milk and mix, adding more milk if necessary to give a dropping consistency. Spoon on to the marmalade.  Take a large sheet of greaseproof paper and foil, grease the paper, then fold a pleat in the middle of both. Lay the paper over the pudding, followed by the foil. Tie them in place just under the rim with string long enough to be knotted into a handle over the top. Trim the excess foil and paper. Either steam in a double steamer, or rig up your own: arrange three forks in a large saucepan to form a triangular trivet. Pour 8cm of water into the pan and bring to the boil. Lower the pudding into the water so it sits neatly on the forks. Cover, reduce to a simmer and steam for 2 hours.  Check occasionally and top up with more boiling water from the kettle.  To serve, remove string, foil and paper, run a knife around the edge of the pudding, then invert on to a plate. Give it a good shake, then remove the basin to reveal your gorgeous, moist steamed pudding. Serve with cream."}], "nutrition": {"Energy": "1669.416kJ 399.0kcal", "Fat": "15.3g", "Saturated Fat": "7.5g", "Sugars": "39.7g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0603054-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}