{"title": "Steamed Easter Chocolate Pudding", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT15M", "cook_time": "PT120M", "total_time": "PT135M", "serves": "8"}, "ingredients": [{"item": "Chocolate sauce"}, {"item": "150g Waitrose Cooks’ Ingredients dark chocolate for cooking, broken into chunks"}, {"item": "170g tub double cream"}, {"item": "175 g light brown muscovado sugar"}, {"item": "175g butter, softened"}, {"item": "150 g self-raising flour"}, {"item": "25 g cocoa powder"}, {"item": "1 tsp baking powder"}, {"item": "4 eggs, beaten"}, {"item": "1 tsp instant coffee granules"}, {"item": "1-2 tbsp milk (optional)"}, {"item": "2-3 tbsp Nutella (hazelnut chocolate spread)"}], "instructions": [{"step": "Generously butter a 1.2 litre pudding basin, and line the base with a disc of non-stick baking parchment, then bring a kettle of water to the boil.  Meanwhile, in a large bowl, beat together the sugar and butter, using an electric hand whisk, until pale and fluffy. Sieve the flour, cocoa and baking powder into the butter and sugar mixture, then add the eggs and coffee granules. Whisk for 1-2 minutes until the mixture is smooth and has a soft, spoonable consistency (if it’s too thick, add 1-2 tbsp of milk).  Pour about half the mixture into the basin then spoon the Nutella on top, in the centre. Cover with the remaining cake mixture and level the top. Take a double foil square, about 23cm x 23cm, generously butter one side and make a pleat across the middle (to see how to do this, go to waitrose.com/howto). Place over the basin with the buttered side facing downwards. Fold the edges to seal tightly. Tie in place with kitchen string, to ensure no steam can escape. Make a string handle so that it is easier to lift the hot basin out of the pan.  Put the pudding into a large, deep pan. Pour boiling water from the kettle into the pan to come halfway up the side of the basin. Cover the pan with a lid, return to the boil, then reduce the heat to a gentle simmer. Cook for about 2 hours or until the sponge is firm and well risen. Add more boiling water, when necessary, to make sure the pan doesn’t boil dry.  About 15 minutes before the end of the cooking time, make the sauce: melt the chocolate chunks and place in a heatproof bowl with the cream over a pan of simmering water. Stir occasionally until the chocolate has melted. Remove from the heat and mix.  When the pudding is cooked, remove the basin from the pan and leave it to stand for about 5 minutes. Remove the string and the foil, loosen the edges of the pudding with a round-bladed knife and turn out onto a serving plate. Spoon over some of the chocolate sauce then serve the remainder in a jug and decorate with grated milk chocolate to garnish."}], "nutrition": {"Energy": "2543.872kJ 608.0kcal", "Fat": "41.3g", "Saturated Fat": "23.7g", "Sugars": "39.9g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0903ss10r05.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}