{"title": "Steak Bearnaise", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "2 x 150g rib-eye or sirloin steaks"}, {"item": "½ tbsp olive oil"}, {"item": "1 tbsp unsalted butter"}, {"item": "squeeze lemon juice, to taste"}, {"item": "½ small shallot, finely diced"}, {"item": "2 tbsp dry white wine"}, {"item": "1 tbsp white wine vinegar"}, {"item": "3 tarragon sprigs"}, {"item": "1 egg yolk"}, {"item": "75g unsalted butter, melted and warm"}], "instructions": [{"step": "Start with the béarnaise: put the shallot, wine, vinegar and 1 tarragon sprig in a pan. Bring to the boil; simmer until reduced by ½. Discard the tarragon and transfer the reduction to a heatproof bowl; set aside."}, {"step": "Take the steaks out of the fridge at least 30 minutes before cooking. Heat a heavy frying pan over a high heat until smoking, then add the oil. Season the steaks and place in the pan, pressing down to sear. Cook for 2 minutes (for a steak that is 2cm thick; a little longer if it’s thicker, or less if it’s thinner). Turn the steaks, add the butter to the pan, and cook for another 2 minutes, spooning the butter over the tops of the steaks occasionally. Set aside on a plate and cover loosely with foil while you finish the béarnaise."}, {"step": "Add the egg yolk to the shallot reduction and set over a pan of barely simmering water (the base of the bowl should not touch the water). Add a pinch of salt and whisk together using a balloon whisk for 3-4 minutes, until it doubles in volume."}, {"step": "Take off the heat and pour in the butter, in a slow, constant stream, whisking as you go. Once it’s all incorporated, season with salt, pepper and a squeeze of lemon juice. Chop the remaining tarragon leaves and stir through before serving with the steak."}], "nutrition": {"Energy": "2,980kJ 721kcals", "Fat": "66.7g", "Saturated Fat": "35.5g", "Carbohydrate": "0.4g", "Sugars": "0.3g", "Protein": "29.7g", "Salt": "0.5g", "Fibre": "0.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Steak-Bearnaise-400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}