{"title": "Griddled steak & vegetables with miso", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "1 sirloin steak, about 300g, excess fat trimmed"}, {"item": "2 tsp chilli infused olive oil"}, {"item": "200g broccoli"}, {"item": "200g asparagus tips, trimmed"}, {"item": "4 tsp Clearspring Japanese Organic Brown Rice Miso"}, {"item": "Finely grated zest of 1 unwaxed lime, plus 2 tsp juice"}, {"item": "1 tsp reduced salt soy sauce"}, {"item": "2 tsp clear honey"}, {"item": "2 salad onions, finely chopped"}, {"item": "15g unsalted roasted peanuts, chopped"}], "instructions": [{"step": "Brush the steak on both sides with ½ tsp of the oil and season lightly. Separate the broccoli into large florets, cutting right down through the stalks. Cut the florets in half lengthways. Cook the broccoli in boiling water for 1 minute, add the asparagus and cook for a further 1 minute. Drain."}, {"step": "Combine the miso paste in a small bowl with the lime zest and juice, a further 1 tsp of the chilli oil, the soy sauce, honey and 2 tbsp water."}, {"step": "Brush a ridged griddle pan with the remaining chilli oil and get the pan really hot before adding the steak. Fry for 2 minutes on each side ensuring all cut surfaces are thoroughly cooked (for medium rare), or until done to your liking. Transfer to a board and keep warm. Add the broccoli and asparagus to the pan and cook for 6-8 minutes, turning once until they are lightly charred. Transfer to serving plates. Slice the steak and place on top of the vegetables. Scatter with the salad onions and peanuts, then drizzle with the miso dressing."}], "nutrition": {"Energy": "1,843kJ 440kcals", "Fat": "18g", "Saturated Fat": "5.3g", "Carbohydrate": "11g", "Sugars": "8.1g", "Protein": "55g", "Salt": "1.8g", "Fibre": "5.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Waitrose-Weekend_WK455_Good-Health-Everyday_Steak-Asparagus-Broccoli-Peanut-Miso.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}