{"title": "Steamed sea bream with chilli, lime and lemon grass", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT15M", "cook_time": "PT10M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "1 whole sea bream (400- 600g), scaled and gutted"}, {"item": "1 lemon grass stalk"}, {"item": "2-3 dried kaffir lime leaves"}, {"item": "75ml fresh chicken or vegetable stock (or water)"}, {"item": "1 tsp caster sugar"}, {"item": "7 garlic cloves"}, {"item": "3-6 green or red Thai chillies"}, {"item": "small handful coriander, plus extra to garnish"}, {"item": "40ml fish sauce"}, {"item": "50ml freshly squeezed lime juice (from about 2-3 limes)"}, {"item": "handful celery leaves, from inside a bunch of celery"}], "instructions": [{"step": "Score the fish with 3 equally spaced diagonal slits on each side, cutting almost, but not quite, to the bone. Bruise the lemon grass with a rolling pin and stuff it into the cavity of the fish with the lime leaves."}, {"step": "Put the fish on a plate and place in a steamer (or lidded wok) and fill with water below the plate. Steam for 8-10 minutes, until the flesh comes away from the bone."}, {"step": "Meanwhile, heat the stock (or water) in a pan to the boil, then add the sugar. Boil for a few seconds to completely dissolve the sugar, then take off the heat. Pour into a bowl and set aside."}, {"step": "Use a knife to mince the garlic, chillies and coriander (with the stalks too). Mix into the stock, along with the fish sauce and lime juice. It should taste sour, garlicky, spicy and a little salty with a hint of sweetness."}, {"step": "Carefully transfer the steamed fish to a serving dish (use a lipped one to hold the sauce). Pour over any juices from the steaming plate, then spoon the chilli and garlic sauce all over the fish. Garnish with extra coriander and the celery leaves, and serve with steamed rice, if liked."}], "nutrition": {"Energy": "903kJ 214kcals", "Fat": "5.6g", "Saturated Fat": "0.3g", "Carbohydrate": "7.9g", "Sugars": "4.6g", "Protein": "33g", "Salt": "3.9g", "Fibre": "0.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Waitrose_Harvest_November_1690_2LR.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}