{"title": "Sticky soy-braised beef short ribs", "tags": null, "planning": {"prep_time": "PT20 minutes + restingM", "cook_time": "PTUp to 4 hoursM", "total_time": "PTUp to 4 hours 20 minutes + restingM", "serves": "4"}, "ingredients": [{"item": "1 tbsp vegetable oil"}, {"item": "1kg Waitrose British Beef Short Ribs"}, {"item": "400g Waitrose Shallots, trimmed and halved"}, {"item": "3 garlic cloves, crushed"}, {"item": "30g fresh root ginger, grated"}, {"item": "2 star anise"}, {"item": "3 tbsp dark soy sauce"}, {"item": "500g fresh beef stock"}, {"item": "1 lime, juice"}], "instructions": [{"step": "Heat the oil in a large casserole dish. Season the short ribs and brown over a medium-high heat for 3-4 minutes on all sides (you may need to do this in batches, adding a little more oil); set aside."}, {"step": "Add the shallots to the pan and fry for 5 minutes, until golden and starting to soften. Add the garlic and ginger, then cook for another 2 minutes. Tip in the star anise, soy and stock. Bring to the boil, then reduce to a low simmer, returning the beef ribs to the pan along with any juices."}, {"step": "Cover and simmer for 2-3 hours until the meat is very tender. (At this stage you can either leave the meat on the bone or shred into chunks with 2 forks.) Simmer, uncovered, for another 40-45 minutes, stirring regularly towards the end to prevent it from catching. You should have a rich sauce that coats the beef ribs; if not, reduce a little further. Add lime juice to taste, allow to rest for 15 minutes, then serve with wasabi-spiked mashed potato or sticky rice, if liked."}, {"step": "Put all the ingredients apart from the oil (which you won’t need) and lime juice in a slow cooker. Cover and cook on low for 6-8 hours, or medium for 4-6 hours, until the meat is really tender. Set the ribs aside to rest, then pour the braising liquid into a pan and reduce over a high heat until syrupy. Add lime juice to taste; pour over the ribs to serve."}], "nutrition": {"Energy": "2,129kJ 510kcals", "Fat": "30.4g", "Saturated Fat": "12g", "Carbohydrate": "5.3g", "Sugars": "4.1g", "Protein": "51g", "Salt": "2.4g", "Fibre": "4.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sticky-soy-beef-glazed-ribs-MAIN-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}