{"title": "Sticky ginger and pear pudding", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT10M", "cook_time": "PT60M", "total_time": "PT70M", "serves": "4"}, "ingredients": [{"item": "50g butter, softened, plus a generous amount extra for greasing"}, {"item": "2½ tbsp demerara sugar"}, {"item": "3 pieces (about 50g) Chinese stem ginger in syrup, drained and"}, {"item": "4 tbsp syrup reserved"}, {"item": "75g self raising flour"}, {"item": "¼ tsp baking powder"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "1 tsp Barts Ground Ginger"}, {"item": "½ tsp Barts Mixed Spice"}, {"item": "¼ tsp Barts Ground Nutmeg"}, {"item": "1 Waitrose British Blacktail Free Range Large Egg"}, {"item": "50g dark muscovado sugar"}, {"item": "2 tbsp milk"}, {"item": "2 ripe Conference pears"}], "instructions": [{"step": "Preheat the oven to 180ºC, gas mark 4. Grease a small (about 1-1.2 litre) ovenproof pudding basin with the butter. Dust the insides of the basin with the demerara sugar, turning the basin to evenly coat it. Finely chop the stem ginger."}, {"step": "Sift the flour into a large mixing bowl. Add the baking powder, bicarbonate of soda and spices and stir. Add the egg, butter and muscovado sugar and mix with an electric whisk until combined. Stir in the chopped ginger and milk."}, {"step": "Working as quickly as possible, peel, core and halve the pears then place them broad-ends down and round-sides facing out around the inside of the basin. Spoon the sponge mixture into the basin – don’t worry if it doesn’t cover the tops of the pears. Cover with a piece of baking parchment and a large piece of foil and seal the edges. Place in a roasting tin and pour in boiling water to half fill the tin."}, {"step": "Place into the oven and bake for 1 hour, until springy to the touch. Remove from the oven and leave to rest for 5 minutes. Trim the ends from any pears that are sticking up before turning the pudding out onto a serving plate. Serve with the reserved ginger syrup and cream."}], "nutrition": {"Energy": "1820.04kJ 435kcals", "Fat": "14.7g", "Saturated Fat": "8.4g", "Carbohydrate": "71.2g", "Sugars": "57g", "Salt": "0.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/2013wked-December-r3gingerpud.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}