{"title": "Sticky prune chocolate cake", "tags": null, "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT65M", "total_time": "PT1 hour 35 minutes, plus coolingM", "serves": "12"}, "ingredients": [{"item": "250g unsalted butter, cut into pieces, plus extra for greasing"}, {"item": "200g soft pitted prunes, roughly chopped"}, {"item": "50ml armagnac (or brandy)"}, {"item": "1 tbsp vanilla extract"}, {"item": "250g dark chocolate (70% cocoa)"}, {"item": "5 eggs"}, {"item": "250g golden caster sugar"}, {"item": "½ tsp fine sea salt"}, {"item": "Frosting"}, {"item": "100g dark chocolate (70% cocoa)"}, {"item": "2 tbsp cocoa powder"}, {"item": "100g full fat soft cheese"}, {"item": "50g unsalted butter, at room temperature"}], "instructions": [{"step": "Preheat the oven to 170°C, gas mark 3. Grease and line the base and sides of a deep 20cm springform or loose-bottomed cake tin with baking parchment. Wrap the outside of the tin in a double layer of foil and find a roasting dish large and deep enough to accommodate the tin."}, {"step": "Put the prunes in a shallow dish and cover with the armagnac (or brandy) and vanilla extract. Set aside until needed (or store in a sterilised, airtight container in the fridge for up to one month; the longer they soak, the better the flavour)."}, {"step": "Melt the butter and chocolate together in a heatproof bowl set over a pan of barely simmering water. Stir to combine, then set aside to cool slightly. In another bowl, use electric beaters to whisk the eggs, sugar and salt until pale, fluffy and doubled in volume."}, {"step": "Fold the melted chocolate and butter into the eggs, followed by the prunes and their juices. Pour into the prepared cake tin, place in the roasting tray and set on the oven shelf. Carefully pour boiling water from the kettle into the roasting tray until it reaches halfway up the sides of the cake tin. Bake for about 55 minutes, until set but still with a slight wobble in the centre. Transfer the cake from the water bath to a wire rack, removing and discarding the foil. Leave to cool completely in the tin, for about 4 hours."}, {"step": "For the frosting, melt the chocolate in a heatproof bowl set over a pan of barely simmering water. In a food processor, pulse the remaining ingredients until combined. Add 1 /3 of the mixture to the melted chocolate and whisk together. Return everything to the food processor and blitz until you have a smooth, spreadable frosting."}, {"step": "Once the cake has cooled, remove from the tin and place on a serving plate or stand (if it’s difficult to move, only remove the sides of the tin and leave the base on). Loosely spread the frosting over the top before serving. The cake can be refrigerated in an airtight container for up to 3 days"}], "nutrition": {"Energy": "2,174Kj 523Kcal", "Fat": "37.9g", "Saturated Fat": "22.9g", "Carbohydrate": "38.3g", "Sugars": "36g", "Protein": "7.1g", "Salt": "0.4g", "Fibre": "2.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Sticky_prune_choc_cake_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}