{"title": "Strawberry and rose layer cake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT1 hour, plus cooling and chillingM", "cook_time": "PT30M", "total_time": "PT1 hour 30 minutes, plus cooling and chillingM", "serves": "10-12"}, "ingredients": [{"item": "175g unsalted butter, softened, plus extra for greasing"}, {"item": "225g caster sugar"}, {"item": "4 eggs"}, {"item": "1 tsp vanilla extract"}, {"item": "275g plain flour"}, {"item": "2 tsp baking powder"}, {"item": "½ tsp bicarbonate of soda"}, {"item": "75g buttermilk or soured cream, at room temperature"}, {"item": "250g strawberries, halved (225g hulled weight)"}, {"item": "1 tsp lemon juice"}, {"item": "2 tsp caster sugar"}, {"item": "½ tsp vanilla extract"}, {"item": "175g caster sugar, plus 1 tbsp extra"}, {"item": "3 egg whites"}, {"item": "1 tsp vanilla extract"}, {"item": "250g unsalted butter, at room temperature"}, {"item": "¼-½ tsp rose water"}, {"item": "300g strawberries, 200g sliced and 100g left whole"}, {"item": "Waitrose Cooks’ Ingredients dried rose petals"}, {"item": "2 tbsp Waitrose Cooks’ Homebaking freeze-dried strawberry pieces"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4; grease 3 x 18cm cake tins and line the bases with parchment. For the cake, cream the butter and sugar until pale and fluffy – about 3 minutes in a freestanding mixer or with electric beaters. Beat in the eggs one at a time, then the vanilla. Sift and fold in the fl our, baking powder, bicarbonate of soda with a pinch of salt. Add the buttermilk or soured cream and mix to a smooth batter. Divide between the tins, level using the back of a spoon and bake on the middle shelf for 20 minutes until risen, golden and a skewer inserted into the middle of the cakes comes out clean. Cool in the tins for 5 minutes, then turn out onto a wire rack to cool completely."}, {"step": "For the purée, warm all the ingredients in a pan set over a low heat until the juice starts to run from the berries. Cook for another 3-4 minutes, until the mixture is thick and jammy. Remove from the heat and push the fruit through a sieve to remove the seeds; set aside to cool completely."}, {"step": "For the buttercream, put the sugar, egg whites, vanilla, 2 tbsp water and a pinch of salt into a large (2 litre), heatproof mixing bowl. Set the bowl over a pan of simmering water – making sure the base doesn’t touch the water – and whisk constantly, using electric beaters, for about 5 minutes, until the sugar has dissolved and the meringue has doubled in volume, is stiff enough to hold a firm ribbon trail and is hot to the touch."}, {"step": "Scoop the meringue into the bowl of a freestanding mixer or another large bowl. Whisk until cool, then gradually beat in the butter, 1 tbsp at a time, thoroughly incorporating each spoonful before adding the next. If it looks a little curdled, continue to whisk or add a splash of hot water and it should come together. Mix in the rose water and strawberry purée."}, {"step": "To assemble, lay a cake on a serving plate, spread with 4 heaped tbsp buttercream and top with ½ the sliced strawberries. Top with another cake, more buttercream and strawberries, then the final cake. Cover the sides and top with buttercream and decorate with the whole strawberries, rose petals and freeze-dried strawberry pieces. Chill for 30 minutes before serving."}, {"step": "If the icing starts to curdle, a splash of hot water should help bring it back together."}], "nutrition": {"Energy": "Per serving (12) 2779kJ 668kcals", "Fat": "45g", "Saturated Fat": "27g", "Carbohydrate": "57g", "Sugars": "40g", "Protein": "6.7g", "Salt": "0.7g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Strawberry-and-rose-layer-cake.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}