{"title": "Strawberry and white chocolate cheesecake", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25M", "cook_time": "PT5M", "total_time": "PT30M", "serves": "10"}, "ingredients": [{"item": "175g Biscoff Caramelised Biscuits"}, {"item": "100g unsalted butter, melted"}, {"item": "400g strawberries, hulled"}, {"item": "200g bar Waitrose Belgian White Chocolate, broken into squares"}, {"item": "2 x 200g packs essential Waitrose Creamy Soft Cheese"}, {"item": "25g caster sugar"}, {"item": "170ml double cream"}, {"item": "Few mint leaves, to decorate"}], "instructions": [{"step": "Put the biscuits in a large plastic food bag and crush with a rolling pin until finely ground. Transfer to a bowl and stir in the butter. Tip into a 20cm loose-based round cake tin with a depth of about 4cm. Use the back of a teaspoon to pack the mixture in a thin layer around the sides of the tin then press the remainder over the base."}, {"step": "Halve 250g of the strawberries and arrange over the biscuit base, cut sides face down. Chill while preparing the filling."}, {"step": "Melt the chocolate in a heatproof bowl, either over a pan of hot water (making sure the base doesn't touch the water) or in the microwave in short spurts. Stir frequently so the chocolate melts evenly. Beat the soft cheese in a separate bowl with the sugar and 2 tbsp boiling water until smooth. Beat in the chocolate and 4 tbsp of the cream. Spoon into the tin and spread in an even layer."}, {"step": "Whisk the remaining cream until just holding its shape then spread it over the filling. Halve the remaining strawberries (or slice if large) and scatter over the cream. Chill for at least 3 hours before removing from the tin. Serve scattered with fresh mint leaves."}], "nutrition": {"Energy": "2,043kj/492kcals", "Fat": "38.5g", "Saturated Fat": "23.8g", "Carbohydrate": "31g", "Sugars": "24.9g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/strawberry_choc_cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}