{"title": "Strawberry and rose water vanilla sponge", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT40 minutes, plus cooling timeM", "total_time": "PT1 hour, plus cooling timeM", "serves": "10"}, "ingredients": [{"item": "220g unsalted butter, softened"}, {"item": "4 medium eggs"}, {"item": "200g Cooks’ Ingredients Fairtrade vanilla sugar"}, {"item": "220g self-raising flour, sifted"}, {"item": "150ml double cream"}, {"item": "1 tbsp icing sugar, plus extra for dusting"}, {"item": "150g essential Waitrose greek-style natural yogurt"}, {"item": "400g essential Waitrose strawberries, hulled and sliced"}, {"item": "150g essential Waitrose strawberries, hulled"}, {"item": "1½ tbsp icing sugar"}, {"item": "2 tbsp fresh orange juice"}, {"item": "1 tsp rose water"}], "instructions": [{"step": "Preheat the oven to 180C, gas mark 4. Grease a 20cm spring-form cake tin and line the base with baking parchment  In a large bowl, beat the butter and sugar with an electric hand whisk until pale and fluffy. Add the eggs, 1 at a time, beating well after each addition. Using a large metal spoon, gently fold in the flour until just combined. The mixture should drop off the end of the spoon when tapped – just add a little milk if it’s too thick.  Spoon the mixture into the prepared cake tin, level the top with the back of the spoon and bake for 40 minutes, or until springy to the touch. Allow the cake to stand for 5 minutes, then remove from the tin and cool on a wire rack. Peel off and discard the baking parchment, then cut the cake in half horizontally.  To make the strawberry sauce, simply blitz all the ingredients in a blender until smooth  Whip the cream until it forms soft peaks, then sift in the sugar. Fold in the yogurt and spread the mixture on the bottom cake; scatter over two-thirds of the strawberry slices. Press on the top layer of the cake, then dust with icing sugar and top with the remaining strawberry slices. Pour the strawberry sauce over the cake."}], "nutrition": {"Energy": "1953.928kJ 467.0kcal", "Fat": "30.0g", "Saturated Fat": "18.0g", "Sugars": "46.0g", "Salt": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/201006WKED43r01.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}