{"title": "Strawberry, basil and mascarpone tart", "tags": null, "planning": {"prep_time": "PT25 minutes, plus chilling and coolingM", "cook_time": "PT35M", "total_time": "PT1 hour, plus chilling and coolingM", "serves": "10"}, "ingredients": [{"item": "½ x 25g pack Cooks’ Ingredients Basil (leaves and stalks), plus extra small leaves to serve"}, {"item": "400g strawberries, hulled and halved"}, {"item": "2 tbsp granulated sugar"}, {"item": "½ lemon, juice"}, {"item": "250g mascarpone"}, {"item": "170ml whipping cream"}, {"item": "2 tbsp icing sugar, sifted"}, {"item": "1 tsp vanilla extract"}, {"item": "200g plain flour"}, {"item": "3 tbsp caster sugar"}, {"item": "1 Cooks’ Ingredients Unwaxed Lemon, zest of all, 1 tbsp juice"}, {"item": "110g unsalted butter, diced and chilled"}, {"item": "1 large egg yolk"}], "instructions": [{"step": "For the pastry, tip the flour, sugar, lemon zest, butter and a pinch of salt into a food processor. Pulse until the mixture resembles coarse breadcrumbs. Add the egg yolk, lemon juice and 2 tbsp very cold water (see Tip, right). Pulse until the dough starts to come together. Tip onto a work surface and use your hands to shape into a ball. Wrap in cling film and chill for about 1 hour, until firm."}, {"step": "Meanwhile, scrunch the basil in your hand and add to a large bowl with the strawberries, granulated sugar and lemon juice. Mix together then set aside to macerate for 2 hours, stirring occasionally. Strain the strawberries in a sieve over a small pan and discard the basil; set the fruit aside. Heat the juices in the pan until reduced to a thin syrup; set aside to cool."}, {"step": "On a lightly floured worktop, roll out the pastry and use to line a 23cm fluted tart tin. Chill for 30 minutes. Preheat the oven to 180˚C, gas mark 4 and put a baking sheet in to heat up. Prick the base of the chilled pastry case with a fork, then line the tin with baking parchment and fill with baking beans. Blind bake for 20 minutes. Remove the paper and beans, and bake for a further 10-12 minutes until dry and golden. Put on a wire rack to cool completely."}, {"step": "For the filling, put the mascarpone, whipping cream, icing sugar and vanilla in a large bowl and use a balloon whisk to mix until well combined and thick enough to hold soft peaks. Spoon the mascarpone mixture into the pastry case, then use a palette knife to smooth it out to an even layer. Spoon the strawberries onto the tart then scatter over some extra small basil leaves. Drizzle with the cooled strawberry and basil syrup to serve."}], "nutrition": {"Energy": "1,607kJ 393kcals", "Fat": "28.1g", "Saturated Fat": "17.7g", "Carbohydrate": "29.9g", "Sugars": "14.5g", "Protein": "4.1g", "Salt": "0.16g", "Fibre": "2.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/Strawberry-and-mascarpone-tart.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}