{"title": "Summer pudding almond slice", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT25 minutes + coolingM", "cook_time": "PT45M", "total_time": "PT70 minutes + coolingM", "serves": "12"}, "ingredients": [{"item": "215g sheet Cooks’ Ingredients Frozen All Butter Shortcrust Pastry, defrosted"}, {"item": "150g butter, softened"}, {"item": "110g caster sugar"}, {"item": "3 British Blacktail Large Free Range Eggs"}, {"item": "150g ground almonds"}, {"item": "40g plain flour"}, {"item": "2 tbsp raspberry jam"}, {"item": "300g pack Waitrose Duchy Organic Frozen Berry Mix, defrosted and drained"}, {"item": "1 tbsp demerara sugar"}], "instructions": [{"step": "Grease a shallow-sided 20cm square cake tin and line with baking parchment so that it stands 3cm proud of the tin."}, {"step": "Unroll the pastry on a work surface. Place the tin on the pastry (making sure the base is clean). Using a small sharp knife, cut around the base adding an extra 1cm all the way round. Place the pastry in the tin, gently pressing it into the base (the edges will come up slightly around the sides). Place in the fridge. Preheat the oven to 200°C, gas mark 6."}, {"step": "In a bowl, whisk together the butter, caster sugar, eggs, ground almonds and flour."}, {"step": "Using the back of a spoon, spread the jam over the chilled pastry base and spread two-thirds of the almond mixture on top of that. Arrange the fruit on top, then blob on the remaining almond mixture and spread it out (it doesn’t matter if you slightly squash the fruit). Sprinkle over the demerara sugar."}, {"step": "Place the tin on a baking tray and bake for 45 minutes. Cool before lifting out of the tin with the parchment paper. Remove the paper and use a large sharp knife to cut into 12 slices."}], "nutrition": {"Energy": "1,445kJ 347kcals", "Fat": "23g", "Saturated Fat": "10g", "Carbohydrate": "26g", "Sugars": "16g", "Protein": "7.1g", "Salt": "0.4g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/WaitroseWeekend_D2_AlmondSlice.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}