{"title": "Summer berry tarts", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT20 plus cooling and chillingM", "cook_time": "PT20M", "total_time": "PT35 minutes- 40 minutes plus cooling and chillingM", "serves": "8"}, "ingredients": [{"item": "1½ x 375g packs Jus-Rol Sweet Shortcrust Pastry"}, {"item": "400g strawberries, hulled"}, {"item": "150g raspberries"}, {"item": "150g blueberries"}, {"item": "2 tbsp apricot jam"}, {"item": "3 medium British Blacktail Free Range Egg Yolks"}, {"item": "1½ tbsp golden caster sugar"}, {"item": "1½ tbsp cornflour"}, {"item": "350ml whole milk"}, {"item": "1 vanilla pod, split and seeds scraped"}, {"item": "250g tub mascarpone"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Make the crème pâtissière by whisking together the egg yolks, sugar and cornflour in a heatproof bowl. Pour the milk into a saucepan, add the vanilla pod and seeds and bring to a simmer. Remove from the heat, strain through a sieve onto the egg mixture and whisk to combine. Return to the pan and set over a medium heat. Bring to the boil and cook for 2 minutes, whisking constantly. Transfer to a bowl, press a sheet of clingfilm onto the surface (to prevent a skin from forming) and leave to cool."}, {"step": "Roll out the pastry and cut 8 x 17cm circles. Use these to line 8 x 12cm loose-bottomed flan cases. Line with baking parchment and baking beans and bake blind for 10 minutes. Remove the paper and beans and bake for 5-7 minutes more until golden. Leave to cool."}, {"step": "Once the crème pâtissière has cooled completely, beat in the mascarpone then spoon or pipe the mixture into the pastry cases and top with the berries."}, {"step": "Heat the jam in a small saucepan with 2 tbsp water. Pass through a sieve then use a pastry brush to paint the glaze onto the fruit. Transfer to the fridge to chill for 1 hour before serving."}], "nutrition": {"Energy": "2,487kJ/596kcals", "Fat": "37.5g", "Saturated Fat": "19.9g", "Carbohydrate": "55.5g", "Sugars": "24.7g", "Salt": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/summerberrytarts_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}