{"title": "Super sticky cinnamon and pecan buns", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes plus rising M", "cook_time": "PT30M", "total_time": "PT1 hour, plus rising M", "serves": "9"}, "ingredients": [{"item": "500g strong white bread flour"}, {"item": "1 tsp salt"}, {"item": "7g sachet dried yeast"}, {"item": "275ml milk"}, {"item": "40g butter plus extra to grease tin"}, {"item": "1 medium Waitrose British Blacktail Free Range Egg"}, {"item": "For the filling"}, {"item": "100g pecan nuts"}, {"item": "100g very soft unsalted butter"}, {"item": "200g dark brown sugar"}, {"item": "1 tbsp ground cinnamon"}, {"item": "1 tbsp cornflour"}, {"item": "To top"}, {"item": "½ tbsp cinnamon"}, {"item": "1 tbsp granulated sugar"}, {"item": "100ml maple syrup"}], "instructions": [{"step": "Preheat oven to 180ºC, gas mark 4. Grease well and line a 22cm square fixed base tin with baking parchment. Place the pecans on a tray and toast in the oven for 6-7 minutes, remove and cool, before chopping finely."}, {"step": "Put the flour and salt in a large mixing bowl, stir until thoroughly combined, make a well in the centre and tip in the yeast."}, {"step": "Warm the milk and butter in a small saucepan, until the butter is melted and the mixture is lukewarm. Pour into the flour mixture, add the egg and stir thoroughly until the contents of the bowl come together as a soft dough. Tip the dough onto a lightly floured work surface and knead well for about 5 minutes, until the dough is smooth and elastic. Place the dough into an oiled bowl and leave to rise, covered with a damp tea towel, for 1 hour or until doubled in size. Tip the dough out onto a lightly floured work surface. Roll out the dough into a rectangle about 40x20cm, spread over the soft butter."}, {"step": "Mix the chopped pecans with the dark brown sugar, cinnamon and the cornflour, and sprinkle evenly over the dough rectangle. Roll the long side of the dough towards you quite tightly into a swiss roll shape. With a sharp knife cut into nine approximately 4cm thick rounds."}, {"step": "Place the buns, cut side up, into the greased tin leaving about 1cm between each one. You want them to be close enough so that when they rise further during baking, their sides will touch. They can then be pulled apart and you get a lovely soft edge. Leave to rise for about 30 minutes in a warm place."}, {"step": "When the buns are risen again, sprinkle with the cinnamon and granulated sugar and bake for 20-25 minutes until golden. Check after 15 minutes and cover the buns with foil if they are getting too brown. Remove from the oven and drizzle with the maple syrup while still in the tin. Then separate and flip them over so they are coated in the juices. Serve warm."}], "nutrition": {"Energy": "2,327kj/554kcals", "Fat": "22.7g", "Saturated Fat": "9.6g", "Carbohydrate": "77.8g", "Sugars": "34.4g", "Salt": "0.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/2014wked-January-r8pecanbuns.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}