{"title": "Sushi with tempura vegetables", "tags": null, "planning": {"prep_time": "PT30 minutes, plus soaking  and standingM", "cook_time": "PT40M", "total_time": "PT1 hour 10 minutes, plus soaking and standingM", "serves": "8"}, "ingredients": [{"item": "500g sushi rice"}, {"item": "6 tbsp rice wine vinegar"}, {"item": "2 tsp caster sugar"}, {"item": "1 tsp table salt"}, {"item": "1 litre sunflower or vegetable oil"}, {"item": "100g cornflour"}, {"item": "100g self-raising flour"}, {"item": "250ml sparkling water"}, {"item": "220g pack Tenderstem or 230g pack Purple Sprouting Broccoli Spears, halved lengthways"}, {"item": "1 red pepper, deseeded and sliced into thin strips"}, {"item": "1 courgette, sliced into thin batons"}, {"item": "5 salad onions, finely sliced"}, {"item": "6 tbsp light soy sauce"}, {"item": "To serve"}, {"item": "8 sheets sushi nori"}, {"item": "4 tbsp LOVE Life Sesame Seeds, toasted"}], "instructions": [{"step": "Place the rice in a sieve and wash under cold running water. Tip into a medium saucepan, cover with 425ml cold water and leave to soak for 10 minutes. Bring to the boil over a high heat, cover, reduce the heat to low and leave to cook for 10 minutes. Remove from the heat and leave to stand for a further 10 minutes, until tender and cooled slightly."}, {"step": "Meanwhile, mix together 4 tbsp of the rice wine vinegar, the sugar and salt until they dissolve. Add to the warm rice, mix well and season again to taste. Cover and set aside."}, {"step": "Pour the oil into a large, deep saucepan and heat to 170°C, or until a cube of bread turns golden within 30 seconds. Meanwhile, tip both flours and a pinch of salt into a large bowl and gradually whisk in the sparkling water. Add the vegetables and mix gently to coat."}, {"step": "Drop clumps of coated vegetables into the hot oil using tongs. The batter will keep the vegetables together. Do this in batches to make 16 pieces of tempura, cooking each one for 2–3 minutes until golden. Drain on kitchen paper and keep warm while you cook the rest."}, {"step": "When ready to serve, mix together the remaining rice wine vinegar with the light soy sauce and pour into a dipping bowl. To assemble, spread a 1cm-thick layer of rice onto a nori sheet, leaving a 2cm border along one edge (if you have one, first place the nori sheet on a bamboo sushi mat to help with rolling up when filled). Sprinkle the rice with a few toasted sesame seeds and arrange 2 pieces of tempura along the centre. Carefully pick up the long edge closest to you and roll it over the tempura. Roll into a tight cylinder and wet the border with a little cold water to seal. Slice into pieces. Repeat with the remaining ingredients. Serve with the dipping sauce."}], "nutrition": {"Energy": "1,717kj 407kcals", "Fat": "10.3g", "Saturated Fat": "1.5g", "Carbohydrate": "69.4g", "Sugars": "5g", "Protein": "9.2g", "Salt": "2.8g", "Fibre": "10.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/TV/SISH2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}