{"title": "Sussex Pond Pudding", "tags": null, "planning": {"prep_time": "PT25M", "cook_time": "PT240M", "total_time": "PT265M", "serves": "6 - 8"}, "ingredients": [{"item": "250g self-raising flour"}, {"item": "125g shredded beef suet or vegetable suet"}, {"item": "150ml whole milk"}, {"item": "250g unsalted butter, softened"}, {"item": "200g soft light brown sugar"}, {"item": "1 large unwaxed lemon"}, {"item": "clotted cream or double cream, to serve"}], "instructions": [{"step": "Mix the flour and suet together in a bowl. Pour in the milk and mix to a dough that is soft but firm enough to roll into a 35cm circle. Cut a quarter out of the circle and set aside – this will become the lid. Butter a 1.5 litre pudding basin and line it with the ¾ circle of pastry, flattening it at the bottom, and joining the edges where the slice was taken out.  Lightly mix the butter and sugar together and press it into the lined basin. Prick the lemon all over with a fork or skewer so that the juices can escape, then push it into the butter mixture. Form the remaining pastry into a ball, then roll it out into a circle to fit the top of the pudding bowl. Lay it over the filling and press the edges of the dough together to seal. Take a piece of foil big enough to fit over the basin, with at least an extra 5cm all round. Make a pleat down the middle of the foil, place it over the top of the basin and tie it tightly with string, making a handle so it can be lifted easily.  Bring a large pan half-filled with water to the boil and lower in the pudding. Cover and simmer for 4 hours. Don't let the water stop boiling, and if the level drops, lift up the basin and top up the pan with more boiling water.  To serve, lift out, remove the foil and loosen the sides of the pudding with a sharp knife. (With the foil lid on, it will keep hot for another hour or so until it's needed.) Put a deep dish over the basin and quickly turn the whole thing upside down. Serve each person a slice with a spoonful of clotted or double cream."}], "nutrition": {"Energy": "2577.344kJ 616.0kcal", "Fat": "45.7g", "Saturated Fat": "28.6g", "Sugars": "26.7g", "Salt": "0.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/0703054-r06.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}