{"title": "Tandoori salmon & cavolo nero kedgeree", "tags": null, "planning": {"prep_time": "PT10M", "cook_time": "PT25M", "total_time": "PT35M", "serves": "4"}, "ingredients": [{"item": "2 tbsp low fat Greek style yogurt, plus extra to serve"}, {"item": "2 tsp tomato purée"}, {"item": "15g (½ pack) Geeta’s Tandoori Spice Mix"}, {"item": "1 unwaxed lemon, zest of all, juice of ½, ½ cut into wedges"}, {"item": "240g pack lightly smoked salmon fillets"}, {"item": "2 tsp sunflower oil"}, {"item": "1 onion, roughly chopped"}, {"item": "2 medium British Blacktail Free Range Eggs"}, {"item": "300g cavolo nero, leaves roughly shredded"}, {"item": "350g pack chilled Waitrose & Partners Pilau Rice"}, {"item": "2 tbsp Geeta’s Premium Mango Chutney, plus extra to serve"}], "instructions": [{"step": "Preheat the grill to medium. Line a medium baking dish with foil. In a bowl, mix the yogurt, tomato purée, tandoori mix and lemon juice. Add the salmon and coat well. Put the salmon skin-side down in the baking dish then spoon over the excess marinade. Grill for 10-15 minutes, until the salmon is cooked and the marinade starting to char."}, {"step": "Meanwhile, heat the oil in a wide, non-stick frying pan, then add the onion. Cook over a medium heat for 10 minutes until soft and turning golden. Put the eggs in a small pan of boiling water; cook for 6 minutes. Cool under cold water then peel."}, {"step": "Stir the cavolo nero into the onion, season and cook for 2 minutes, stirring often, until wilted. Fold in the rice and lemon zest. Mix the chutney with 2 tbsp water and add to the pan; let the rice heat through, stirring often (about 3 minutes). Flake in the tandoori salmon (discard the skin), and top with the halved eggs. Serve with more chutney and yogurt, if liked, plus lemon wedges to squeeze over."}], "nutrition": {"Energy": "1,508kJ 361kcals", "Fat": "14g", "Saturated Fat": "2.7g", "Carbohydrate": "32.3g", "Sugars": "4.9g", "Protein": "24.6g", "Salt": "1.23g", "Fibre": "3.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Tandoori-salmon-kedgeree.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}