{"title": "Tandoori paneer roti wraps", "tags": null, "planning": {"prep_time": "PT20 minutes, plus restingM", "cook_time": "PT20M", "total_time": "PT40 minutes, plus restingM", "serves": "4"}, "ingredients": [{"item": "150g plain flour (or 75g plain and 75g wholemeal), plus extra to dust"}, {"item": "2 tbsp essential olive oil"}, {"item": "226g pack paneer, cut into 8 x 2cm-thick sticks"}, {"item": "2 green peppers, sliced"}, {"item": "3 tbsp Cooks’ Ingredients tandoori paste"}, {"item": "10g fresh coriander, stalks finely chopped, leaves roughly chopped"}, {"item": "1 red chilli, deseeded and chopped"}, {"item": "100g natural yogurt"}, {"item": "sliced cucumber, lettuce and lemon wedges, to serve"}], "instructions": [{"step": "Put 90ml boiling water in a mug; set aside to cool. Put the flour and a pinch of salt in a bowl, then drizzle in 1 tbsp oil and rub it in. Add the lukewarm water a little at a time, until it comes together to a soft dough (you may not need it all). Knead the dough on a lightly floured surface for 5 minutes then form into a ball and set aside to rest under a bowl for 15 minutes."}, {"step": "Meanwhile, coat the paneer and peppers in the tandoori paste with the remaining 1 tbsp oil and a pinch of salt. Stir the coriander stalks, ½ the coriander leaves and ½ the chilli into the yogurt. Heat a griddle pan over a high heat. Add the pepper slices, skin-side down, and cook for 4-5 minutes until blistered. Turn the peppers and push to the edges of the pan. Add the paneer and cook for 2 minutes each side until charred."}, {"step": "Divide the dough into 4 balls. On a lightly floured surface, roll each into a 20cm circle, keeping the unrolled dough under the bowl. Cover with a tea towel. Heat a heavy-based frying pan over a high heat. Dust off any excess flour, then cook the roti one at a time, for 1 minute on each side. Keep warm under a tea towel. To serve, top each roti with the yogurt mixture, peppers and paneer, then sprinkle with the remaining chilli and coriander. Roll up with sliced cucumber and lettuce, and serve with lemon wedges."}], "nutrition": {"Energy": "1,968kJ 471kcals", "Fat": "25g", "Saturated Fat": "12g", "Carbohydrate": "39g", "Sugars": "8.5g", "Protein": "19g", "Salt": "0.8g", "Fibre": "6.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/tandoori-wraps.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}