{"title": "Tear & share breakfast bread", "tags": null, "planning": {"prep_time": "PT15 minutes + provingM", "cook_time": "PT25M", "total_time": "PT35 to 40 minutes + provingM", "serves": "12"}, "ingredients": [{"item": "500g pack white bread mix"}, {"item": "1 tbsp olive oil, plus extra for oiling"}, {"item": "6 rashers smoked streaky bacon, cut into 2cm strips"}, {"item": "2 red onions, finely sliced"}, {"item": "100g mature Cheddar cheese, coarsely grated"}, {"item": "200g cherry tomatoes"}], "instructions": [{"step": "Make up the bread mix according to the pack instructions. After kneading, shape into a ball and place in an oiled bowl and cover with clingfilm. Leave to rise in a warm place for about 1 hour or until doubled in size."}, {"step": "Meanwhile, lightly oil a 23cm square baking tin. Heat 1 tbsp oil in a frying pan, add the bacon pieces and cook for 2 minutes, then add the onions and continue to cook for a further 5-6 minutes until softened. Set aside to cool."}, {"step": "Give the risen dough another knead for just 30 seconds, then cut into 12 even-sized pieces. Roll out each piece of dough into a 10cm round. Spoon a heaped teaspoon of the bacon and onion mixture in the centre along with a pinch of grated cheese (save a handful of the cheese to sprinkle on top at the end). Bring the edges of the dough to the centre to cover the filling and gently pinch the edges together to seal, then roll into an even ball. Place in the prepared tin seal side down. Repeat with the remaining pieces of dough."}, {"step": "Add the cherry tomatoes to the tin, pushing them in between the rolls on the top. Leave to prove for a further 20 minutes until the bread rolls have risen and have all joined up. Meanwhile, preheat the oven to 200°C, gas mark 6. Sprinkle the top of the bread with the remaining cheese and bake for 20–25 minutes until risen, golden and cooked through. Leave to cool for 15 minutes before serving warm or cold."}], "nutrition": {"Energy": "1,604kJ 382kcals", "Fat": "14.4g", "Saturated Fat": "5.8g", "Carbohydrate": "43g", "Sugars": "4.8g", "Protein": "17.5g", "Salt": "1.8g", "Fibre": "3.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Tear-&-Share-Bread_181336.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}