{"title": "Teriyaki chicken sushi hand rolls", "tags": null, "planning": {"prep_time": "PT20 minutes, plus marinating and coolingM", "cook_time": "PT30M", "total_time": "PT50 minutes, plus marinating and coolingM", "serves": "8 rolls"}, "ingredients": [{"item": "6 skinless chicken thigh fillets"}, {"item": "5 tbsp teriyaki sauce"}, {"item": "125g sushi rice, rinsed"}, {"item": "2 tbsp sushi rice vinegar"}, {"item": "4 sheets nori"}, {"item": "1 Waitrose & Partners Extra Large Perfectly Ripe Avocado, halved and sliced into long strips"}, {"item": "3 salad onions, halved and sliced into long strips"}, {"item": "1 tsp toasted white or Cooks’ Ingredients Black Sesame Seeds, or a mix of both"}], "instructions": [{"step": "Marinate the chicken in the teriyaki sauce for at least 30 minutes (up to 24 hours). Put the rice in a pan and cook according to pack instructions. Take off the heat, set aside and cover for 10 minutes. Uncover, stir in the vinegar and cool to room temperature (or chill until ready to use)."}, {"step": "Preheat the grill to high. Put the chicken on a foil-lined baking sheet and pour over any excess marinade. Grill for 15 minutes, turning and basting every 5 minutes, until cooked through, the juices run clear and there is no pink meat. The fillets should be coated in a sticky sauce; set them aside to cool slightly (or chill until ready to use)."}, {"step": "To assemble, halve the nori sheets (to make 8 strips, each roughly 10cm x 20cm). Spread 1/8 of the sushi rice (about 50g) on the left half of one strip and arrange some sliced teriyaki chicken, avocado and salad onion on top. Sprinkle with a few sesame seeds, then roll up into a cone. Lightly wet the edge of the nori so it sticks together. Repeat to make 8 hand rolls. Serve with soy sauce and wasabi paste for dipping, if liked."}], "nutrition": {"Energy": "Per serving (2 rolls) 1407kJ 337kcals", "Fat": "10g", "Saturated Fat": "2.3g", "Carbohydrate": "32.7g", "Sugars": "7.7g", "Protein": "27.9g", "Salt": "2.75g", "Fibre": "2.0g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Teriyaki-sushi-rolls.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}