{"title": "Thai-style prawn noodle soup", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT5M", "total_time": "PT25 minutesM", "serves": "4"}, "ingredients": [{"item": "4 nests rice noodles"}, {"item": "2 x 180g packs Waitrose & Partners Raw Extra Large King Prawns"}, {"item": "235g pak choi, sliced on an angle, stems and leaves separated"}, {"item": "28g pack fresh coriander, leaves and stems separated, finely chopped"}, {"item": "1-2 red chillies, finely sliced"}, {"item": "2 limes, juice"}, {"item": "4 garlic cloves, peeled"}, {"item": "20g fresh ginger, peeled"}, {"item": "1 tsp sunflower oil"}, {"item": "1 litre fresh chicken stock"}, {"item": "1 1/2 tbsp light soy sauce, plus extra to season"}, {"item": "1 1/2 tbsp nam pla fish sauce, plus extra to season"}, {"item": "3 tbsp shaoxing rice wine"}, {"item": "1 tbsp caster sugar, plus extra to season"}], "instructions": [{"step": "For the broth, put the garlic and ginger in a small food processor and whizz to a rough paste. Heat the oil in a large saucepan over a low heat and fry the paste gently for 1 minute. Add the chicken stock to the pan, then add the remaining broth ingredients and slowly bring to the boil."}, {"step": "Cook the noodles according to pack instructions. Strain the broth through a fine sieve into a clean pan. Bring the broth to just below simmering point, then add the prawns and pak choi stems. Bubble gently for about 2 minutes until the prawns are just cooked through (don't cook to fast or the prawns will overcook). Add the pak choi leaves, then take off the heat and stir through the chopped coriander stems; season with soy sauce, fish sauce and sugar."}, {"step": "Divide the noodles between 4 deep bowls, ladle the broth over the top and add the lime juice. Serve with the coriander leaves and chillies scattered over."}], "nutrition": {"Energy": "1,462kJ 342kcals", "Fat": "1.8g", "Saturated Fat": "0.6g", "Carbohydrate": "49.8g", "Sugars": "7.1g", "Protein": "30.3g", "Salt": "4g", "Fibre": "2.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/prawn1.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}