{"title": "The Happy Pear's vegan Spanish tortilla", "tags": [{"tag": "Vegetarian"}, {"tag": "Vegan"}], "planning": {"prep_time": "PT20M", "cook_time": "PT40M", "total_time": "PT60M", "serves": "4 - 6"}, "ingredients": [{"item": "500g Maris Piper potatoes, halved"}, {"item": "1 onion, sliced"}, {"item": "4 tbsp olive oil"}, {"item": "225g silken tofu"}, {"item": "25g Cooks’ Ingredients Gram Flour"}, {"item": "2 tsp arrowroot"}, {"item": "3 ½ tbsp oat milk"}, {"item": "2 tsp salt"}, {"item": "50ml aquafaba (the drained liquid from a 400g can chickpeas)"}, {"item": "¼ tsp turmeric"}, {"item": "½ tsp smoked paprika"}, {"item": "¾ tsp garlic granules"}], "instructions": [{"step": "Preheat the oven to 180ºC, gas mark 4. Bring a large saucepan of water to the boil, put a steamer over it and cover with a lid. Steam the potatoes for 20 minutes or until tender and cooked through, but not falling apart. Allow to cool. Cut into 0.5-1cm thick slices. Meanwhile, sauté the onions in a large nonstick frying pan with 1 tsp oil over a medium heat for 10 minutes, stirring occasionally, until golden. Set aside with the potatoes."}, {"step": "Put all the remaining ingredients, other than 1 tsp of salt and oil, into a food processor or blender and pulse until smooth to make a batter."}, {"step": "Return the frying pan to a high heat. Add 3 tbsp of oil and cook the potato slices in batches, in a single layer, for 4 minutes on each side, until golden, reducing the heat if necessary. Remove and immediately sprinkle with the remaining salt."}, {"step": "Warm a nonstick, ovenproof frying pan (about 20cm) with 2 tsp olive oil over a medium heat. When hot, add half the batter. Cook for 1 minute, then layer with half the potatoes and onions, pressing them down until submerged. Repeat with the remaining batter, potatoes and onions. Cook for another minute until starting to set around the edges. Transfer to the oven for 20-25 minutes until set. Loosen the edges, then carefully invert onto a plate. Allow to rest for 5-10 minutes before serving warm, or cold with salad."}], "nutrition": {"Energy": "1,293KJ 309kcal", "Fat": "15g", "Saturated Fat": "2.2g", "Carbohydrate": "33g", "Sugars": "4.9g", "Protein": "8.4g", "Salt": "2.5g", "Fibre": "4.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/Happy Pear vegan Spanish tortilla.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}