{"title": "The Happy Pear Gluten free Bakewell tart", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6 - 8"}, "ingredients": [{"item": "240g raspberries"}, {"item": "4 tbsp water"}, {"item": "100ml maple syrup"}, {"item": "2 tbsp chia seeds"}, {"item": "150g gluten free plain white flour or buckwheat flour"}, {"item": "75g coconut oil"}, {"item": "3-4 tbsp cold water"}, {"item": "130g coconut oil"}, {"item": "140g maple syrup"}, {"item": "155g ground almonds"}, {"item": "1½ tbsp flaxseed"}, {"item": "4 tbsp water"}, {"item": "1¼ tsp gluten free baking powder"}, {"item": "50g flaked almonds"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Line the base of a 23cm spring form cake tin with greaseproof paper."}, {"step": "To make the jam, put the raspberries into a saucepan, add the water and cook over a medium heat until the fruit starts to break down. Add the maple syrup and chia seeds and bring to the boil. Leave to simmer for 6-8 minutes to reduce and thicken. Stir regularly to avoid burning or sticking. Remove from the heat and transfer to a bowl, then set aside to cool and firm up."}, {"step": "To make the pastry, put the flour into a large mixing bowl. Finely chop the solid coconut oil and add along with a pinch of salt. Rub together until the coconut oil has mixed with the flour until it resembles breadcrumbs - this should take about 3 minutes. Add the water and press the mixture together into a firm ball - if it doesn’t stick together easily add an extra tbsp water. Once the pastry has come together, refrigerate for 5 minutes until firm."}, {"step": "Lightly coat your hands in flour and transfer the dough into the lined cake tin.  Press firmly into the bottom of the tin - it should evenly cover the base by around 1/2 cm, but not the sides. Blind bake for 10 minutes (there’s no need to cover with baking paper and dried beans)."}, {"step": "Next make your frangipane mixture. Melt the coconut oil in a small saucepan on a high heat, then add to a mixing bowl along with the ground almonds, maple syrup and baking powder. In a separate bowl combine the flaxseed and water and set aside for 4 minutes until it turns gloopy and similar in consistency to an egg. Add the ‘flax egg’ to the ground almond mixture and mix well."}, {"step": "Take the base out of the oven and cover with the jam. Next, gently spoon over the frangipane mixture and sprinkle over the flaked almonds. Bake for 30 minutes."}, {"step": "When cooked, leave to cool for about 15 minutes, then chill before serving."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/HAPPY PEAR/Happy-Pear-bakewell-tart-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}