{"title": "The Happy Pear’s Vegan 'creamy' sweet potato gnocchi", "tags": null, "planning": {"prep_time": "PT30 minutesM", "cook_time": "PT10 minutesM", "total_time": null, "serves": "4"}, "ingredients": [{"item": "500g sweet potatoes"}, {"item": "1 tbsp milled flaxseeds"}, {"item": "1 sprig of thyme, leaves only"}, {"item": "Zest of 1 lemon"}, {"item": "3 tbsp olive oil"}, {"item": "250g super fine 00 grade pasta flour"}, {"item": "4 tbsp olive oil"}, {"item": "4 tbsp plain flour, sieved"}, {"item": "400ml soya or oat milk"}, {"item": "½ tbsp Dijon mustard"}, {"item": "½ lemon, zested and juiced"}, {"item": "150g Tenderstem broccoli, chopped into bite-sized pieces"}, {"item": "1 red chilli, deseeded and finely chopped"}, {"item": "100g frozen peas, defrosted"}, {"item": "2 tbsp olive oil"}, {"item": "Toasted pine nuts, to serve"}], "instructions": [{"step": "Boil the sweet potatoes whole, with their skins on, for about 20 minutes"}, {"step": "Put the milled flaxseeds into a cup, add 3 tbsp water and leave to sit for 5 minutes. This mixture will act in a similar way to an egg."}, {"step": "To make the béchamel, heat the oil in a frying pan and whisk in the flour to create a roux. Cook for 30 seconds, stirring continuously. Add the soya or oat milk, Dijon mustard, lemon zest and juice and seasoning. Bring to the boil while stirring continuously, until the sauce starts to thicken. Taste, and adjust the seasoning if required. Turn off the heat, cover and leave until needed."}, {"step": "When the sweet potatoes are almost tender, add the broccoli and boil for a further 3-4 minutes. Drain and separate the sweet potatoes and broccoli into separate bowls. Pour cold water over the broccoli to stop it cooking further."}, {"step": "Remove the skin of the sweet potato and mash gently using a potato masher. Add the thyme, lemon zest and olive oil, and sieve in the flour. Add the flax egg and mix well."}, {"step": "Dust your hands and work surface with extra flour and knead the dough for 30-60 seconds until it comes together, being careful not to overwork it. Cut the dough into quarters. Roll out one quarter of the dough into a long sausage approximately 2.5cm in diameter, and cut into 8 pieces. Roll each piece into a ball, and then flatten the centre with your thumb to create circular pillows. Repeat with the remaining dough, and place on a floured tray until required."}, {"step": "Cook the gnocchi in batches in a large pan filled with boiling water. Move the pan gently backwards and forwards to stop the gnocchi sticking. Cook each batch for about 3 minutes - you’ll know they’re cooked when they start to float. Remove with a slotted spoon."}, {"step": "Heat the olive oil in a frying pan, and fry the gnocchi until crisp and lightly browned, approximately 2-3 minutes each side. Add the chilli, broccoli, peas and béchamel sauce, until heated through. You may need to do this in batches. Serve scattered with extra thyme and toasted pine nuts."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/The-Happy-Pear’s-Creamy-sweet-potato-gnocchi.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}