{"title": "The Happy Pear’s vegan sticky toffee pudding", "tags": [{"tag": "Vegetarian"}, {"tag": "Vegan"}], "planning": {"prep_time": "PT20 minutes plus coolingM", "cook_time": "PT30 minutesM", "total_time": "PT50 minutes plus coolingM", "serves": "4-6 people"}, "ingredients": [{"item": "2 tbsp milled organic flaxseed"}, {"item": "200g pitted dates, chopped"}, {"item": "75g sunflower oil"}, {"item": "1 tsp vanilla extract"}, {"item": "2 tbsp black treacle"}, {"item": "150g plain flour"}, {"item": "50g coconut sugar"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "1 tbsp baking powder"}, {"item": "250g coconut sugar"}, {"item": "400g can of coconut milk, chilled"}], "instructions": [{"step": "Preheat the oven to 180°C gas mark 4, and line a 22cm square baking tray with baking parchment. Make ‘flax eggs’ by mixing the flaxseed with 6 tbsp water in a small bowl, and leave to sit for 5 minutes. Put the chopped dates into a bowl, pour over 200ml boiling water and set aside."}, {"step": "Mix the sunflower oil, vanilla extract and black treacle in a bowl. Put the flour, coconut sugar, bicarbonate of soda and baking powder into a large bowl and mix until combined."}, {"step": "Blend the date and water mixture until smooth, then make a well in the middle of the flour mixture and add the ‘flax eggs’, date mixture and the sunflower oil mixture. Stir until well combined."}, {"step": "Pour the batter into the lined baking tray. Smooth the surface and bake for 30 minutes."}, {"step": "To make the toffee sauce, put the coconut sugar into a large saucepan over a high heat. Whisk continuously; after 3-4 minutes the sugar will start to dissolve. Once dissolved, gently add the solid coconut cream from the top of the can, being careful not to add any of the coconut water. Keep stirring until the mixture is lovely and smooth, then turn off the heat and leave to one side."}, {"step": "When the pudding is cooked through, turn out and leave to cool on a wire rack. Spread half the toffee over the top, and cut into pieces to serve, with the rest of the toffee sauce and some vegan ice cream."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/h/HP-Pudding.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}