{"title": "The Happy Pear’s vegan lemon meringue pie", "tags": null, "planning": {"prep_time": "PT25 minutes plus chillingM", "cook_time": "PT15M", "total_time": null, "serves": "6 - 8"}, "ingredients": [{"item": "270g plain flour (plus extra for rolling)"}, {"item": "160g coconut oil"}, {"item": "1 tsp salt"}, {"item": "125g cashews, soaked overnight"}, {"item": "125g coconut cream from a tin of full fat coconut milk"}, {"item": "50g coconut oil"}, {"item": "½ tsp vanilla extract"}, {"item": "75 ml maple syrup"}, {"item": "2 tsp lemon zest"}, {"item": "4 tbsp lemon juice"}, {"item": "⅛ tsp turmeric"}, {"item": "Water from ½ can chickpeas"}, {"item": "60g white caster sugar"}], "instructions": [{"step": "Preheat oven to 200℃. To make the shortcrust pastry, add the flour and coconut oil to a food processor and blitz until the mixture resembles breadcrumbs. Gradually add 3 tbsp cold water. Scatter some flour on a work surface and knead the dough for a minute to bring it together, then wrap in greaseproof paper and chill for 15 minutes."}, {"step": "Grease a large loose-bottomed flan tin with a little coconut oil. Flour your work surface and roll out the pastry until it is approximately ½ cm thick, then carefully lift the pastry over the tin and press into the corners. Don’t worry if some pastry overhangs, you can trim it after baking. Cover the pastry with baking parchment and weigh it down with baking beans. Bake for 15 minutes, then remove from the oven, take out the beans and baking parchment and set aside to cool and firm up."}, {"step": "For the lemon filling, drain and rinse the soaked cashew nuts, melt the coconut oil, then add all the ingredients into the food processor. Blitz for 3-5 minutes or until smooth. Pour the lemon filling into the cooled pastry case, then chill until set."}, {"step": "To make the meringue, put the chickpea water into a clean bowl and, using an electric whisk, beat on a high speed until it starts to firm up and turn white. Reduce the speed then slowly add the sugar. When the sugar is all incorporated turn the speed up to high and whisk until the mixture forms stiff peaks."}, {"step": "Put the meringue mixture into a piping bag and pipe over the top of the pie - if you don’t have a piping bag, use a spoon. Finish by toasting the meringue using a blowtorch or grill."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/The-HP-lemon-meringue-pie.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}