{"title": "The Happy Pear's raw, vegan gluten-free & dairy-free banoffee pie", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "12 slices"}, "ingredients": [{"item": "100g almonds"}, {"item": "300g cashew nuts/walnuts"}, {"item": "200g pitted dates"}, {"item": "3 tsp vanilla extract"}, {"item": "4 tbsp coconut oil"}, {"item": "10 tbsp coconut oil"}, {"item": "300g pitted dates"}, {"item": "100g tahini (can be replaced with almond butter/cashew butter/peanut butter)"}, {"item": "10-12 tbsp water"}, {"item": "1 tsp vanilla extract"}, {"item": "a pinch of salt"}, {"item": "2x 400ml tins of full-fat coconut milk (refrigerated overnight)"}, {"item": "1 tbsp vanilla extract"}, {"item": "3 ripe bananas"}, {"item": "3 squares of best quality dark chocolate"}], "instructions": [{"step": "Line the base of a 23cm springform cake tin with baking parchment so you can remove the cake easily."}, {"step": "To make the base, put the almonds and cashew nuts into a food processor and whiz until they become coarse crumbs. Add the dates, vanilla extract and coconut oil, and blend until you have a breadcrumb-like texture. Transfer the mixture to the cake tin and use your hands to compact it really firmly into the base, ensuring an even spread."}, {"step": "To make the toffee layer, melt the coconut oil gently in a pan. Put it into a food processor with the rest of the ingredients for the toffee layer and blend until smooth and caramel-like. This can take up to 10 minutes - add more water if it's clumpy. Once ready, spread a really even layer of toffee on top of the base layer, doing your best to give it a smooth top. Put into the fridge for 20 minutes."}, {"step": "The base and toffee layers will keep like this for a week in the fridge, then all you have to do is to dress the cake before you serve. You can have the coconut cream ready in advance too."}, {"step": "Spoon the thick cream from both tins of coconut milk into a mixing bowl. Add 1 tablespoon of the clear coconut milk from one of the tins along with the vanilla extract, and whisk it all together with a fork or an electric whisk. The cream will keep for a week in the fridge, so you can also make this in advance."}, {"step": "To assemble the cake, remove the springform tin, carefully peeling away the parchment lining, and transfer the cake to a flat plate without a dip in it."}, {"step": "Slice the bananas into little 'coins' and put a layer of these on top of the toffee layer. Spoon the coconut cream  on top, then, using the fine side of a grater, grate the chocolate on top."}, {"step": "Refrigerate before serving, as the coconut crean with go a bit runny at room temperature if left out for too long. Store the cake in the fridge - if there's any left over!"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/HAPPY PEAR/Happy-Pear-vegan-banoffee-pie-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}