{"title": "Thomasina Miers' Grilled tandoori chicken with mango chutney", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "4"}, "ingredients": [{"item": "For the Chicken"}, {"item": "6-8 chicken thighs, deboned (or skinless and boneless chicken"}, {"item": "thighs, if you can find them)"}, {"item": "4 seeded crusty bread rolls or small baguettes"}, {"item": "1 jar of good-quality mango chutney"}, {"item": "Butter, for the rolls"}, {"item": "2-3 heads of Baby Gem, leaves separated"}, {"item": "Juice of 1 lemon, plus more to serve (optional)"}, {"item": "Handful of coriander leaves, roughly chopped"}, {"item": "1/2 cucumber, finely chopped (optional)"}, {"item": "For the Tandoori Marinade"}, {"item": "3 garlic cloves, finely grated"}, {"item": "1/2 small thumb-sized piece of fresh"}, {"item": "Ginger, peeled and finely grated"}, {"item": "1 small red chilli, finely chopped (deseeded if feeding chilli-averse children)"}, {"item": "1/2 tsp ground turmeric"}, {"item": "2 tsp garam masala"}, {"item": "1/2 tsp cayenne pepper"}, {"item": "250g natural yogurt"}], "instructions": [{"step": "First make the marinade. Mix the garlic, ginger, chilli, turmeric, garam masala, cayenne and half the yoghurt in a large bowl and stir to combine."}, {"step": "Flatten the chicken thighs between sheets of cling film by bashing with a rolling pin until roughly 1cm thick. Transfer to the bowl and rub the marinade into the chicken so that it is thoroughly covered."}, {"step": "Preheat the grill to high. Season both sides of the chicken, then place on a wire rack over a foil-lined baking tray and place under the hot grill for 10-12 minutes, turning the chicken over halfway. When it's brown on the edges and cooked through (check by cutting into a piece) remove from the oven to rest."}, {"step": "Split the rolls and spread a side of each with 1 tbsp of mango chutney; butter the other sides. Slice the thighs into thick fingers and cram into each roll, along with the lettuce, any leftover cooking juices and an extra dollop of mango chutney. Squeeze over the lemon juice, season to taste, then top with coriander. Serve at once with the extra yogurt in a bowl on the side, seasoned with some salt and pepper, a squeeze of lemon, and if you like, the cucumber."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Thomasina-grilled-tandoori-chicken-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}