{"title": "Vegan coriander hummus and beetroot blinis", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "28"}, "ingredients": [{"item": "400g tinned chickpeas, drained into a bowl to save the aquafaba (chickpea water)"}, {"item": "4 tbsp aquafaba"}, {"item": "3 tbsp olive oil"}, {"item": "2 tbsp lemon juice"}, {"item": "1 tbsp tahini"}, {"item": "1 small clove garlic, crushed"}, {"item": "A small handful of fresh coriander"}, {"item": "A good pinch of ground cumin"}, {"item": "A good pinch of ground coriander"}, {"item": "Salt and pepper to taste"}, {"item": "120g self-raising flour"}, {"item": "200ml almond milk"}, {"item": "2 tbsp of olive oil"}, {"item": "1 tbsp agave nectar"}, {"item": "A good grinding of salt and pepper"}, {"item": "2 pre-cooked beetroot (plain or pickled) halved and sliced"}, {"item": "Fresh coriander to garnish"}], "instructions": [{"step": "Whizz up 300g of chickpeas with the other hummus ingredients in a food processor or blender until smooth, then season with salt and pepper. Set aside the rest of the chickpeas for decoration."}, {"step": "Rub your frying pan with a little oil and heat on a medium to high heat until the pan is hot."}, {"step": "In a large bowl, sift the flour and season with salt and pepper."}, {"step": "In a jug, mix together the milk, oil and agave nectar."}, {"step": "Make a well in the centre of the flour, pour in the milk mixture and whisk until you have a smooth batter."}, {"step": "Carefully drop a few teaspoonfuls of batter into the hot pan, leaving room between each blini. Let them cook for 2-3 minutes until the surface bubbles. Turn the blinis and cook for a couple of minutes on the other side."}, {"step": "Pop the cooked blinis on a plate covered with kitchen paper and keep cooking the blinis in batches until you’ve used all the batter."}, {"step": "Now it’s time to layer up the blinis. Each little pancake is given a generous dollop of hummus, topped with a few chickpeas, a slice of beetroot and a sprig of fresh coriander."}, {"step": "Serve as a canape with drinks or with a light green salad as a starter."}, {"step": "Enjoy!"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Tinned Tomatoes vegan corriander humous - final.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}