{"title": "Christmas mushroom and lentil wellington", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6 - 8"}, "ingredients": [{"item": "2 tbsp olive oil"}, {"item": "1 small onion, finely chopped"}, {"item": "1kg chestnut mushrooms, chopped"}, {"item": "1 tsp thyme"}, {"item": "4 tbsp red wine"}, {"item": "½ vegetable stock cube"}, {"item": "100g cashew nuts"}, {"item": "2 tbsp porridge oats"}, {"item": "200g tinned lentils, rinsed and drained well"}, {"item": "1 ready rolled puff pastry"}, {"item": "100g spinach"}, {"item": "6 tbsp hummus"}, {"item": "Salt and pepper"}], "instructions": [{"step": "Preheat the oven to 200c/400f/gas mark 6 and take the pastry out of the fridge."}, {"step": "In a large frying pan or wok, saute the onion and garlic in 1 tbsp olive oil until soft, then add the mushrooms and cook gently until they are soft too. Add the thyme, red wine and crumble in the half stock cube. Gently cook until all the juices are gone. Season well with salt and pepper."}, {"step": "Whizz up a third of the mushrooms in a blender or food processor with the oats and nuts until you have a pate."}, {"step": "Pour the lentils into the mushrooms still in the pan and mix well."}, {"step": "Rinse the spinach in a colander, then pour a kettle full of boiling water over it to wilt it. Run cold water over it to cool it, then squeeze out as much liquid as you can before drying off in kitchen paper."}, {"step": "Carefully unroll the pastry and place it on a large baking tray, still on the baking parchment it was rolled in."}, {"step": "Spread the hummus across one long side of the pastry leaving a border. Top with spinach and then the mushroom pate. Top with the mushrooms and lentils and brush a little water around the edges of the pastry. Pull the pastry over the filling to make a large sausage roll shape.  Crimp the edges with a fork and use a knife to cut diagonal slits in the top. Brush with the rest of the olive oil."}, {"step": "Bake in the oven for 20-25 minutes until golden."}, {"step": "Serve with roast potatoes, vegetables and onion gravy."}, {"step": "Enjoy!"}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Final-mushroom-5.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}