{"title": "Toasted coconut marshmallows", "tags": null, "planning": {"prep_time": "PT20 minutes plus cooling and settingM", "cook_time": "PT20M", "total_time": "PT40 minutes plus cooling and settingM", "serves": "30"}, "ingredients": [{"item": "250g desiccated coconut"}, {"item": "400g golden caster sugar"}, {"item": "2 tbsp golden syrup (about 65g)"}, {"item": "3 sachets Dr Oetker powdered gelatine"}, {"item": "2 large Waitrose British Blacktail Free Range Eggs, whites separated"}, {"item": "2 tsp vanilla extract"}], "instructions": [{"step": "Preheat oven to 180ºC, gas mark 4. Line a 20cm x 30cm brownie tin with baking parchment. Tip the coconut onto a large baking tray and place in the oven to toast for 10-15 minutes, turning occasionally until golden and toasted."}, {"step": "Heat the sugar with the syrup in a small pan with 150ml water, until the soft-ball stage (120ºC) on a sugar thermometer (after about 10 minutes)."}, {"step": "In a small bowl, pour 150ml cold water. Sprinkle over the gelatine powder and place over a pan of simmering water until the gelatine has dissolved completely."}, {"step": "When the sugar syrup has reached the correct temperature, remove from the heat and whisk in the gelatine mixture (it will bubble and spit). Meanwhile, in a separate large bowl whisk the egg whites to soft peaks with an electric whisk. Slowly add the hot syrup mixture, whisking continuously, until the mixture is glossy and stiff and tripled in size (this can take about 10 minutes). Whisk in the vanilla extract."}, {"step": "Scatter a third of the coconut into the prepared brownie tin then pour the mallow on top, scatter with another third of the coconut and leave to cool and set (about 2 hours)."}, {"step": "Once set, cut the mallow into squares using a wet knife. Use the final third of the coconut to cover the sticky cut sides of the mallow squares, until they are completely coated."}], "nutrition": {"Energy": "485.344kJ 116kcals", "Fat": "5.2g", "Saturated Fat": "4.5g", "Carbohydrate": "16.4g", "Sugars": "16.4g", "Salt": "trace g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/2013wked-August-r26coconutmarsh.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}