{"title": "Toffee profiteroles with pineapple and basil cream", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT30M", "total_time": "PT50M", "serves": "4"}, "ingredients": [{"item": "50g butter"}, {"item": "75g plain flour, sifted"}, {"item": "2 medium eggs, beaten"}, {"item": "250g pack Waitrose Fresh Pineapple, roughly chopped"}, {"item": "½ x 25g pack fresh basil, roughly chopped"}, {"item": "142ml pot double cream"}, {"item": "½ x 450g jar Merchant Gourmet Dulce de Leche Original Toffee Sauce (find in the long-life desserts section), to decorate"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Grease a baking sheet and sprinkle it with a little water - the steam this will generate in the oven will help the choux pastry to rise.  Place the butter in a medium pan with 150ml cold water and heat gently until the butter has melted, then bring quickly to the boil. Remove the pan from the heat and add the flour all at once, then beat with a wooden spoon until the mixture leaves the sides of the pan. Cool slightly and then beat in the eggs a little at a time, until the mixture is smooth and shiny.  Use a dessert spoon to place 12 walnut-sized balls of the pastry slightly apart on the prepared baking sheet. Bake the profiteroles for 20-25 minutes until golden and crisp on the outside. Pierce each with a knife to let the steam out then transfer to a cooling rack.  Whip the cream to soft peaks, then fold in the pineapple and basil. Cut the profiteroles in half and spoon the cream into the bottom halves, then sandwich with the top halves. Pile onto a serving dish.  Place the toffee sauce in a small pan and heat gently to warm through. Drizzle over the profiteroles and serve immediately."}], "nutrition": {"Energy": "2363.96kJ 565.0kcal", "Fat": "35.7g", "Saturated Fat": "20.2g", "Sugars": "37.6g", "Salt": "0.4g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/PROFITEROLES_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}