{"title": "Tomato & spinach bucatini with prawns", "tags": null, "planning": {"prep_time": "PT5M", "cook_time": "PT20M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "1 tbsp cold pressed rapeseed oil, plus extra to drizzle"}, {"item": "2 garlic cloves, crushed"}, {"item": "2 tbsp double concentrated tomato purée"}, {"item": "1 tsp Cooks’ Ingredients Wild Oregano"}, {"item": "400g can chopped tomatoes"}, {"item": "1 tsp clear honey"}, {"item": "150g Waitrose & Partners No.1 Bucatini (or spaghetti)"}, {"item": "300g baby spinach"}, {"item": "150g pack Duchy Organic Cooked King Prawns"}, {"item": "3 tbsp freshly grated parmigiano reggiano"}], "instructions": [{"step": "Heat the oil in a wide pan, then add the garlic. Sizzle for 30 seconds until fragrant. Add the tomato purée and oregano and cook for 1 minute, or until the purée is turning burnished orange and smells sweet. Add the tomatoes, ½ a can of water and the honey; season. Simmer for 10-12 minutes until rich and thick. Taste; if it seems acidic, add a squeeze more honey."}, {"step": "Bring a large pan of salted water to the boil, then add the pasta. Return to the boil, then cook for 10 minutes or until al dente. Drain, reserving a cup of the cooking water. Meanwhile, put the spinach in a large colander, pour over boiling water from the kettle until wilted, then rinse with cold water. Squeeze out the excess water and drain on kitchen paper."}, {"step": "Add the prawns and spinach to the pasta sauce, then simmer until warmed through. Toss the pasta into the sauce, along with 2 tbsp water to loosen, and ½ the grated cheese. Transfer to warmed pasta bowls; finish with a little more cheese, serving a crispy green salad alongside, if liked."}], "nutrition": {"Energy": "2,347kJ 579kcals", "Fat": "19.4g", "Saturated Fat": "5.3g", "Carbohydrate": "63.9g", "Sugars": "10.9g", "Protein": "33.7g", "Salt": "1.24g", "Fibre": "6.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Tomato-&-spinach-bucatini.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}