{"title": "Tomato salad with summer herb labneh and dukkah", "tags": [{"tag": "Vegetarian"}, {"tag": "Gluten Free"}], "planning": {"prep_time": "PT30 minutes, plus overnight chillingM", "cook_time": "PT10M", "total_time": "PT40 minutes, plus overnight chillingM", "serves": "4"}, "ingredients": [{"item": "500g Total 2% fat Greek yogurt"}, {"item": "15g blanched hazelnuts"}, {"item": "15g Waitrose Cooks’ Ingredients dukkah spice mix"}, {"item": "1 lemon, zest of ½ and 3 tbsp juice"}, {"item": "large handful mint, all but a few leaves finely chopped"}, {"item": "large handful basil, all but a few leaves finely chopped"}, {"item": "600g colourful selection of ripe, seasonal tomatoes, sliced if large, quartered or halved if smaller"}, {"item": "4 tbsp extra virgin olive oil"}], "instructions": [{"step": "Start this recipe the day before it is needed. Line a sieve with clean muslin or a new dish cloth. Spoon the yogurt into the centre and set over a bowl. Leave to drain in the fridge for at least 12 hours or up to 24 hours."}, {"step": "Preheat the oven to 180°C, gas mark 4. Tip the hazelnuts into a roasting tin and roast for 6-8 minutes, shaking halfway, until pale golden. Cool, then crush or chop and combine with the dukkah, lemon zest, ½ the chopped mint and ½ the chopped basil; set aside on a large plate."}, {"step": "Tip the labneh (strained yogurt) into a bowl and stir in the remaining chopped herbs; season. Scoop out tablespoons and roll into 16 balls with wet hands. Roll each in the dukkah mixture and set aside on a plate. Arrange the tomatoes on a platter. Combine the olive oil with the lemon juice. Season and spoon over the tomatoes. Top with the labneh balls. Scatter with any leftover dukkah mixture and the reserved mint and basil leaves. Serve with warm flatbreads, if liked."}], "nutrition": {"Energy": "1,163kJ 279kcals", "Fat": "18g", "Saturated Fat": "3.7g", "Carbohydrate": "11g", "Sugars": "9.9g", "Protein": "15g", "Salt": "0.2g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Tomato-salad-with-summer-herb-labneh.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}