{"title": "Treacle tarts recipe | Waitrose", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT45 minutes, plus chillingM", "cook_time": "PT40M", "total_time": "PT1 hour 25 minutes, plus chillingM", "serves": "8 individual tarts"}, "ingredients": [{"item": "225g brown breadcrumbs (from a fresh, wholemeal loaf with the crusts removed)"}, {"item": "½ orange, zest"}, {"item": "200g golden syrup"}, {"item": "100g treacle"}, {"item": "100g double cream"}, {"item": "1 large egg"}, {"item": "1 large egg yolk"}, {"item": "1 tsp ground ginger"}, {"item": "2 tbsp bourbon"}, {"item": "200g plain flour, plus extra for rolling"}, {"item": "40g icing sugar"}, {"item": "1 tsp mixed spice"}, {"item": "125g unsalted butter, chilled and diced"}, {"item": "1 large egg yolk"}, {"item": "2 tsp lemon juice"}], "instructions": [{"step": "Start by making the pastry. Put the flour, sugar, spice, butter and a pinch of salt in a food processor; pulse to breadcrumbs. Add the egg yolk, 2 tbsp ice-cold water and the lemon juice and mix to bring together. Shape into a ball, flatten to a disc, cover with cling film and chill for 1 hour, until firm."}, {"step": "Divide the dough into 8 equal pieces and roll each out on a lightly floured surface to a neat disc, about 0.2cm thick and slightly larger than a 10cm tart case. Carefully line 8 x 10cm deep tart cases with the pastry, trimming off any excess. Arrange the tins on a baking sheet and chill for 20 minutes. Any excess pastry/offcuts can be re-rolled and used to make little stars to decorate."}, {"step": "Preheat the oven to 180˚C, gas mark 4. Prick the base of each pastry case and line with scrunched-up baking parchment and baking beans. Bake on the middle shelf of the oven for 15 minutes, until crisp and pale golden. Remove the paper and baking beans and cook for a further 3 minutes."}, {"step": "Meanwhile, tip the breadcrumbs and orange zest into a bowl. Gently warm the golden syrup, treacle and double cream in a small pan until runny and combined, but not boiling. Pour over the crumbs and mix in the remaining ingredients, plus a large pinch of flaky sea salt. Divide between the cases; bake for 15-20 minutes, until set. Cool for 5 minutes, then serve warm with ice cream."}], "nutrition": {"Energy": "2,033kJ 485kcals", "Fat": "22.5g", "Saturated Fat": "13.3g", "Carbohydrate": "63.1g", "Sugars": "35.2g", "Protein": "7.5g", "Salt": "0.8g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/TreacleTart34679_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}