{"title": "Triple chocolate layer cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "16"}, "ingredients": [{"item": "280g unsalted butter, softened, plus extra for greasing"}, {"item": "150g dark chocolate (70-75% cocoa), finely chopped"}, {"item": "250g self-raising flour"}, {"item": "30g cocoa powder"}, {"item": "5 large eggs"}, {"item": "280g golden"}, {"item": "caster sugar"}, {"item": "300ml soured cream"}, {"item": "4 tbsp milk"}, {"item": "Ganache Buttercream"}, {"item": "150g dark chocolate (70-75% cocoa), finely chopped"}, {"item": "150ml double cream"}, {"item": "100g unsalted butter, softened"}, {"item": "100g icing sugar"}, {"item": "Icing"}, {"item": "100g dark chocolate (70-75% cocoa)"}, {"item": "1½ tbsp golden syrup"}, {"item": "60g icing sugar, sifted"}], "instructions": [{"step": "Preheat the oven to 190˚C, gas mark 5. Grease and line 3 x 18cm sandwich tins; set aside. Put 150g chocolate in a heatproof bowl over a pan of barely simmering water, ensuring the bowl is not touching the water. Allow to melt, stirring occasionally, then take off the heat and set aside."}, {"step": "Sift the flour, cocoa powder and a pinch of fine sea salt into a medium bowl. In a jug, lightly beat the eggs. Set both aside. Use electric beaters or a freestanding mixer to beat the butter and sugar for about 8 minutes until very pale and fluffy, scraping down the bowl every now and then. Continue mixing on a high speed while gradually adding the eggs, then stop beating and carefully fold in the flour mixture with a rubber spatula. Fold in the melted chocolate, soured cream and milk."}, {"step": "Divide evenly between the prepared cake tins. Use a rubber spatula to spread the mixture evenly, with a slight dip in the centre of each. Bake for about 35 minutes, making sure the tins are not touching; swap the cakes around after 20 minutes (not before), to ensure they cook evenly. To test that the cakes are ready, rather than using a skewer, press each one lightly with your finger – they should be firm and springy to the touch, and coming away from the side of the tin. Cool in the tins for 2 minutes, then carefully run a palette knife around the edge of each sponge; turn out onto a wire rack. Peel away the parchment and leave to cool completely."}, {"step": "Meanwhile, for the ganache buttercream, put the chopped chocolate in a bowl. In a small pan, heat the cream gently until steaming and starting to bubble at the edges; remove from the heat and pour over the chocolate. Allow to stand for 1 minute then stir until just combined (don’t overmix as it could become grainy); set aside to cool for 5 minutes. In another bowl, beat the butter and icing sugar until light and fluffy, then stir in the cooled chocolate mixture. Chill for 30 minutes until firm but spreadable."}, {"step": "To assemble the cake, put one sponge on a serving plate or cake stand. Use a palette knife to spread ½ the buttercream over it. Top with another sponge, spread over the remaining buttercream and finish with the final sponge. Chill for 30 minutes until firm."}, {"step": "For the icing, chop 90g chocolate and melt it with the golden syrup in a bowl over a pan of simmering water. Remove from the heat and sift over the icing sugar; stir it in, along with 2-3 tbsp hot water, until just combined. While still warm, pour the icing onto the top of the cake and use a palette knife to spread evenly. Use a peeler to create chocolate shavings with the remaining chocolate and scatter over the cake. Keep for up to 4 days in an airtight container."}], "nutrition": {"Energy": "2,533kJ 608kcals", "Fat": "41g", "Saturated Fat": "25g", "Carbohydrate": "50g", "Sugars": "37g", "Protein": "7.6g", "Salt": "0.3g", "Fibre": "3.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/2101020_Waitrose-Chocolate_Ultimate-Chocolate-CakE.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}