{"title": "Turkish eggs with zaatar pitta crisps", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT10M", "cook_time": "PT15M", "total_time": "PT25M", "serves": "2"}, "ingredients": [{"item": "2 pitta bread"}, {"item": "2 tbsp extra virgin olive oil"}, {"item": "1 tsp Cooks’ Ingredients Herby Zaatar"}, {"item": "250g FAGE Total 5% Greek Yoghurt"}, {"item": "1 clove garlic, crushed"}, {"item": "2 British Blacktail Medium Free Range Eggs"}, {"item": "1 tsp Cooks’ Ingredients Peppery Pul Biber"}, {"item": "5g dill, roughly chopped"}, {"item": "5g coriander, roughly chopped"}, {"item": "Lemon wedges, to serve (optional)"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Cut the pitta bread widthways into 2cm strips, then carefully pull each strip in two so you are left with double the number. Place on a baking tray and drizzle with 1 tbsp olive oil. Toss to coat, then sprinkle with the zaatar. Bake for 6-8 minutes, turning halfway through, until crisp and lightly golden."}, {"step": "Meanwhile, in a bowl, combine the yoghurt with the crushed garlic. Season and set aside. Boil a kettle, then add the water to a wide-based sauté or saucepan, to a depth of 5-6cm, and place over a high heat."}, {"step": "Break the eggs into two separate ramekins. When the water starts to bubble, reduce the heat to low and carefully pour the eggs into the pan, dipping the rim of the ramekin into the water before gently tipping out the eggs. Cook for 2½-3 minutes, until the white is set. Use a slotted spoon to remove the eggs and place onto a plate lined with kitchen paper to drain."}, {"step": "In a small frying pan, mix the remaining oil with the pul biber. Place over a low heat for 1-2 minutes, until fragrant, then remove from the heat. Divide the yoghurt between two plates, then top each with a poached egg. Drizzle the pul biber oil over each one, then top with the chopped herbs. Serve with the pitta crisps and lemon wedges, to squeeze over, if liked."}], "nutrition": {"Energy": "2,041kJ 488kcal", "Fat": "26g", "Saturated Fat": "8.2g", "Carbohydrate": "38g", "Sugars": "5.5g", "Protein": "25g", "Salt": "0.9g", "Fibre": "2.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Turkish eggs zaatar pitta crisps.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}