{"title": "Twice-baked cheese souffles recipe | Waitrose", "tags": null, "planning": {"prep_time": "PT30 minutes, plus coolingM", "cook_time": "PT30M", "total_time": "PT1 hour, plus coolingM", "serves": "6"}, "ingredients": [{"item": "50g unsalted butter, plus extra  for greasing"}, {"item": "handful finely grated  parmigiano reggiano"}, {"item": "25g plain flour"}, {"item": "1 tbsp English mustard powder"}, {"item": "250ml whole milk"}, {"item": "pinch cayenne pepper"}, {"item": "½ whole nutmeg, finely grated"}, {"item": "3 eggs, separated"}, {"item": "225g mixed leftover cheese,  grated or crumbled"}, {"item": "50ml double cream"}], "instructions": [{"step": "Preheat the oven to 200˚C, gas mark 6. Grease 6 large ramekins (each about 200ml in volume) generously with butter, brushing up the sides. Sprinkle parmigiano reggiano into each one and coat evenly, before tapping out any excess (reserve for the soufflé mix)."}, {"step": "Heat the butter in a saucepan until foaming, then add the flour and mustard powder. Cook for 3-4 minutes, until golden, then take off the heat and gradually add the milk, stirring until smooth. Simmer over a medium heat, stirring constantly, for 2-3 minutes, to make a thick sauce. Transfer to a large bowl; mix in the spices, egg yolks and 175g cheese (plus any excess parmigiano reggiano), until mostly melted."}, {"step": "In a clean bowl, whisk the egg whites to stiff peaks, then fold a spoonful into the cheese sauce to loosen. Gently  fold in the remaining egg white in  3 additions until just mixed through."}, {"step": "Divide the mixture between the ramekins and place in a deep baking tin. Pour boiling water into the tin until it comes halfway up the ramekins; this is easiest to do when the tin is in the oven. Bake for 12-15 minutes, until golden, risen and firm. Remove from the tin and cool completely. Run a knife around the edges, then turn out. Continue as below or cover and chill for 3 days, or freeze in an airtight container for up to 1 month."}, {"step": "Raise the oven temperature to 220˚C, gas mark 7. Put the soufflés in a baking dish, pour over the cream and top with the remaining 50g cheese. Bake for 10-12 minutes, until golden. Serve, with rocket and a citrus dressing, if liked."}], "nutrition": {"Energy": "1,565kJ 377kcals", "Fat": "31.4g", "Saturated Fat": "18.2g", "Carbohydrate": "6.1g", "Sugars": "2.3g", "Protein": "17.6g", "Salt": "0.9g", "Fibre": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/t/Waitrose_Weekend_Dec14_LeftoversDOMADV_8083_Souffle_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}