{"title": "Halloween Spiderweb Cake", "tags": null, "planning": {"prep_time": "PT40 minutes, plus cooling and settingM", "cook_time": "PT1 hour 10 minutesM", "total_time": "PT1 hour 50 minutes, plus cooling and settingM", "serves": "12-14"}, "ingredients": [{"item": "200g salted butter at room temperature, plus extra for greasing"}, {"item": "350g plain flour"}, {"item": "1 tsp baking powder"}, {"item": "1 tsp bicarbonate of soda"}, {"item": "2 ½ tbsp cocoa powder"}, {"item": "¼ tsp fine sea salt"}, {"item": "375g caster sugar"}, {"item": "3 eggs"}, {"item": "1½ tsp vanilla extract"}, {"item": "284ml carton buttermilk"}, {"item": "1 tbsp white wine vinegar"}, {"item": "½ x 15g pack Dr Oetker red gel food colour"}, {"item": "120g salted butter at room temperature"}, {"item": "120g Philadelphia soft cheese"}, {"item": "120g icing sugar"}, {"item": "300ml carton double cream"}, {"item": "250g dark chocolate (70% cocoa), roughly chopped"}, {"item": "1½ tbsp liquid glucose"}, {"item": "50g white chocolate, roughly chopped"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Grease the base and sides of a 23cm springform cake tin and line with baking parchment. Sift together all the dry ingredients except the sugar; set aside. Using electric beaters, cream the butter and sugar for 1 minute. Add the eggs, 1 at a time, beating after each addition, then beat in the vanilla. Beat in ¼ the dry ingredients, then 1/3 the buttermilk and repeat, until fully combined. Mix the vinegar and food colouring together; beat into the mixture. Scrape into the tin and spread until level; tap the tin on the work surface to knock out any air bubbles. Bake for 1 hour or until a skewer inserted into the centre comes out clean. Set on a wire rack and leave to cool completely in the tin."}, {"step": "For the filling, use electric beaters to beat together the butter, soft cheese and icing sugar. Remove the cake from the tin and cut horizontally into 3 even layers (use a serrated knife). Take the bottom layer and place on a baking sheet, spread with ½ the filling, then repeat with the middle layer of cake and remainder of the filling; top with the final layer of cake. Leave to set in the fridge for 20-30 minutes."}, {"step": "For the icing, melt the cream, chocolate and glucose together in a heatproof bowl set over a pan of barely simmering water (making sure the base of the bowl doesn’t touch the water). Melt the white chocolate in another bowl using the same method and pour into a small piping bag."}, {"step": "Invert the cake onto a wire rack so there is a flat surface for the icing; set over a tray to catch the drips. Working quickly, pour the dark chocolate icing over the middle of the cake. With a palette knife, use long strokes to push the icing over the sides to create an even coating over the whole cake."}, {"step": "Starting slightly off centre, pipe a white chocolate spiral from the centre of the cake out to the edges (the tighter the lines, the more dramatic the effect). Take a cocktail stick and, starting from the centre, pull it through the white chocolate to the outside. Repeat, working around the cake, to create a spider’s web effect (see our Food Editor’s Top 5 page for more tips). Let the icing set for about 20-30 minutes. To store, keep refrigerated, and bring to room temperature before eating."}], "nutrition": {"Energy": "2,893kJ 693kcals", "Fat": "42.3g", "Saturated Fat": "26.1g", "Carbohydrate": "70.2g", "Sugars": "47.7g", "Protein": "7.9g", "Salt": "1g", "Fibre": "1.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/u/Waitrose_1014_Web_Cake_DM18192-r_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}