{"title": "Upside-down orange and olive oil cake", "tags": [{"tag": "Gluten Free"}, {"tag": "Vegetarian"}], "planning": {"prep_time": "PT15 minutes, plus coolingM", "cook_time": "PT1 hour 15 minutesM", "total_time": "PT1 hour 30 minutes, plus coolingM", "serves": "16"}, "ingredients": [{"item": "125ml olive oil, plus extra for greasing"}, {"item": "2 organic oranges"}, {"item": "200g golden caster sugar"}, {"item": "175g ground almonds"}, {"item": "130g polenta"}, {"item": "1tsp gluten-free baking powder"}, {"item": "3 eggs, at room temperature"}, {"item": "1tsp vanilla or almond extract"}, {"item": "Low-fat Greek-style or coconut yogurt, to serve"}], "instructions": [{"step": "Preheat the oven to 170˚C, gas mark 3. Lightly brush the base and sides of a 23cm springform cake tin with a little olive oil and line the base with baking parchment."}, {"step": "Thinly slice 1 orange; juice and zest the other. Put 50g sugar in a small pan with 50ml water and the orange juice; heat, stirring, until the sugar dissolves. Add the orange slices and simmer for 10 minutes until the skin is tender, then set aside on kitchen paper. Simmer the liquid until syrupy, then set aside separately."}, {"step": "Put the almonds in a bowl and stir in the polenta, baking powder, zest and a pinch of salt. In another large bowl, whisk the eggs and remaining 150g sugar with electric beaters until thick. Very slowly trickle in the oil (as if making mayonnaise) and extract, whisking as you go, until incorporated. Use a large metal spoon to fold in the polenta mixture."}, {"step": "Arrange the orange slices in the base of the tin, then spoon over the mixture. Bake for 1 hour, or until a skewer comes out clean. Leave to cool in the tin for 20 minutes, then turn out onto a plate. Spoon over the syrup, then slice and serve with the yogurt once fully cooled."}], "nutrition": {"Energy": "1,104kJ 265kcals", "Fat": "16g", "Saturated Fat": "2.7g", "Carbohydrate": "23g", "Sugars": "16g", "Protein": "7.1g", "Salt": "0.2g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/u/Upside-down orange and olive oil cake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}