{"title": "Utterly berry cake with marshmallow frosting", "tags": null, "planning": {"prep_time": "PT40M", "cook_time": "PT30M", "total_time": "PT70M", "serves": "10 - 12"}, "ingredients": [{"item": "5 large eggs"}, {"item": "300g unsalted butter, softened, plus extra for greasing"}, {"item": "300g caster sugar"}, {"item": "75g ground almonds"}, {"item": "225g self-raising flour, plus extra for dusting"}, {"item": "1⁄2 orange, zest and juice"}, {"item": "150g unsalted butter, softened"}, {"item": "250g icing sugar"}, {"item": "1⁄2x213gjar marshmallow fluff"}, {"item": "70g raspberries"}, {"item": "4 tbsp seedless raspberry jam"}, {"item": "150g raspberries"}, {"item": "175g blueberries"}, {"item": "75g strawberries, halved"}], "instructions": [{"step": "Preheat the oven to 180 ̊C, gas mark 4. Grease 3 x 18cm round sandwich tins, then line the bases with baking parchment and lightly dust the sides with flour."}, {"step": "In a large bowl, whisk together the eggs, butter, sugar, almonds, flour and orange zest and juice using electric beaters until smooth (don’t worry if it looks slightly curdled). Divide equally between the tins and level with the back of a spoon. Bake for 25-30 minutes, until risen and golden. Cool upside down on a tea towel-lined board for 5 minutes to flatten the tops, then turn the right way up, take out of the tins and leave to cool completely on a wire rack."}, {"step": "Meanwhile, make the frosting. In a large bowl; use electric beaters to beat the butter and 125g icing sugar together until combined. Gradually beat in the remaining 125g icing sugar and the marshmallow fluff until light and fluffy. Set aside 1/3 the frosting. Stir the raspberries into the remaining frosting, squishing them to marble through."}, {"step": "To assemble, put 1 sponge on a cake plate and spread with 2 tbsp raspberry jam and 1⁄2 the raspberry-swirled frosting. Scatter with 1/3 the raspberries and blueberries. Top with another sponge and repeat with the remaining raspberry- swirled frosting and another 1/3 the raspberries and blueberries. Finish with the final sponge and swirl the reserved frosting over the top. Scatter with the strawberries and remaining raspberries and blueberries before serving."}], "nutrition": {"Energy": "2,818kJ 674kcals", "Fat": "37.7g", "Saturated Fat": "21.3g", "Carbohydrate": "76.5g", "Sugars": "59.9g", "Protein": "7.2g", "Salt": "0.3g", "Fibre": "1.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/u/berrycake_2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}