{"title": "Vanilla and strawberry gin cheesecake", "tags": null, "planning": {"prep_time": "PT50 minutes plus chillingM", "cook_time": "PT10M", "total_time": "PT1 hour, plus chillingM", "serves": "10"}, "ingredients": [{"item": "300g digestive biscuits"}, {"item": "150g unsalted butter, melted, plus extra for greasing"}, {"item": "5 gelatine leaves"}, {"item": "150ml Beefeater Pink Distilled Gin"}, {"item": "60g caster sugar"}, {"item": "3 x 250g packs essential Waitrose Creamy Soft Cheese"}, {"item": "100g icing sugar, sifted"}, {"item": "2 tsp vanilla bean paste"}, {"item": "300ml double cream"}, {"item": "5 gelatine leaves"}, {"item": "150ml Beefeater Pink Distilled Gin"}, {"item": "60g caster sugar"}, {"item": "150g fresh strawberries, hulled and cut into halves and quarters"}, {"item": "Waitrose Cooks’ Ingredients Freeze Dried Strawberries"}, {"item": "Waitrose Cooks’ Ingredients Pearl Sugar Nibs"}], "instructions": [{"step": "Lightly grease and line the base and sides of a 23cm spring-form cake tin with baking parchment. Blitz the digestive biscuits in a food processor to a fine crumb or place them in a large food bag and bash with a rolling pin. Combine the biscuit crumbs with the melted butter and press firmly in a flat layer in the base of the tin. Chill for 30 minutes."}, {"step": "While the base is chilling, make the vanilla cheesecake mixture. Place the gelatine leaves in a bowl of cold water to soak for a few minutes. Meanwhile, heat the gin and caster sugar in a pan until the sugar is dissolved, then take the pan off the heat. Squeeze the water from the gelatine leaves and stir them into the gin mixture. Leave to cool slightly, stirring often."}, {"step": "In a large bowl, or in a free-standing mixer, whisk the cream cheese, icing sugar and vanilla paste together until light and fluffy. With the whisk on the lowest speed it will go, very slowly pour in the cooled gin and gelatine mixture, making sure it is all well incorporated, scraping down the sides of the bowl as you go if needed."}, {"step": "Add the double cream and whisk once more until the mixture is light and well combined. Spoon onto the chilled biscuit base and smooth into a thick even layer, leaving the top as flat as possible. Tap the tin a few times on the worktop to expel any hidden pockets of air and place in the fridge to set for at least four hours."}, {"step": "When the vanilla cheesecake mixture has set, make the strawberry gin jelly by placing the gelatine leaves in a bowl of cold water to soften. Meanwhile, heat the gin, caster sugar and 200ml water in a pan. When the sugar has dissolved take the pan off the heat, squeeze the water from the gelatine leaves and stir them into the warm gin mix. Keep stirring until the mixture is cool to the touch. When the jelly mixture is cool, carefully pour it on to the top of your refrigerated cheesecake and place back in the fridge for at least 2 hours, but preferably overnight, to set."}, {"step": "Just before serving, ease the cheesecake out of the tin onto a serving plate. Decorate with the cut strawberries and sprinkle over the freeze-dried strawberries and pearl sugar nibs."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Vanilla-and-Strawberry-gin-cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}