{"title": "Vanilla & passion fruit cheesecake", "tags": null, "planning": {"prep_time": "PT25 minutes +cooling + chillingM", "cook_time": "PT1 hour 35 minutesM", "total_time": null, "serves": "12"}, "ingredients": [{"item": "200g digestive biscuits"}, {"item": "75g unsalted butter, melted"}, {"item": "2 x 340g tubs Philadelphia Original"}, {"item": "300ml soured cream"}, {"item": "200g Billington’s Golden Caster Natural Unrefined Cane Sugar"}, {"item": "2 tsp Nielsen-Massey Vanilla Extract"}, {"item": "1⁄2 lemon, juice"}, {"item": "3 large British Blacktail Free Range Eggs, lightly beaten"}, {"item": "4 large passion fruits"}], "instructions": [{"step": "Preheat the oven to 150oC, gas mark 2, and line the base of a 20cm loose-bottomed cake tin with baking parchment. Put the biscuits in a large bowl and use the end of a rolling pin to crush them. Add the butter and mix, then tip into the base of the tin. Press down evenly and firmly using the back of a spoon. Bake for 25 minutes, then set aside to cool."}, {"step": "Use a balloon whisk to beat together the soft cheese, 150ml soured cream, the sugar, vanilla and lemon juice until smooth. Beat in the eggs a little at a time until combined, then tip into the cake tin. Put an ovenproof dish half-filled with water on the bottom shelf of the oven (the steam will help to prevent the cheesecake from cracking), then put the cheesecake on the middle shelf and bake for 1 hour 10 minutes until still wobbly but set."}, {"step": "Turn off the oven and leave the door ajar, allowing the cheesecake to cool inside the oven for 30 minutes. Remove from the oven and spread the remaining 150ml soured cream over the top. Once completely cool, chill for at least 4 hours or ideally overnight. To serve, scoop the passion fruit pulp on top of the cheesecake."}], "nutrition": {"Energy": "1,632kJ 392kcals", "Fat": "26g", "Saturated Fat": "15g", "Carbohydrate": "31g", "Sugars": "23g", "Protein": "7.2g", "Salt": "0.8g", "Fibre": "1.3g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/New recipes/4983-Vanilla-Passion-Fruit-Cheesecake.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}