{"title": "Vanilla cheesecake with blueberry compote", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30 minutes, plus cooling and overnight chillingM", "cook_time": "PT20M", "total_time": "PT50 minutes, plus cooling and overnight chillingM", "serves": "10"}, "ingredients": [{"item": "50g unsalted butter, melted, plus extra for greasing"}, {"item": "150g digestive biscuits"}, {"item": "560g full fat soft cheese"}, {"item": "100g icing sugar, sifted"}, {"item": "200g Greek yogurt"}, {"item": "300g whipping cream"}, {"item": "1 tsp vanilla bean paste"}, {"item": "300g blueberries"}, {"item": "2 tbsp maple syrup"}, {"item": "1 cinnamon stick"}], "instructions": [{"step": "Preheat the oven to 150°C, gas mark 2. Grease and line the base and sides of a 20cm springform tin with baking parchment. Put the digestive biscuits in a freezer bag, seal, then bash to crumbs with a rolling pin. Pour into a bowl and mix with the melted butter. Press into the base of the tin and bake for 15 minutes. Set aside to cool."}, {"step": "Beat the soft cheese, icing sugar, yogurt and a pinch of salt together with a wooden spoon. In a separate bowl, use a balloon whisk to whisk the whipping cream and vanilla paste to soft peaks, then gently fold the cream through the soft cheese mixture. Pour onto the cooled base and chill for at least 4 hours or ideally overnight."}, {"step": "Meanwhile, heat 1 pack blueberries in a pan with the maple syrup and cinnamon. Bring to a simmer and cook gently for 3-4 minutes, until the berries burst. Tip in the other pack and take off the heat to cool to room temperature, then chill. When ready to serve, discard the cinnamon stick and spoon over the chilled cheesecake."}], "nutrition": {"Energy": "1,889kJ 453kcals", "Fat": "29g", "Saturated Fat": "17g", "Carbohydrate": "37g", "Sugars": "30g", "Protein": "11g", "Salt": "0.7g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Blueberry_Cheesecake_Whole_58.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}