{"title": "Vegan chocolatey cupcakes", "tags": null, "planning": {"prep_time": "PT20 minutes, plus coolingM", "cook_time": "PT25M", "total_time": "PT45 minutes, plus coolingM", "serves": "12"}, "ingredients": [{"item": "150g self-raising flour"}, {"item": "5 tbsp Naturya Organic Cacao Powder"}, {"item": "¾ tsp baking powder"}, {"item": "¼ tsp salt"}, {"item": "175g dark brown soft sugar"}, {"item": "2 tbsp chia seeds"}, {"item": "225ml Innocent Dairy Free Coconut drink"}, {"item": "110g dairy free sunflower spread, melted"}, {"item": "1 tbsp Naturya Organic Cacao Powder"}, {"item": "50ml Innocent Dairy Free Coconut drink"}, {"item": "50g dairy free 72% cacao bar, chopped, plus shavings to decorate (optional)"}, {"item": "35g dairy free sunflower spread"}, {"item": "50g icing sugar"}], "instructions": [{"step": "Line a 12-hole muffin tin with muffin cases. Preheat the oven to 180˚C, gas mark 4. Sift the flour, cacao powder and baking powder into a large bowl, then add the salt. Work in the sugar, using your hands to break up any clumps. Make a well in the middle."}, {"step": "Finely grind the chia seeds in a coffee or spice grinder, or by hand with a pestle and mortar. Mix with 100ml coconut drink and leave it to thicken for just a few seconds. Pour the chia mix, melted sunflower spread and remaining 125ml coconut drink into the well. Whisk to a smooth batter. Spoon into the cases and bake for 22 minutes, until well risen and a skewer inserted comes out clean. Cool completely."}, {"step": "For the frosting, sift the cacao powder into a mixing bowl. Gently heat the coconut drink and chopped cacao in a small pan, stirring with a spatula until melted. Whisk the hot cacao mixture vigorously into the cacao powder until smooth and creamy, then whisk in the sunflower spread. Finally, sift in the icing sugar and whisk again until smooth and creamy. Leave the frosting to cool until it’s of a spoonable consistency, then, using a teaspoon, swirl it onto the cooled cupcakes and top with cacao shavings, if liked."}], "nutrition": {"Energy": "Per cupcake 1115kJ 266kcals", "Fat": "12g", "Saturated Fat": "4.3g", "Carbohydrate": "34g", "Sugars": "21g", "Protein": "4.2g", "Salt": "0.43g", "Fibre": "3.1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Vegan-cupcakes.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}