{"title": "Vegan caramelised onion and chestnut wellington", "tags": null, "planning": {"prep_time": "PT30M", "cook_time": "PT35M", "total_time": null, "serves": "4 - 6"}, "ingredients": [{"item": "2 tbsp vegetable oil"}, {"item": "1 large onion, thinly sliced"}, {"item": "1 tbsp sherry vinegar"}, {"item": "1 large parsnip, peeled and cut into 2-3cm chunks"}, {"item": "200g chestnut mushrooms, quartered"}, {"item": "1 clove garlic, finely chopped"}, {"item": "1 sprig rosemary, leaved chopped"}, {"item": "260g pack spinach"}, {"item": "180g pack whole chestnuts, roughly sliced"}, {"item": "75g blanched hazelnuts, roasted and roughly chopped"}, {"item": "10g sage, shredded"}, {"item": "Zest of 1 unwaxed lemon"}, {"item": "320g pack Jus-Rol Puff Pastry Sheet"}, {"item": "1 tbsp plain flour"}], "instructions": [{"step": "Preheat the oven to 200 ̊C, gas mark 6. Heat 1 tbsp oil in a large frying pan over low heat. Add the onion and a good pinch of salt and cook very slowly for 15-20 minutes, stirring occasionally to prevent them from catching. Don't be tempted to turn the heat up, as you don't want the onions to burn. Once the onions are golden and sweet add the vinegar and cook for 30 seconds before removing the pan from the heat. Transfer to a large mixing bowl."}, {"step": "Meanwhile, cook the parsnip in a small pan of boiling water for 10 minutes until tender. Drain well and place into the mixing bowl with the onions."}, {"step": "Place the same frying pan from the onions over a high heat and add the mushrooms. Cook for 1 minute or until the mushrooms begin to brown. Add the remaining oil, garlic and rosemary. Fry the mushrooms for 3-4 minutes. Season and transfer to the mixing bowl."}, {"step": "Add the spinach to the frying pan with 2 tbsp of water, cook for 2 minutes or until wilted. Place the cooked spinach into a colander and leave to cool. Once cooled press as much water as possible from the spinach and add to the mixing bowl."}, {"step": "Add the chestnuts, hazelnuts, sage and unwaxed lemon zest to the mixing bowl. Season to taste with salt and pepper."}, {"step": "Unroll the pastry and lay lengthways on a large greased baking sheet. Form the filling into a sausage across the length of the pastry. Ensure that the filling is pressed together evenly by squeezing it into shape with your hands."}, {"step": "Mix the plain flour with 30ml of water to make a thin paste. Using a pastry brush, brush the paste over the long edges of the pastry. Fold the pastry over the filling and align the edges. Seal the pastry and crimp the edges with a fork. Brush the surface of the Wellington with oil and cook for 35 minutes or until golden."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/VeganWellington_48_1_1_FINAL.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}