{"title": "Venison and mushroom pie", "tags": null, "planning": {"prep_time": "PTPrepare 35 minutes, plus soaking, cooling and restingM", "cook_time": "PT3 hours 20 minutesM", "total_time": "PT4 hours, plus soaking, cooking and restingM", "serves": "8-10"}, "ingredients": [{"item": "2 x 30g packs Waitrose Cooks’ Ingredients dried wild mushrooms"}, {"item": "2 tbsp vegetable oil"}, {"item": "4 x 300g packs Waitrose 1 Diced British Venison"}, {"item": "400g smoked bacon lardons"}, {"item": "8 bay leaves 100g unsalted butter"}, {"item": "500g chestnut mushrooms, halved, or quartered if large"}, {"item": "1 large essential Waitrose Swede, peeled and cut into 3cm chunks"}, {"item": "400g shallots, peeled but root left intact"}, {"item": "½ tsp mixed spice"}, {"item": "4 tbsp plain flour, plus extra for dusting"}, {"item": "2 tbsp tomato purée"}, {"item": "500ml bottle pale ale"}, {"item": "1 orange, zest"}, {"item": "2 tbsp redcurrant jelly"}, {"item": "500ml fresh beef stock"}, {"item": "½ x 20g pack rosemary sprigs, leaves finely chopped"}, {"item": "2 x 250g Waitrose frozen all butter puff pastry, defrosted"}, {"item": "1 egg, beaten"}], "instructions": [{"step": "Cover the dried mushrooms with 500ml just-boiled water; set aside. Heat 1 tbsp oil in a large, deep casserole dish over a medium-high heat. Pat the venison pieces dry on kitchen paper, season and sear in batches for 4-5 minutes (adding more oil, as needed), until browned all over; set aside. Add the remaining 1 tbsp oil to the pan with the lardons, cook rapidly to allow any excess liquid to evaporate, then fry for 6-8 minutes, until crisp. Add the bay leaves, butter, chestnut mushrooms, swede and shallots; season. Cook for 5-7 minutes, until just golden."}, {"step": "Stir in the mixed spice and flour. Cook for 3-4 minutes, stirring constantly, before adding the tomato purée and ale. Bring to the boil then simmer, stirring regularly, until reduced by half and quite thick. Strain the liquid from the soaked mushrooms into the pan. Roughly chop the mushrooms and add them with the orange zest, redcurrant jelly, stock and enough water just to cover the ingredients, if needed. Season, partially cover and simmer for 1 hour 30 minutes, stirring occasionally."}, {"step": "Uncover the casserole and simmer for a final 30-45 minutes, until the meat is tender and coated in a thick sauce. Season, stir in the rosemary and transfer to a pie dish – a large, 3-litre dish (or use smaller dishes). Discard the bay leaves and cool completely. The filling can now be covered and chilled for up to 3 days (or frozen for up to 1 month)."}, {"step": "Preheat the oven to 200˚C, gas mark 6. Stack the pastry blocks on top of each other and roll out on a lightly floured work surface to a sheet large enough to cover the pie dish. Cut a hole in the centre of the pastry so that steam can escape. Brush the rim of the dish with beaten egg and cut 1.5cm-wide strips from the excess pastry, securing these to the rim. Brush the strips with a little more eggwash (add a pie funnel now, if using), then lay over the large sheet of pastry to make the lid. Crimp the edges to seal and trim off any overhanging pastry."}, {"step": "Brush the top of the pie with eggwash and bake for 35-40 minutes, or until golden and the filling is piping hot; cover with foil if the pastry starts to brown too quickly. Leave to stand for 15 minutes before serving, with mash and greens, if liked."}], "nutrition": {"Energy": "2,780kJ 666kcals", "Fat": "36.8g", "Saturated Fat": "16.5g", "Carbohydrate": "31.3g", "Sugars": "8.9g", "Protein": "45g", "Salt": "1.7g", "Fibre": "5.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Venison-and-mushroom-pie-2048x2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}