{"title": "Vietnamese-style chicken & noodle salad", "tags": null, "planning": {"prep_time": "PT20M", "cook_time": "PT15M", "total_time": "PT35M", "serves": "4"}, "ingredients": [{"item": "2 lemongrass stalks, tough outer leaves removed"}, {"item": "1 tbsp Cooks’ Ingredients Nam Pla Fish Sauce"}, {"item": "1½ tbsp light brown soft sugar"}, {"item": "40g fresh root ginger, peeled and cut into matchsticks"}, {"item": "1 red chilli, finely sliced"}, {"item": "2 Chicken Breast Fillets"}, {"item": "1 tbsp toasted sesame oil"}, {"item": "200g pack dried rice vermicelli noodle nests"}, {"item": "4 little gem lettuce hearts, shredded"}, {"item": "3 carrots, peeled and pared with a vegetable peeler"}, {"item": "1 cucumber, halved, deseeded and cut into half moons"}, {"item": "2 limes, zest of 1, juice of both"}, {"item": "½ x 25g pack Thai basil"}, {"item": "15g Cooks’ Ingredients Crispy Fried Onions"}], "instructions": [{"step": "For the dressing, halve the lemongrass stalks widthways, then bash the thicker ends and finely chop the thinner ends. Place both in a small pan with the fish sauce, sugar, ginger, chilli and 5 tbsp water. Bring to the boil, simmer for 3-4 minutes then set aside to cool."}, {"step": "Heat a griddle or frying pan over a high heat. Put the chicken breasts between 2 sheets of cling film or baking parchment and fl atten out with a rolling pin until about 1cm thick. Brush with ½ tbsp sesame oil and griddle for 4 minutes on each side until cooked through, the juices run clear and there is no pink meat. Slice into thin strips."}, {"step": "Meanwhile, put the noodles in a large bowl and cover with just-boiled water. Leave for 10 minutes, then drain and toss with the remaining ½ tbsp sesame oil. Divide between 4 plates with the prepared vegetables and cooked chicken. Remove the thick lemongrass stalks from the dressing, stir in the lime zest and juice and spoon over the noodle salad. Pick the leaves off the Thai basil and, along with the crispy fried onions, scatter over to serve."}], "nutrition": {"Energy": "1,816kJ 438kcals", "Fat": "7.3g", "Saturated Fat": "1.9g", "Carbohydrate": "56.9g", "Sugars": "13.1g", "Protein": "33g", "Salt": "1.19g", "Fibre": "4.9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Vietnamese-style-chicken.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}