{"title": "Vietnamese beef pho", "tags": [{"tag": "Low Fat"}], "planning": {"prep_time": "PT15M", "cook_time": "PT15M", "total_time": "PT30M", "serves": "4"}, "ingredients": [{"item": "1 bunch salad onions, sliced"}, {"item": "4cm piece root ginger, peeled and chopped"}, {"item": "3 whole star anise"}, {"item": "2 lemongrass stalks, finely chopped"}, {"item": "3 x 500g tubs Cooks’ Ingredients Beef Stock"}, {"item": "200g pack Thai Taste Folded Rice Noodles"}, {"item": "2 x 200g essential Waitrose British Beef Rump Steak, lean, trimmed of fat"}, {"item": "300g bag beansprouts"}, {"item": "235g pack pak choi, halved lengthways"}, {"item": "1 tbsp Thai fish sauce"}, {"item": "1 tsp light muscovado sugar"}, {"item": "Juice of lime, plus wedges to serve"}, {"item": "1 red chilli, seeded and sliced and coriander leaves, to garnish"}], "instructions": [{"step": "Set aside some green salad onion slices to garnish and place the remainder in a large saucepan with the ginger, star anise, lemongrass and stock and simmer for 10 minutes."}, {"step": "Meanwhile, place the noodles in a heatproof bowl, cover with boiling water and cover the bowl with clingfilm, leave to soak for 10 minutes or until tender."}, {"step": "Heat a frying pan until very hot and cook the steak for 2 minutes on each side until nicely browned but pink in the centre. Transfer to a plate and leave to rest for few minutes."}, {"step": "Place the beansprouts and pak choi in a large saucepan and pour or strain over the hot stock. Bring to a simmer, add the fish sauce, sugar and lime juice to taste."}, {"step": "Drain the noodles and divide between bowls. Ladle over the broth and vegetables then thinly slice the steak and place on top. Scatter with reserved salad onions, chilli and coriander leaves, and serve with lime wedges on the side."}], "nutrition": {"Energy": "1,912kJ 453kcals", "Fat": "8.5g", "Saturated Fat": "3g", "Carbohydrate": "20.6g", "Sugars": "6.2g", "Protein": "70g", "Salt": "1.7g", "Fibre": "5.6g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/v/Vietnamesebeefpho.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}