{"title": "Walnut many-layered cake with honeycomb frosting", "tags": [{"tag": "Vegetarian"}], "planning": {"prep_time": "PT30M", "cook_time": "PT25M", "total_time": "PT55M", "serves": "8 - 10"}, "ingredients": [{"item": "200g butter, softened"}, {"item": "200g caster sugar"}, {"item": "1 tsp vanilla extract"}, {"item": "3 large Waitrose British Blacktail Free Range Eggs, separated"}, {"item": "200g self-raising flour"}, {"item": "1 tsp baking powder"}, {"item": "4-5 tbsp milk"}, {"item": "100g walnut pieces, finely chopped"}, {"item": "50g butter, softened"}, {"item": "50g soft cheese"}, {"item": "200g icing sugar, sifted"}, {"item": "1-2 tbsp Bonne Maman Caramel Spread"}, {"item": "250g granulated sugar"}, {"item": "2 medium free range egg whites"}, {"item": "Pinch of salt"}, {"item": "45g pot Cooks’ Homebaking Honeycomb Niblets"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 3. Butter and base line two 20cm deep round cake tins. Cream the butter, sugar and vanilla together in a large bowl until pale and fluffy. Beat in the egg yolks one at a time. Sift the flour with the baking powder and fold into the creamed ingredients alternating with the milk and walnuts."}, {"step": "Whisk the egg whites until stiff then stir a tablespoonful into the creamed mix to loosen the mixture and fold in the rest quickly and lightly. Divide between the tins, level the surface and bake for 20-25 minutes until firm and golden and a skewer emerges cleanly from the centre of each cake. Turn out and cool on wire racks."}, {"step": "Make the buttercream filling by beating the butter and soft cheese together then adding the sugar and beating until light and fluffy. Swirl through the caramel spread. Cut each cake in half horizontally and sandwich the 4 layers together with the butter cream."}, {"step": "For the frosting, gently heat the sugar and 60ml water in a small pan until completely dissolved then boil for 2-3 minutes until the thread stage (101°-112° on a sugar thermometer) is reached (see cook’s tip). Keep warm over a very low heat. Place the egg whites and salt in a large mixing bowl set over gently simmering water and whisk until stiff. Pour the hot syrup onto the egg whites and beat constantly over simmering water for 6-8 minutes or until the icing makes firm peaks. Remove from the heat and whisk for a minute or two to allow the frosting to cool. Spread over the cake, scatter over the honeycomb pieces and leave to cool."}], "nutrition": {"Energy": "2,812kJ 671kcals", "Fat": "31.9", "Saturated Fat": "15.5g", "Carbohydrate": "89g", "Sugars": "73g", "Protein": "7g", "Salt": "1g", "Fibre": "1g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/Waitrose-Weekend280_Sat-Bake_Walnut-Layered-Cake-&-Honycomb.gif/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}