{"title": "Warm salmon, blush orange and fennel salad", "tags": null, "planning": {"prep_time": "PT25 minutes, plus marinating and coolingM", "cook_time": "PT10M", "total_time": "PT35 minutes, plus marinating and coolingM", "serves": "4"}, "ingredients": [{"item": "about 600g whole Native Hebridean salmon fillet , descaled and cut into 4 fillets"}, {"item": "1½ tsp fennel seeds, ground with a pestle and mortar"}, {"item": "6 blush oranges"}, {"item": "2 garlic cloves, peeled and bashed"}, {"item": "500ml fresh fish stock"}, {"item": "2 fennel bulbs, trimmed and finely sliced (any feathery fronds reserved)"}, {"item": "1 lemon, zest and juice"}, {"item": "1 echalion shallot, finely sliced"}, {"item": "2 tsp white wine vinegar"}, {"item": "½ tsp dried chilli flakes"}, {"item": "4 tbsp extra virgin olive oil, plus extra for drizzling"}, {"item": "½ x 25g pack mint, leaves picked"}, {"item": "½ x 20g pack dill, fronds picked"}], "instructions": [{"step": "Season the flesh side of each salmon fillet and sprinkle ¼ tsp ground fennel seeds over each; set aside for 15 minutes. Meanwhile, cut the top and bottom away from each blush orange, then slice off the skin in strips, following the curve of the orange. Over a bowl, segment the fruit, cutting the flesh out from between the membranes. Squeeze any remaining juice from the membranes into the bowl of segments."}, {"step": "Put a couple of strips of the orange peel (discard the rest) in a pan or small frying pan that will hold the salmon snugly in a single layer. Add the garlic and stock; bring to the boil. Add the salmon, reduce the heat to just bubbling and poach for 6-8 minutes, until the fish is just opaque. Using a slotted spoon, transfer the fillets to a plate and leave to cool slightly, then discard the skin and break the flesh into chunks."}, {"step": "Meanwhile, mix the sliced fennel (including any fronds), lemon zest and juice, shallot, vinegar and chilli flakes with the orange segments and juice; season. Add the oil and most of the herbs, then toss together. Divide most of the salad between 4 plates, keeping back a few spoonfuls. Nestle the fish among the orange and fennel, then scatter over the remaining salad and herbs. Add a splash of juice from the bowl, plus a trickle more oil. Sprinkle with a pinch of the remaining ground fennel seeds and serve."}], "nutrition": {"Energy": "2,482kJ 595kcals", "Fat": "33g", "Saturated Fat": "7.6g", "Carbohydrate": "23g", "Sugars": "22g", "Protein": "43g", "Salt": "0.4g", "Fibre": "9.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/Warm-salmon-salad.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}