{"title": "Warm roast chicken and quinoa salad with sweet potato, cavolo nero and walnuts", "tags": null, "planning": {"prep_time": "PT20 minutes, plus restingM", "cook_time": "PT1 hour 50 minutesM", "total_time": null, "serves": "6"}, "ingredients": [{"item": "2 red onions, thinly sliced"}, {"item": "2 garlic cloves, sliced"}, {"item": "700g sweet potatoes, scrubbed clean and cut into roughly 3cm chunks"}, {"item": "3 thyme sprigs"}, {"item": "1½ tbsp olive oil"}, {"item": "1.5kg whole chicken, string removed"}, {"item": "150ml Cooks' Ingredients chicken stock"}, {"item": "1½ lemons, halved"}, {"item": "½ tsp ground allspice"}, {"item": "2 x 250g packs ready-cooked red and white quinoa"}, {"item": "200g pack thick-cut cavolo nero"}, {"item": "50g walnuts"}, {"item": "100g pomegranate seeds"}], "instructions": [{"step": "Preheat the oven to 200°C, gas mark 6. Toss the onions, garlic, potatoes and thyme with 1 tbsp oil, season and spread out in a large roasting tin. Put the chicken, breast-side down, on top of the onions and potatoes. Roast for 20 minutes."}, {"step": "Take the roasting tin out of the oven. Turn the chicken so it is breast-side up, give the vegetables a stir and pour the chicken stock into the base of the tin. Squeeze the juice of 1 lemon over the chicken and put the shells in the cavity. Drizzle the skin with the remaining ½ tbsp oil, season and sprinkle with the allspice. Lower the oven temperature to 180°C, gas mark 4 and return the roasting tin to the oven for 1 hour."}, {"step": "Remove the roasting tin from the oven. Test the chicken is cooked by inserting a skewer into the thickest part of the thigh. If the juices run clear and there is no pink meat, it's ready – if they are still pink, roast for another 15 minutes, then test again. Lift the chicken and allow the juices from the cavity to run into the tin. Set the chicken aside on a plate with the sweet potatoes. Loosely cover with foil and leave to rest for 20 minutes. Spoon half the roasting juices out of the tin and into a small saucepan; set aside."}, {"step": "Stir the cooked quinoa and the cavolo nero into the roasting tin, tossing with the onions and roasting juices, and seasoning with the remaining juice of ½ lemon and a pinch of salt. Return to the oven for 20 minutes, stirring halfway. Put the walnuts on a small baking tray and add to the oven for the final 10 minutes."}, {"step": "Carve the chicken (adding any more juices to the saucepan). Roughly chop the walnuts. Arrange the quinoa, sweet potatoes and carved chicken on a large serving dish or individual plates. Reheat the roasting juices and spoon over the top, scattering with the chopped walnuts and pomegranate seeds to serve."}], "nutrition": {"Energy": "2,383kJ 568kcals", "Fat": "21g", "Saturated Fat": "3.8g", "Carbohydrate": "56g", "Sugars": "14g", "Protein": "33g", "Salt": "0.9g", "Fibre": "9g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/warm_roast_chicken_quinoa_salad_2048.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}