{"title": "Whiskey-Glazed Steak Tortilla Wraps", "tags": null, "planning": {"prep_time": "PT15 minutes, plus at least 3 hours marinatingM", "cook_time": "PT35M", "total_time": "PT40-50 minutes, plus at least 3 hours marinatingM", "serves": "Makes 8 wraps"}, "ingredients": [{"item": "150ml Jack Daniels Tennessee Whiskey"}, {"item": "4 tbsp tomato ketchup"}, {"item": "4 tbsp clear honey"}, {"item": "2 tbsp Dijon mustard"}, {"item": "50g light brown soft sugar"}, {"item": "1 tbsp Lea & Perrins Worcestershire Sauce"}, {"item": "2 cloves garlic, crushed"}, {"item": "800g Aberdeen Angus rump steak"}, {"item": "4 red onions, halved and thickly sliced"}, {"item": "1 tbsp olive oil"}, {"item": "2 x 400g packs Original Deliwrap Wheatflour Tortillas (you will be left with 4 spare tortillas, which can be frozen)"}], "instructions": [{"step": "In a large, shallow dish, mix together the whiskey, tomato ketchup, honey, mustard, sugar, Worcestershire sauce and garlic. Add the steak (keep in 1 piece or cut into 4 servings), turning to coat. Cover and leave to marinate in the fridge for 3-4 hours or overnight.  Preheat the oven to 200°C, gas mark 6. Place the onions in a roasting tin and drizzle with the oil. Roast in the oven for 20-25 minutes, stirring halfway through the cooking time, until slightly charred and softened. Meanwhile, drain the marinade from the steak and pour it into a medium-sized pan. Bring to the boil, then simmer gently for 15-20 minutes, stirring occasionally until thickened. Allow to cool.  Place half the cooled sauce in a small bowl and use to brush the steak. Reserve the remaining sauce. Place the steak on a hot barbecue or under a preheated grill and cook for 2 1⁄2 minutes each side for rare, 4 minutes each side for medium and 6 minutes each side for well-done, basting the meat occasionally.  Place the tortillas on the barbecue and cook for 30 seconds on each side (or heat according to pack instructions). Cut the steak into thin strips and serve with the onions and reserved sauce, rolled in the warmed tortillas."}], "nutrition": {"Energy": "2117.104kJ 506.0kcal", "Fat": "12.4g", "Saturated Fat": "4.7g", "Salt": "2.8g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/0505ss08-r03.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}