{"title": "White wine braised leg of lamb", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT15 minutes  + restingM", "cook_time": "PT3 hours 50 minutesM", "total_time": "PT4 hours 5 minutes  + restingM", "serves": "4-6 with leftovers"}, "ingredients": [{"item": "2kg leg of lamb~"}, {"item": "2 bulbs garlic"}, {"item": "3 anchovies, roughly chopped"}, {"item": "2 tbsp olive oil"}, {"item": "450ml dry, full-bodied white wine (Chardonnay, Semillon or Chenin Blanc)"}, {"item": "3 echalion shallots"}, {"item": "½ x 20g pack thyme"}], "instructions": [{"step": "Preheat the oven to 230ºC, gas mark 8. Put the lamb in a fairly snug-fitting roasting tin. Cut the garlic bulbs in half through the middle; remove the equivalent of 3 full cloves, roughly chop, then use a pestle and mortar to pound into a purée with a pinch of sea salt flakes. Mash in the anchovies, then stir in the oil. Rub this paste all over the lamb, paying particular attention to the fleshy surfaces."}, {"step": "Put in the oven for 20 minutes, until the fat and edges of the meat are burnished. Reduce the temperature to 160ºC, gas mark 3, and remove the tin from the oven. Pour the wine into the hot tin, add 200ml water and arrange the shallots, halved garlic bulbs and thyme sprigs around the lamb. Carefully tent the tin with foil, then return to the oven for 3 hours 30 minutes."}, {"step": "Rest the lamb, still covered with the foil, for 15 minutes. Slice the soft and succulent meat into big chunks, cutting at right angles to the direction of the bone. Serve with a spoonful or two of the cooking liquor, plus the sauce, potatoes and vegetables."}], "nutrition": {"Energy": "1,887kJ 453kcals", "Fat": "28g", "Saturated Fat": "9.9g", "Carbohydrate": "1.2g", "Sugars": "0.5g", "Protein": "43g", "Salt": "0.5g", "Fibre": "0.5g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/Thumbnail_Lamb_162.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}