{"title": "White chocolate blancmange with blueberries", "tags": null, "planning": {"prep_time": "PT20 minutes, plus cooling and settingM", "cook_time": "PT5M", "total_time": "PT25M", "serves": "6"}, "ingredients": [{"item": "5 sheets Costa Leaf Gelatine"}, {"item": "15g cornflour"}, {"item": "300ml semi-skimmed or full-fat milk"}, {"item": "50g caster sugar"}, {"item": "300ml tub single cream"}, {"item": "200g Waitrose Belgian White Chocolate, broken into piece"}, {"item": "For the berries"}, {"item": "180g blueberries"}, {"item": "2 tbsp caster sugar"}, {"item": "squeeze of lemon juice"}], "instructions": [{"step": "Place the gelatine in a bowl of cold water and leave to soften. Meanwhile, put the cornflour in a saucepan and gradually blend in a little of the milk until smooth. Stir in the remaining milk. Add the sugar and cream, then heat and bring to the boil, stirring continuously with a wooden spoon until thick and beginning to boil up."}, {"step": "Lift the softened gelatine out of the water and lower it into the custard. Stir until dissolved. Tip in the chocolate and leave for a few minutes, stirring frequently, until melted. Pour into a jelly mould with a capacity of about 800ml. (Or use individual moulds or a small trifle dish.) Leave to cool completely, then chill for at least 4 hours or until the blancmange is set."}, {"step": "Put the blueberries in a bowl and prick all over with a fork to release the juices. (You needn’t be too precise with this, simply prod the berries roughly.) Add the sugar and a squeeze of lemon juice and leave to stand for about 30 minutes, stirring frequently until the sugar has dissolved and the juices are syrupy."}, {"step": "If using a jelly mould, fill a large heatproof bowl with very hot water. Loosen the top edges of the blancmange from the mould with the tip of a knife. Lower the mould into the water and leave for a few seconds. Lift out, rest a flat serving plate on top and invert. Shake the mould until you feel the blancmange loosening then lift away the mould. (You might need to re-dip the mould several times; metal and plastic moulds will be quicker to loosen than glass or ceramic. Take care not to dip them for too long or the blancmange will melt.)"}, {"step": "Spoon the blueberries over or around the blancmange to serve."}], "nutrition": {"Energy": "1669.416kJ 399kcals", "Fat": "21.1g", "Saturated Fat": "12.9g", "Carbohydrate": "44.8g", "Sugars": "41.3g", "Salt": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/201204-harv-early-sum-r02.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}