{"title": "Whole chicken red curry with Thai basil", "tags": [{"tag": "Gluten Free"}], "planning": {"prep_time": "PT20 minutes, plus cooling, marinating and restingM", "cook_time": "PT50M", "total_time": "PT1 hour 10 minutes, plus cooling, marinating and restingM", "serves": "6"}, "ingredients": [{"item": "100ml coconut oil"}, {"item": "200g Thai Taste red curry paste"}, {"item": "1 tbsp palm (or light brown soft) sugar"}, {"item": "2-3 tbsp fish sauce, to taste"}, {"item": "200ml fresh chicken stock"}, {"item": "160ml can coconut cream"}, {"item": "1 small chicken (about 1-1.3 kg)"}, {"item": "20g (about 5-6) green beans, trimmed and cut into 2cm lengths"}, {"item": "20g (about 2-3) baby corn, sliced into rounds"}, {"item": "handful Thai basil leaves, plus extra to serve"}, {"item": "2 red Thai chillies, sliced into rounds"}, {"item": "2 green Thai chillies, sliced into rounds"}, {"item": "2 tbsp fresh root ginger, thinly sliced"}, {"item": "handful coriander leaves, to serve"}], "instructions": [{"step": "Heat the coconut oil in a wok; when it’s bubbling, add the red curry paste and keep stirring and scraping regularly until the paste begins to split like scrambled eggs. The smell of the ingredients will also change from raw to fragrant. (I fi nd as you cook out curry pastes you can smell each ingredient cooking at different times, and eventually the smell becomes one, which is a clear sign that it is ready.) At this point, add the sugar and continue to scrape and cook for a further minute, until the paste has darkened slightly. Add 2 tbsp fi sh sauce and stir into the paste for 1 minute, then add the chicken stock and 80ml coconut cream. Remove ½ of the resulting curry paste and leave to cool; set aside the pan with the remaining curry paste."}, {"step": "Use the cooled paste to coat the chicken thoroughly; you can leave it to marinate for a few hours in the fridge (ideally overnight), or cook it straight away. When ready to cook, preheat the oven to 220˚C, gas mark 7. Put the chicken in a roasting tray and roast for 35-40 minutes, until the skin is crispy and the curry paste marinade has slightly charred. Check that the juices are running clear and that the chicken is cooked through before removing from the oven; leave it to rest for at least 10 minutes."}, {"step": "Meanwhile, bring the rest of the cooked-out curry paste back to a simmer. Stir in the green beans and baby corn, cover and simmer for around 8 minutes, until tender but with a little bite. At this point add the remaining 80ml coconut cream and fold in the Thai basil leaves, chillies and ginger. Add more fi sh sauce to taste – the curry should be spicy, creamy, aromatic, sweet and salty. Pour over the chicken and serve any remaining sauce on the side. Scatter the coriander and some more Thai basil leaves over the chicken and serve immediately."}], "nutrition": {"Energy": "2,555kJ 615kcals", "Fat": "47.1g", "Saturated Fat": "25.9g", "Carbohydrate": "9.2g", "Sugars": "4.9g", "Protein": "38.6g", "Salt": "1.6g", "Fibre": "0.2g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/Whole-chicken-red-curry-with-thai-basil.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}