{"title": "Whole steamed sea bass with crab fried rice", "tags": null, "planning": {"prep_time": "PT1M", "cook_time": "PT40M", "total_time": "PT100M", "serves": "4"}, "ingredients": [{"item": "4 whole sea bass (about 300-400g each), scaled, gutted and cleaned"}, {"item": "4 limes, pared zest and juice"}, {"item": "80g coriander, leaves and stalks separated"}, {"item": "3 garlic cloves, finely sliced"}, {"item": "150g fresh root ginger, finely sliced"}, {"item": "9 tbsp dark soy sauce"}, {"item": "90ml mirin rice wine"}, {"item": "4 salad onions, shredded"}, {"item": "lime wedges, to serve"}, {"item": "Crab fried rice"}, {"item": "2 tbsp rapeseed oil"}, {"item": "2 garlic cloves, crushed"}, {"item": "2 eggs"}, {"item": "200g jasmine rice, cooked according to pack instructions, then cooled until just warm"}, {"item": "2 tbsp light soy sauce"}, {"item": "200g white crab meat"}, {"item": "3 salad onions, finely sliced"}, {"item": "Beansprout salad"}, {"item": "2 tbsp sesame oil"}, {"item": "1 garlic clove, crushed"}, {"item": "300g beansprouts"}, {"item": "235g pak choi, leaves separated"}, {"item": "2 tbsp fish sauce"}, {"item": "1 Thai chilli, finely sliced"}, {"item": "1 tbsp lime juice"}], "instructions": [{"step": "Preheat the oven to 180°C, gas mark 4. Make 3 slashes on each side of the fish. Mix together the lime zest, coriander stalks, garlic, shallots and half the ginger, then stuff inside the cavity of the fish. Tie each fish with kitchen strin to seal the filling inside."}, {"step": "Pour 400ml water, 3 tbsp dark soy sauce, the mirin and the lime juice into a large roasting tin. Sit the fish on a wire rack on top. Pour the remaining soy sauce over the fish and sprinkle over the remaining ginger. Cover the tin tightly with foil, leaving space above the fish for the air to circulate. Bake for 20 minutes, by which point the flesh should be white through to the bone (which is exposed by the cuts). If the flesh is still translucent, replace the foil and steam for a few minutes more."}, {"step": "Meanwhile, make the rice. Heat the oil in a large frying pan or wok; add the garlic and a pinch of salt and fry intil aromatic. Add the eggs; allow them to set slightly before scrambling."}, {"step": "While the eggs are soft, add the rice and turn the heat down. Toss until all the grains are well coated. If it appears too dry, add a little extra oil. Season with the soy sauce and a pinch of sugar and white pepper. Continue to fry until well combined. Stir in the crab and salad onions; set aside until ready to serve."}, {"step": "Make the beansprout salad just before serving. Heat the oil in a hot pan, then add the garlic, beansprouts and pak choi. Sauté quickly for 2 minutes, then remove from the heat and add the fish sauce and chilli; finish with the lime juice."}, {"step": "Serve the fish sprinkled with the salad onions and coriander leaves, and with the lime wedges, rice and salad on the side."}], "nutrition": {"Energy": "- 547Kcal", "Fat": "25.4g", "Saturated Fat": "3.8g", "Carbohydrate": "50.8g", "Sugars": "6.4g", "Protein": "51.6g", "Salt": "4.1g", "Fibre": "2.7g"}, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/w/SeabassPlated_200x200.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}