{"title": "Will Torrent's Spiced ginger & honey cake", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "6 - 8"}, "ingredients": [{"item": "100g butter"}, {"item": "100g dark muscovado sugar"}, {"item": "2 tbsp golden syrup"}, {"item": "75g honey"}, {"item": "100g black treacle"}, {"item": "Grated zest of 1 orange"}, {"item": "150g self-raising flour"}, {"item": "2 tsp ground ginger"}, {"item": "1 tsp mixed spice"}, {"item": "1 tsp ground cinnamon"}, {"item": "½ tsp ground cloves"}, {"item": "3 balls preserved ginger, finely chopped (reserve the syrup)"}, {"item": "2 eggs"}, {"item": "5 tbsp milk"}, {"item": "3 tbsp apricot jam"}, {"item": "1½ tbsp honey"}], "instructions": [{"step": "Preheat the oven to 160°C, gas mark 3."}, {"step": "Put the butter, sugar, syrup, honey, treacle and orange zest in a saucepan over medium heat and cook until melted. Stir well, then remove from the heat and allow to cool slightly while you continue with the recipe."}, {"step": "Sift the flour into a mixing bowl and add the ground ginger, mixed spice, cinnamon and cloves and two-thirds of the chopped ginger. Mix together."}, {"step": "Add the cooled melted mixture, followed by the eggs and milk. Mix thoroughly with a wooden spoon."}, {"step": "Spoon the mixture into the prepared loaf pan and bake in the preheated oven for about 1 hour. The cake should be risen and deep golden brown."}, {"step": "Put the jam, 2 tbsp of the reserved ginger syrup, the honey and remaining chopped preserved ginger in a saucepan over a low heat. Heat gently until it starts to bubble. Set aside until the cake has baked. It can be warmed up later if necessary."}, {"step": "Remove the baked cake from the oven, carefully tip it out of the pan and set it on a wire rack. Put the hot glaze over it and serve warm."}, {"step": "This recipe is an extract from Pâtisserie at Home by Will Torrent, photographs by Jonathan Gregson (Ryland Peters & Small, £19.99)."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/g/GingerCake_400x400.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}